<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
<meta name="viewport" content="width=device-width">
<meta name="theme-color" content="#222"><meta name="generator" content="Hexo 6.3.0">

  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png">
  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png">
  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png">
  <link rel="mask-icon" href="/images/logo.svg" color="#222">

<link rel="stylesheet" href="/css/main.css">



<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/7.0.0/css/all.min.css" integrity="sha256-VHqXKFhhMxcpubYf9xiWdCiojEbY9NexQ4jh8AxbvcM=" crossorigin="anonymous">
  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/animate.css/3.1.1/animate.min.css" integrity="sha256-PR7ttpcvz8qrF57fur/yAx1qXMFJeJFiA6pSzWi0OIE=" crossorigin="anonymous">

<script class="next-config" data-name="main" type="application/json">{"hostname":"shiqingxu.gthub.io","root":"/","images":"/images","scheme":"Muse","darkmode":false,"version":"8.24.1","exturl":false,"sidebar":{"position":"left","width_expanded":320,"width_dual_column":240,"display":"post","padding":18,"offset":12},"hljswrap":true,"codeblock":{"theme":{"light":"default","dark":"stackoverflow-dark"},"prism":{"light":"prism","dark":"prism-dark"},"copy_button":{"enable":false,"style":null},"fold":{"enable":false,"height":500},"language":false},"bookmark":{"enable":false,"color":"#222","save":"auto"},"mediumzoom":false,"lazyload":false,"pangu":false,"comments":{"style":"tabs","active":null,"storage":true,"lazyload":false,"nav":null},"stickytabs":false,"motion":{"enable":true,"async":false,"duration":200,"transition":{"menu_item":"fadeInDown","post_block":"fadeIn","post_header":"fadeInDown","post_body":"fadeInDown","coll_header":"fadeInLeft","sidebar":"fadeInUp"}},"prism":false,"i18n":{"placeholder":"Searching...","empty":"We didn't find any results for the search: ${query}","hits_time":"${hits} results found in ${time} ms","hits":"${hits} results found"}}</script><script src="/js/config.js" defer></script>

    <meta name="description" content="&amp;#x591A;&amp;#x5E74;&amp;#x6765;&amp;#xFF0C;&amp;#x6211;&amp;#x5BF9;&amp;#x4E8E;&amp;#x65E5;&amp;#x5E38;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x8F6F;&amp;#x4EF6;&amp;#x4E00;&amp;#x76F4;&amp;#x6709;&amp;#x4E00;&amp;#x4E9B;&amp;#x5F3A;&amp;#x8FEB;&amp;#x75C7;&amp;#xFF0C;&amp;#x6216;&amp;#x8005;">
<meta property="og:type" content="article">
<meta property="og:title" content="开始使用国产软件WPS和微信输入法">
<meta property="og:url" content="https://shiqingxu.gthub.io/2025/08/25/useing-wps-and-wetype/index.html">
<meta property="og:site_name" content="十四">
<meta property="og:description" content="&amp;#x591A;&amp;#x5E74;&amp;#x6765;&amp;#xFF0C;&amp;#x6211;&amp;#x5BF9;&amp;#x4E8E;&amp;#x65E5;&amp;#x5E38;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x8F6F;&amp;#x4EF6;&amp;#x4E00;&amp;#x76F4;&amp;#x6709;&amp;#x4E00;&amp;#x4E9B;&amp;#x5F3A;&amp;#x8FEB;&amp;#x75C7;&amp;#xFF0C;&amp;#x6216;&amp;#x8005;">
<meta property="og:locale" content="en_US">
<meta property="article:published_time" content="2025-08-25T00:41:34.000Z">
<meta property="article:modified_time" content="2025-08-26T00:14:23.313Z">
<meta property="article:author" content="14says">
<meta property="article:tag" content="折腾">
<meta property="article:tag" content="感想">
<meta name="twitter:card" content="summary">


<link rel="canonical" href="https://shiqingxu.gthub.io/2025/08/25/useing-wps-and-wetype/">


<script class="next-config" data-name="page" type="application/json">{"sidebar":"","isHome":false,"isPost":true,"lang":"en","comments":true,"permalink":"https://shiqingxu.gthub.io/2025/08/25/useing-wps-and-wetype/","path":"2025/08/25/useing-wps-and-wetype/","title":"开始使用国产软件WPS和微信输入法"}</script>

<script class="next-config" data-name="calendar" type="application/json">""</script>
<title>开始使用国产软件WPS和微信输入法 | 十四</title>
  








  
  <script src="https://cdnjs.cloudflare.com/ajax/libs/animejs/3.2.1/anime.min.js" integrity="sha256-XL2inqUJaslATFnHdJOi9GfQ60on8Wx1C2H8DYiN1xY=" crossorigin="anonymous" defer></script>
<script src="/js/utils.js" defer></script><script src="/js/motion.js" defer></script><script src="/js/sidebar.js" defer></script><script src="/js/next-boot.js" defer></script>

  






  





  <noscript>
    <link rel="stylesheet" href="/css/noscript.css">
  </noscript>
<link rel="alternate" href="/atom.xml" title="十四" type="application/atom+xml">
</head>

<body itemscope itemtype="http://schema.org/WebPage" class="use-motion">
  <div class="headband"></div>

  <main class="main">
    <div class="column">
      <header class="header" itemscope itemtype="http://schema.org/WPHeader"><div class="site-brand-container">
  <div class="site-nav-toggle">
    <div class="toggle" aria-label="Toggle navigation bar" role="button">
    </div>
  </div>

  <div class="site-meta">

    <a href="/" class="brand" rel="start">
      <i class="logo-line"></i>
      <p class="site-title">十四</p>
      <i class="logo-line"></i>
    </a>
  </div>

  <div class="site-nav-right">
    <div class="toggle popup-trigger" aria-label="Search" role="button">
    </div>
  </div>
</div>







</header>
        
  
  <aside class="sidebar">

    <div class="sidebar-inner sidebar-overview-active">
      <ul class="sidebar-nav">
        <li class="sidebar-nav-toc">
          Table of Contents
        </li>
        <li class="sidebar-nav-overview">
          Overview
        </li>
      </ul>

      <div class="sidebar-panel-container">
        <!--noindex-->
        <div class="post-toc-wrap sidebar-panel">
        </div>
        <!--/noindex-->

        <div class="site-overview-wrap sidebar-panel">
          <div class="site-author animated" itemprop="author" itemscope itemtype="http://schema.org/Person">
  <p class="site-author-name" itemprop="name">14says</p>
  <div class="site-description" itemprop="description"></div>
</div>
<div class="site-state-wrap animated">
  <nav class="site-state">
      <div class="site-state-item site-state-posts">
        <a href="/archives/">
          <span class="site-state-item-count">27</span>
          <span class="site-state-item-name">posts</span>
        </a>
      </div>
      <div class="site-state-item site-state-tags">
        <span class="site-state-item-count">9</span>
        <span class="site-state-item-name">tags</span>
      </div>
  </nav>
</div>

        </div>
      </div>
    </div>

    
  </aside>


    </div>

    <div class="main-inner post posts-expand">


  


<div class="post-block">
  
  

  <article itemscope itemtype="http://schema.org/Article" class="post-content" lang="en">
    <link itemprop="mainEntityOfPage" href="https://shiqingxu.gthub.io/2025/08/25/useing-wps-and-wetype/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/images/avatar.gif">
      <meta itemprop="name" content="14says">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="十四">
      <meta itemprop="description" content="">
    </span>

    <span hidden itemprop="post" itemscope itemtype="http://schema.org/CreativeWork">
      <meta itemprop="name" content="开始使用国产软件WPS和微信输入法 | 十四">
      <meta itemprop="description" content="">
    </span>
      <header class="post-header">
        <h1 class="post-title" itemprop="name headline">
          开始使用国产软件WPS和微信输入法
        </h1>

        <div class="post-meta-container">
          <div class="post-meta">
    <span class="post-meta-item">
      <span class="post-meta-item-icon">
        <i class="far fa-calendar"></i>
      </span>
      <span class="post-meta-item-text">Posted on</span>

      <time title="Created: 2025-08-25 08:41:34" itemprop="dateCreated datePublished" datetime="2025-08-25T08:41:34+08:00">2025-08-25</time>
    </span>
    <span class="post-meta-item">
      <span class="post-meta-item-icon">
        <i class="far fa-calendar-check"></i>
      </span>
      <span class="post-meta-item-text">Edited on</span>
      <time title="Modified: 2025-08-26 08:14:23" itemprop="dateModified" datetime="2025-08-26T08:14:23+08:00">2025-08-26</time>
    </span>

  
</div>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody"><p>&#x591A;&#x5E74;&#x6765;&#xFF0C;&#x6211;&#x5BF9;&#x4E8E;&#x65E5;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x4E00;&#x76F4;&#x6709;&#x4E00;&#x4E9B;&#x5F3A;&#x8FEB;&#x75C7;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x6D01;&#x7656;&#xFF0C;&#x90E8;&#x5206;&#x662F;&#x51FA;&#x4E8E;&#x907F;&#x514D;&#x6CC4;&#x9732;&#x9690;&#x79C1;&#x7684;&#x8003;&#x8651;&#x3001;&#x90E8;&#x5206;&#x662F;&#x51FA;&#x4E8E;&#x53D7;&#x4E0D;&#x4E86;&#x5F88;&#x591A;&#x56FD;&#x4EA7;&#x8F6F;&#x4EF6;&#x4E0D;&#x505C;&#x5F39;&#x5E7F;&#x544A;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x4E0D;&#x592A;&#x559C;&#x6B22;&#x81C3;&#x80BF;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x4E0D;&#x8FC7;&#x8FD1;&#x671F;&#x56E0;&#x4E3A;&#x5DE5;&#x4F5C;&#x7684;&#x7F18;&#x6545;&#xFF0C;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x653E;&#x5728;&#x4EE5;&#x524D;&#x7684;&#x6211;&#x662F;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;WPS&#x548C;&#x5FAE;&#x4FE1;&#x8F93;&#x5165;&#x6CD5;&#x3002;</p>
<span id="more"></span>
<p>&#x5173;&#x4E8E;WPS&#xFF0C;&#x4EE5;&#x524D;&#x6CA1;&#x7528;&#x8FC7;&#x7684;&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x8FD9;&#x6B3E;&#x8F6F;&#x4EF6;&#x5B58;&#x5728;&#x7684;&#x5386;&#x53F2;&#x5DF2;&#x7ECF;&#x5F88;&#x4E45;&#x8FDC;&#x4E86;&#xFF0C;&#x6211;&#x5BF9;&#x5176;&#x5370;&#x8C61;&#x8FD8;&#x505C;&#x7559;&#x5728;&#x5927;&#x5B66;&#x65F6;&#x540C;&#x5B66;&#x4EEC;&#x906D;&#x9047;&#x7684;&#x683C;&#x5F0F;&#x4E0E;&#x5FAE;&#x8F6F;&#x7684;office&#x5957;&#x4EF6;&#x517C;&#x5BB9;&#x6027;&#x4E0D;&#x5B8C;&#x7F8E;&#xFF0C;&#x4EE5;&#x53CA;&#x524D;&#x51E0;&#x5E74;&#x542C;&#x8BF4;&#x7684;&#x4E22;&#x6570;&#x636E;&#x6253;&#x5BA2;&#x670D;&#x7535;&#x8BDD;&#x65E0;&#x6CD5;&#x6062;&#x590D;&#x4F46;&#x662F;&#x4E70;&#x4F1A;&#x5458;&#x5C31;&#x53EF;&#x4EE5;&#x6062;&#x590D;&#x4E4B;&#x7C7B;&#x7684;&#x4F20;&#x95FB;&#x3002;&#x8FD9;&#x4E9B;&#x5E74;&#x4E00;&#x76F4;&#x8BA2;&#x9605;&#x5FAE;&#x8F6F;&#x7684; office 365 &#x5BB6;&#x5EAD;&#x7248;&#xFF0C;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x4E00;&#x5207;&#x5173;&#x4E8E;&#x6587;&#x6863;&#x5904;&#x7406;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x8BD5;&#x7528;WPS&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x5468;&#x56F4;&#x592A;&#x591A;&#x4EBA;&#x7528;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x80FD;&#x5927;&#x6982;&#x89C2;&#x5BDF;&#x5230;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x7684;&#x5E76;&#x4E0D;&#x600E;&#x4E48;&#x597D;&#x770B;&#x7684;&#x754C;&#x9762;&#x548C;&#x5F39;&#x7A97;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x66F4;&#x662F;&#x5FC3;&#x751F;&#x538C;&#x6076;&#x3002;</p>
<p>&#x8FD9;&#x6B21;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x7684;&#x5951;&#x673A;&#x662F;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E2D;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x8DDF;&#x56FD;&#x5916;&#x7684;&#x540C;&#x4E8B;&#x5F00;&#x4F1A;&#xFF0C;&#x7EC4;&#x91CC;&#x540C;&#x4E8B;&#x7ED9;&#x6211;&#x5C55;&#x793A;&#x4E86;WPS&#x7684;&#x8BED;&#x97F3;&#x901F;&#x8BB0;&#x529F;&#x80FD;&#xFF0C;&#x80FD;&#x591F;&#x5C06;&#x4F1A;&#x8BAE;&#x5F55;&#x4E0B;&#x6765;&#x8F6C;&#x6210;&#x6587;&#x5B57;&#x5E76;&#x7FFB;&#x8BD1;&#xFF0C;&#x8C03;&#x7528;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x8BAF;&#x98DE;&#x7684;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x6BD4;&#x8F83;&#x5207;&#x4E2D;&#x6211;&#x7684;&#x75DB;&#x70B9;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x76F4;&#x63A5;&#x8D2D;&#x4E70;&#x8BAF;&#x98DE;&#x4F1A;&#x5458;&#x4E5F;&#x5E76;&#x4E0D;&#x4FBF;&#x5B9C;&#xFF0C;&#x8D2D;&#x4E70;WPS&#x4F1A;&#x5458;&#x7684;&#x8BDD;&#x9664;&#x4E86;&#x8BED;&#x97F3;&#x901F;&#x8BB0;&#x4E0E;&#x7FFB;&#x8BD1;&#x8FD8;&#x80FD;&#x83B7;&#x5F97;&#x4E00;&#x5957;&#x529E;&#x516C;&#x8F6F;&#x4EF6;&#xFF0C;&#x6070;&#x9022;&#x8D2D;&#x7269;&#x8282;&#x4E8E;&#x662F;&#x4EE5;&#x6BCF;&#x5E74;&#x767E;&#x5143;&#x51FA;&#x5934;&#x7684;&#x4EF7;&#x683C;&#x76F4;&#x63A5;&#x4E70;&#x4E86;&#x4E09;&#x5E74;&#x5927;&#x4F1A;&#x5458;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x6211;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x6709;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x81EA;&#x6253;&#x5341;&#x51E0;&#x5E74;&#x524D;&#x5F00;&#x59CB;&#x7528;&#x5C0F;&#x72FC;&#x6BEB;&#x4EE5;&#x6765;&#xFF0C;&#x7535;&#x8111;&#x4E0A;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x7528;&#x8FD9;&#x4E2A;&#x3002;&#x4E3B;&#x529B;&#x673A;&#x4ECE;win&#x5207;&#x6362;&#x5230;mac&#x4E4B;&#x540E;&#xFF0C;&#x5728;mac&#x4E0A;&#x7528;&#x540C;&#x662F;&#x57FA;&#x4E8E;RIME&#x8F93;&#x5165;&#x6CD5;&#x5F15;&#x64CE;&#x5F00;&#x53D1;&#x7684;&#x4E2D;&#x5DDE;&#x97F5;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x800C;Windows&#x7531;&#x4E8E;&#x7528;&#x7684;&#x5C11;&#xFF0C;&#x67D0;&#x6B21;&#x91CD;&#x88C5;&#x7CFB;&#x7EDF;&#x4E4B;&#x540E;&#x5C31;&#x61D2;&#x5F97;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x7CFB;&#x7EDF;&#x5185;&#x7F6E;&#x7684;&#x5FAE;&#x8F6F;&#x62FC;&#x97F3;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x5FAE;&#x8F6F;&#x62FC;&#x97F3;&#x5076;&#x5C14;&#x7528;&#x4E00;&#x4E0B;&#x8FD8;&#x884C;&#xFF0C;&#x4F5C;&#x4E3A;&#x65E5;&#x5E38;&#x8F93;&#x5165;&#x6CD5;&#x7684;&#x8BDD;&#x4E0D;&#x592A;&#x8DDF;&#x624B;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5B83;&#x7684;&#x5019;&#x9009;&#x8BCD;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x6211;&#x603B;&#x662F;&#x4E0D;&#x80FD;&#x9002;&#x5E94;&#xFF0C;&#x5BFC;&#x81F4;&#x7ECF;&#x5E38;&#x8F93;&#x5165;&#x9519;&#x522B;&#x5B57;&#x3002;&#x6700;&#x65B0;&#x7684;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x516C;&#x53F8;&#x914D;&#x53D1;&#x7684;&#x662F;thinkpad&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5FAE;&#x8F6F;&#x62FC;&#x97F3;&#x4E4B;&#x540E;&#x4E0D;&#x5F97;&#x4E0D;&#x91CD;&#x65B0;&#x5B89;&#x88C5;&#x4E86;&#x5C0F;&#x72FC;&#x6BEB;&#xFF0C;&#x5E76;&#x5BFC;&#x5165;&#x4E86;&#x5341;&#x51E0;&#x5E74;&#x6765;&#x79EF;&#x7D2F;&#x7684;&#x4E2A;&#x4EBA;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6211;&#x6709;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x4E2D;&#x82F1;&#x6DF7;&#x8F93;&#x9700;&#x6C42;&#xFF0C;&#x8FD9;&#x4E2A;&#x9700;&#x6C42;&#x5728;&#x5C0F;&#x72FC;&#x6BEB;&#x4E0A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x4E0D;&#x96BE;&#xFF0C;&#x4F46;&#x6211;&#x5728;Gemini&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#x5C1D;&#x8BD5;&#x4E86;&#x4E24;&#x4E09;&#x6B21;&#xFF0C;&#x5747;&#x4EE5;&#x5931;&#x8D25;&#x544A;&#x7EC8;&#x3002;&#x6700;&#x540E;&#x5FC3;&#x60F3;&#xFF0C;&#x522B;&#x6298;&#x817E;&#x4E86;&#xFF0C;&#x5C31;&#x88C5;&#x4E2A;&#x56FD;&#x4EA7;&#x8F93;&#x5165;&#x6CD5;&#x8BD5;&#x8BD5;&#x5427;&#x3002;&#x641C;&#x72D7;&#x8FC7;&#x4E8E;&#x82B1;&#x54E8;&#xFF0C;&#x60F3;&#x8D77;&#x6765;&#x521A;&#x63A8;&#x51FA;&#x4E0D;&#x4E45;&#x7684;&#x5FAE;&#x4FE1;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#x754C;&#x9762;&#x6BD4;&#x8F83;&#x7B80;&#x6D01;&#xFF0C;&#x4E8E;&#x662F;&#x5B89;&#x88C5;&#x8BD5;&#x7528;&#x3002;</p>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x8F6F;&#x4EF6;&#x8BD5;&#x7528;&#x7684;&#x6548;&#x679C;&#x90FD;&#x8D85;&#x51FA;&#x4E86;&#x6211;&#x7684;&#x9884;&#x671F;&#x3002;&#x9996;&#x5148;&#x662F;WPS&#xFF0C;&#x9664;&#x4E86;AI&#x901F;&#x8BB0;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4E5F;&#x5C1D;&#x8BD5;&#x7528;&#x5B83;&#x6765;&#x529E;&#x516C;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6BD4;office&#x5957;&#x4EF6;&#x66F4;&#x6613;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x96C6;&#x6210;&#x4E86;AI&#x529F;&#x80FD;&#x3002;&#x516C;&#x53F8;&#x6709;&#x4E00;&#x4E2A;&#x6211;&#x7ECF;&#x5E38;&#x4F1A;&#x7528;&#x5230;&#x7684;&#x6587;&#x4EF6;&#x6A21;&#x677F;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4F55;&#x7528;word&#x6253;&#x5F00;&#x7F16;&#x8F91;&#x65F6;&#x603B;&#x4F1A;&#x6BD4;&#x8F83;&#x5361;&#x987F;&#xFF0C;&#x800C;&#x4E14;&#x683C;&#x5F0F;&#x5BB9;&#x6613;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x7528;WPS&#x95EE;&#x9898;&#x5C31;&#x5C11;&#x5F97;&#x591A;&#xFF0C;&#x4E8E;&#x662F;WPS&#x9010;&#x6E10;&#x53D8;&#x6210;&#x4E86;&#x6211;&#x7684;&#x529E;&#x516C;&#x5957;&#x4EF6;&#x4E3B;&#x529B;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x559C;&#x6B22;&#x5F39;&#x7A97;&#x3001;&#x559C;&#x6B22;&#x81EA;&#x5DF1;&#x6253;&#x5F00;&#x4E00;&#x4E9B;&#x63A8;&#x5E7F;&#x9875;&#x9762;&#x7684;&#x95EE;&#x9898;&#x786E;&#x5B9E;&#x5F88;&#x70E6;&#x4EBA;&#xFF0C;&#x6211;&#x82B1;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x628A;&#x80FD;&#x5173;&#x7684;&#x90FD;&#x627E;&#x5230;&#x5F00;&#x5173;&#x5173;&#x6389;&#x4E86;&#xFF0C;&#x7981;&#x7528;&#x4E86;&#x4E91;&#x76D8;&#x7684;&#x81EA;&#x542F;&#x52A8;&#xFF0C;&#x8FD9;&#x6837;&#x65E5;&#x5E38;&#x4F7F;&#x7528;&#x4E0D;&#x592A;&#x4F1A;&#x88AB;&#x5E7F;&#x544A;&#x9A9A;&#x6270;&#x4E86;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x5FAE;&#x4FE1;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x5176;&#x5728;&#x4FDD;&#x6301;&#x8F6F;&#x4EF6;&#x7B80;&#x6D01;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x597D;&#x7528;&#x7A0B;&#x5EA6;&#x5927;&#x5927;&#x8D85;&#x51FA;&#x4E86;&#x6211;&#x7684;&#x9884;&#x671F;&#x3002;&#x5C24;&#x5176;&#x662F;&#x5176;&#x8DE8;&#x8BBE;&#x5907;&#x540C;&#x6B65;&#x526A;&#x5207;&#x677F;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6781;&#x4E3A;&#x65B9;&#x4FBF;&#x3002;</p>
<p>&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4EE5;&#x524D;&#x7684;&#x6211;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x5C31;&#x4F1A;&#x56E0;&#x4E3A;&#x9690;&#x79C1;&#x6CC4;&#x9732;&#x7684;&#x62C5;&#x5FE7;&#x800C;&#x7709;&#x6BDB;&#x5012;&#x7ACB;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5FAE;&#x4FE1;&#x8F93;&#x5165;&#x6CD5;&#x8FD9;&#x91CC;&#x6211;&#x4E4B;&#x6240;&#x4EE5;&#x4E0D;&#x5728;&#x610F;&#xFF0C;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x76F8;&#x4FE1;&#x5FAE;&#x4FE1;&#x4E0D;&#x4F1A;&#x6CC4;&#x9732;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x4F5C;&#x4E3A;&#x5168;&#x6C11;IM&#x5DE5;&#x5177;&#x7684;&#x5FAE;&#x4FE1;&#xFF0C;&#x672C;&#x8EAB;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x83B7;&#x53D6;&#x5230;&#x6211;&#x4E2A;&#x4EBA;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x9690;&#x79C1;&#x4FE1;&#x606F;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x6CD5;&#x65E0;&#x6CD5;&#x628A;&#x6211;&#x66F4;&#x591A;&#x7684;&#x9690;&#x79C1;&#x4FE1;&#x606F;&#x4EA4;&#x51FA;&#x53BB;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#x9887;&#x6709;&#x70B9;&#x513F;&#x7834;&#x7F50;&#x513F;&#x7834;&#x6454;&#x7684;&#x610F;&#x601D;&#x5427;&#x3002;&#x8FD9;&#x4E2A;&#x8F93;&#x5165;&#x6CD5;&#x662F;&#x5982;&#x6B64;&#x7684;&#x597D;&#x7528;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#x8FDE;&#x624B;&#x673A;&#x4E0A;&#x4E5F;&#x5B89;&#x88C5;&#x4E86;&#xFF0C;&#x66FF;&#x6362;&#x4E86;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x4F7F;&#x7528;&#x7684;iOS&#x81EA;&#x5E26;&#x8F93;&#x5165;&#x6CD5;&#x3002;</p>
<p>&#x8BF4;&#x5230;iOS&#x81EA;&#x5E26;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x90FD;&#x633A;&#x96BE;&#x7528;&#x7684;&#xFF0C;&#x6700;&#x70E6;&#x4EBA;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4E09;&#x5929;&#x4E24;&#x5934;&#x4E22;&#x8BCD;&#x5E93;&#xFF0C;&#x4EE5;&#x53CA;&#x83AB;&#x540D;&#x5361;&#x987F;&#xFF0C;&#x6362;&#x6210;&#x5FAE;&#x4FE1;&#x8F93;&#x5165;&#x6CD5;&#x4E4B;&#x540E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x90FD;&#x6CA1;&#x6709;&#x4E86;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5BF9;&#x8F6F;&#x4EF6;&#x53D8;&#x5F97;&#x5BBD;&#x5BB9;&#x591A;&#x4E86;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x8C13;&#x7684;&#x4E2A;&#x4EBA;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#x4E5F;&#x4E0D;&#x90A3;&#x4E48;&#x6267;&#x7740;&#x4E86;&#x3002;&#x8FD1;&#x671F;&#x53D1;&#x751F;&#x7684;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x662F;&#x5728;&#x4E2A;&#x4EBA;&#x7535;&#x8111;&#x4E0A;&#x5B89;&#x88C5;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x8FDC;&#x7A0B;&#x53CA;&#x5B89;&#x5168;&#x8F6F;&#x4EF6;&#x3002;&#x4EE5;&#x524D;&#x6211;&#x5728;&#x5BB6;&#x7528;&#x81EA;&#x5DF1;&#x7535;&#x8111;&#x52A0;&#x73ED;&#x65F6;&#xFF0C;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x7684;&#x865A;&#x62DF;&#x673A;&#x91CC;&#x3002;&#x4E0A;&#x5468;&#x672B;&#x52A0;&#x73ED;&#x65F6;&#x7531;&#x4E8E;&#x8981;&#x540C;&#x65F6;&#x5904;&#x7406;&#x7684;&#x6587;&#x4EF6;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x800C;&#x6211;&#x7684; Mini PC &#x5B9A;&#x4F4D;&#x662F;&#x65E5;&#x5E38;&#x529E;&#x516C;&#xFF0C;&#x6027;&#x80FD;&#x5E76;&#x4E0D;&#x5F3A;&#x52B2;&#xFF0C;&#x677F;&#x8F7D;&#x5185;&#x5B58;&#x53EA;&#x6709;24G&#x65E0;&#x6CD5;&#x6269;&#x5C55;&#xFF0C;&#x5728;&#x865A;&#x62DF;&#x673A;&#x91CC;&#x529E;&#x516C;&#x591A;&#x5C11;&#x6709;&#x70B9;&#x513F;&#x96BE;&#x4E3A;&#x5B83;&#x4E86;&#x3002;&#x6070;&#x9022;&#x516C;&#x53F8;&#x6700;&#x8FD1;&#x5728;&#x53BB;&#x817E;&#x8BAF;&#x5316;&#xFF0C;&#x628A;&#x539F;&#x817E;&#x8BAF;&#x7684;iOA&#x8F6F;&#x4EF6;&#x66FF;&#x6362;&#x6210;&#x4E86;&#x81EA;&#x7814;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4E8E;&#x662F;&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;&#x76F4;&#x63A5;&#x5B89;&#x88C5;&#x5728;&#x81EA;&#x5DF1;&#x7535;&#x8111;&#x4E0A;&#xFF0C;&#x4E0D;&#x7528;&#x4EC0;&#x4E48;&#x865A;&#x62DF;&#x673A;&#x4E86;&#x3002;</p>
<p>&#x60F3;&#x8D77;&#x4EE5;&#x524D;&#x7528;Android&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x9650;&#x5236;&#x56FD;&#x4EA7;app&#xFF0C;&#x82B1;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x6298;&#x817E;&#x4E86;&#x5F88;&#x591A;&#x9879;&#x76EE;&#xFF0C;&#x6700;&#x7EC8;&#x6536;&#x83B7;&#x7684;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x6298;&#x817E;&#x7684;&#x8FC7;&#x7A0B;&#x4E50;&#x8DA3;&#x5427;&#xFF0C;&#x5BF9;&#x4E2A;&#x4EBA;&#x9690;&#x79C1;&#x7684;&#x4FDD;&#x62A4;&#x6709;&#x6CA1;&#x6709;&#x52A9;&#x529B;&#xFF0C;&#x771F;&#x7684;&#x5F88;&#x96BE;&#x8BF4;&#x3002;</p>

    </div>

    
    
    

    <footer class="post-footer">
          <div class="post-tags">
              <a href="/tags/%E6%8A%98%E8%85%BE/" rel="tag"># 折腾</a>
              <a href="/tags/%E6%84%9F%E6%83%B3/" rel="tag"># 感想</a>
          </div>

        

          <div class="post-nav">
            <div class="post-nav-item">
                <a href="/2025/08/24/LG-Monitor-split/" rel="prev" title="一台电脑输出两路信号到 LG SDQHD 实现分屏显示">
                  <i class="fa fa-angle-left"></i> 一台电脑输出两路信号到 LG SDQHD 实现分屏显示
                </a>
            </div>
            <div class="post-nav-item">
                <a href="/2025/08/26/passion-and-separation-of-tasks/" rel="next" title="热情与课题分离">
                  热情与课题分离 <i class="fa fa-angle-right"></i>
                </a>
            </div>
          </div>
    </footer>
  </article>
</div>






</div>
  </main>

  <footer class="footer">
    <div class="footer-inner">

  <div class="copyright">
    &copy; 
    <span itemprop="copyrightYear">2025</span>
    <span class="with-love">
      <i class="fa fa-heart"></i>
    </span>
    <span class="author" itemprop="copyrightHolder">14says</span>
  </div>
  <div class="powered-by">Powered by <a href="https://hexo.io/" rel="noopener" target="_blank">Hexo</a> & <a href="https://theme-next.js.org/muse/" rel="noopener" target="_blank">NexT.Muse</a>
  </div>

    </div>
  </footer>

  
  <div class="toggle sidebar-toggle" role="button">
    <span class="toggle-line"></span>
    <span class="toggle-line"></span>
    <span class="toggle-line"></span>
  </div>
  <div class="sidebar-dimmer"></div>
  <div class="back-to-top" role="button" aria-label="Back to top">
    <i class="fa fa-arrow-up fa-lg"></i>
    <span>0%</span>
  </div>

<noscript>
  <div class="noscript-warning">Theme NexT works best with JavaScript enabled</div>
</noscript>

</body>
</html>
