<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>十四</title>
  
  
  <link href="https://shiqingxu.gthub.io/atom.xml" rel="self"/>
  
  <link href="https://shiqingxu.gthub.io/"/>
  <updated>2025-09-10T00:49:37.571Z</updated>
  <id>https://shiqingxu.gthub.io/</id>
  
  <author>
    <name>14says</name>
    
  </author>
  
  <generator uri="https://hexo.io/">Hexo</generator>
  
  <entry>
    <title>把 Cloudflare R2 Bucket 作为博客图床</title>
    <link href="https://shiqingxu.gthub.io/2025/09/09/cloudflare-R2-as-blog-image-hosting/"/>
    <id>https://shiqingxu.gthub.io/2025/09/09/cloudflare-R2-as-blog-image-hosting/</id>
    <published>2025-09-09T00:35:12.000Z</published>
    <updated>2025-09-10T00:49:37.571Z</updated>
    
    <content type="html"><![CDATA[<p>&#x8FD9;&#x4E2A; Hexo &#x535A;&#x5BA2;&#x662F;&#x642D;&#x5EFA;&#x5728; GitHub Pages &#x4E0A;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x5355;&#x72EC;&#x7684;&#x56FE;&#x5E8A;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x521B;&#x5EFA;&#x535A;&#x5BA2;&#x6587;&#x4EF6;&#x65F6;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540C;&#x540D;&#x7684; assets &#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x56FE;&#x7247;&#x5B58;&#x653E;&#x5728;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x91CC;&#xFF0C;&#x4E0E;&#x535A;&#x5BA2;&#x7684; md &#x6587;&#x4EF6;&#x4E00;&#x540C;&#x6258;&#x7BA1;&#x5728; Github &#x4E0A;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x867D;&#x7136;&#x65B9;&#x4FBF;&#xFF0C;&#x4E0D;&#x8FC7;&#x6709;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x662F; Github &#x5728;&#x4E2D;&#x56FD;&#x5927;&#x9646;&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x7F13;&#x6162;&#xFF0C;&#x56FE;&#x7247;&#x52A0;&#x8F7D;&#x56F0;&#x96BE;&#xFF0C;&#x4E8C;&#x662F;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x535A;&#x5BA2;&#x51FA;&#x5E93;&#x7684;&#x4F53;&#x79EF;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;<code>clone</code>,<code>push</code>&#x548C;<code>deploy</code>&#x7B49;&#x64CD;&#x4F5C;&#x90FD;&#x4F1A;&#x6BD4;&#x8F83;&#x8017;&#x65F6;&#x3002;&#x6545;&#x51B3;&#x5B9A;&#x6298;&#x817E;&#x4E00;&#x4E0B;&#x56FE;&#x5E8A;&#x3002;</p><span id="more"></span><h2 id="&#x72EC;&#x7ACB;&#x56FE;&#x5E8A;&#x7684;&#x4F18;&#x52BF;"><a href="#&#x72EC;&#x7ACB;&#x56FE;&#x5E8A;&#x7684;&#x4F18;&#x52BF;" class="headerlink" title="&#x72EC;&#x7ACB;&#x56FE;&#x5E8A;&#x7684;&#x4F18;&#x52BF;"></a>&#x72EC;&#x7ACB;&#x56FE;&#x5E8A;&#x7684;&#x4F18;&#x52BF;</h2><p><strong>&#x4E00;&#x52B3;&#x6C38;&#x9038;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</strong>&#xFF1A;&#x4E00;&#x6B21;&#x914D;&#x7F6E;&#xFF0C;&#x6C38;&#x4E45;&#x4EAB;&#x53D7;&#x3002;&#x518D;&#x4E5F;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x56FE;&#x7247;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#xFF0C;&#x4E5F;&#x4E0D;&#x7528;&#x5173;&#x5FC3;&#x5E95;&#x5C42;&#x5B9E;&#x73B0;&#x3002;</p><p><strong>&#x8D44;&#x4EA7;&#x7684;&#x96C6;&#x4E2D;&#x4E0E;&#x590D;&#x7528;</strong>&#xFF1A;&#x6240;&#x6709;&#x56FE;&#x7247;&#x90FD;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x6E05;&#x6670;&#x660E;&#x4E86;&#x3002;&#x4EFB;&#x4F55;&#x6587;&#x7AE0;&#x90FD;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x5F15;&#x7528;&#x4EFB;&#x4F55;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x8D44;&#x6E90;&#x7684;<strong>&#x5168;&#x5C40;&#x590D;&#x7528;</strong>&#x3002;</p><p><strong>&#x4E3B;&#x4ED3;&#x5E93;&#x6C38;&#x8FDC;&#x8F7B;&#x91CF;</strong>&#xFF1A;&#x535A;&#x5BA2;&#x4ED3;&#x5E93;&#x5C06;&#x4FDD;&#x6301;&#x5E72;&#x51C0;&#x548C;&#x9AD8;&#x6548;&#xFF0C;&#x4EE5;&#x540E;&#x90E8;&#x7F72;&#x548C;&#x8FC1;&#x79FB;&#x90FD;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x3002;</p><p><strong>&#x4E13;&#x4E1A;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;</strong>&#xFF1A;&#x8FD9;&#x662F;&#x4E1A;&#x754C;&#x516C;&#x8BA4;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x3002;&#x5C06;&#x4EE3;&#x7801;&#xFF08;Markdown&#xFF09;&#x548C;&#x9759;&#x6001;&#x8D44;&#x6E90;&#xFF08;&#x56FE;&#x7247;&#xFF09;&#x5206;&#x79BB;&#x7BA1;&#x7406;&#xFF0C;&#x7B26;&#x5408;&#x73B0;&#x4EE3; Web &#x5F00;&#x53D1;&#x7684;&#x666E;&#x904D;&#x539F;&#x5219;&#x3002;</p><p>&#x4E3B;&#x6D41;&#x7684;&#x65B9;&#x6848;&#x662F; jsDeliver &#x548C; Cloudflare R2&#xFF0C;&#x5BF9;&#x6BD4;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x51FA;&#x4E8E;&#x51CF;&#x5C11;&#x7EF4;&#x62A4;&#x5DE5;&#x4F5C;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x9009;&#x62E9;&#x4E86;&#x540E;&#x8005;&#x3002;</p><h3 id="&#x8BBE;&#x7F6E;&#x8FC7;&#x7A0B;"><a href="#&#x8BBE;&#x7F6E;&#x8FC7;&#x7A0B;" class="headerlink" title="&#x8BBE;&#x7F6E;&#x8FC7;&#x7A0B;"></a>&#x8BBE;&#x7F6E;&#x8FC7;&#x7A0B;</h3><h3 id="&#x521B;&#x5EFA;-R2-Bucket"><a href="#&#x521B;&#x5EFA;-R2-Bucket" class="headerlink" title="&#x521B;&#x5EFA; R2 Bucket"></a>&#x521B;&#x5EFA; R2 Bucket</h3><p>&#x767B;&#x5F55; Cloudflare &#x8D26;&#x6237;&#xFF0C;&#x5728;&#x5DE6;&#x4FA7;&#x83DC;&#x5355;&#x627E;&#x5230;&#x5E76;&#x8FDB;&#x5165; R2&#x3002;</p><p><img src="https://img.xushiqing.xyz/2025/09/cloudflare-dashboard-R2.png"></p><p>&#x521B;&#x5EFA; bucket</p><p><img src="https://img.xushiqing.xyz/2025/09/cloudflare-create-bucket.png"></p><p>&#x8F93;&#x5165; Bucket name&#xFF0C;&#x70B9;&#x51FB; <code>create bucket</code>&#x5B8C;&#x6210;&#x521B;&#x5EFA;</p><p><img src="https://img.xushiqing.xyz/2025/09/cloudflare-create-bucket-name.png"></p><p>&#x521B;&#x5EFA;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x5728;&#x8BBE;&#x7F6E;&#x4E2D;&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x57DF;&#x540D;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5DF2;&#x7ECF;&#x7531; cloudflare &#x7BA1;&#x7406;&#x7684;&#x57DF;&#x540D;&#x7684;&#x5B50;&#x57DF;&#x540D;&#xFF0C;&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x7528;&#x4E86;&#x535A;&#x5BA2;&#x57DF;&#x540D;&#x7684;&#x5B50;&#x57DF;&#x540D;&#x3002;</p><p><img src="https://img.xushiqing.xyz/2025/09/cloudflare-bucket-custom-domains.png"></p><p>&#x521B;&#x5EFA;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x6548;&#x679C;&#x5982;&#x56FE;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A; Bucket &#x91CC;&#x7684;&#x8D44;&#x6E90;&#x4E86;&#x3002;</p><p><img src="https://img.xushiqing.xyz/2025/09/cloudflare-bucket-custom-domains-added.png"></p><h2 id><a href="#" class="headerlink" title></a></h2><p>&#x81F3;&#x6B64;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; R2 &#x6765;&#x6258;&#x7BA1;&#x56FE;&#x7247;&#xFF0C;&#x5B9E;&#x73B0;&#x5B58;&#x50A8;&#x4E0E;&#x5206;&#x53D1;&#x7684;&#x5206;&#x79BB;&#xFF0C;&#x52A0;&#x901F;&#x535A;&#x5BA2;&#x56FE;&#x7247;&#x7684;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x3002;</p><h2 id="&#x540E;&#x7EED;&#x6298;&#x817E;&#x8BA1;&#x5212;"><a href="#&#x540E;&#x7EED;&#x6298;&#x817E;&#x8BA1;&#x5212;" class="headerlink" title="&#x540E;&#x7EED;&#x6298;&#x817E;&#x8BA1;&#x5212;"></a>&#x540E;&#x7EED;&#x6298;&#x817E;&#x8BA1;&#x5212;</h2><p>&#x4E0D;&#x8FC7;&#x624B;&#x52A8;&#x4E0A;&#x4F20;&#x56FE;&#x7247;&#x7C98;&#x8D34;&#x94FE;&#x63A5;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p><p>&#x4E00;&#x662F;&#x64CD;&#x4F5C;&#x6BD4;&#x8F83;&#x9EBB;&#x70E6;&#xFF0C;&#x8BA1;&#x5212;&#x540E;&#x9762;&#x8BBE;&#x7F6E;&#x4E00;&#x4E0B; <a href="https://github.com/Molunerfinn/PicGo">PicGo</a> &#xFF0C;&#x7B80;&#x5316;&#x56FE;&#x7247;&#x4E0A;&#x4F20;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#xFF1B;</p><p>&#x4E8C;&#x662F;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x540E;&#x7EED;&#x66F4;&#x6362;&#x4E86;&#x56FE;&#x5E8A;&#x7684;&#x5730;&#x5740;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x9010;&#x4E2A;&#x56FE;&#x7247;&#x66FF;&#x6362;&#x94FE;&#x63A5;&#x3002;&#x5C1D;&#x8BD5;&#x5728; _config.yml &#x91CC;&#x8BBE;&#x7F6E;&#x56FE;&#x5E8A;&#x5730;&#x5740;&#x4EE5;&#x589E;&#x5F3A;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF0C;&#x4F46;&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x5C1A;&#x672A;&#x627E;&#x5230;&#x539F;&#x56E0;&#x540E;&#x9762;&#x6709;&#x65F6;&#x95F4;&#x518D;&#x7814;&#x7A76;&#x5427;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x8FD9;&amp;#x4E2A; Hexo &amp;#x535A;&amp;#x5BA2;&amp;#x662F;&amp;#x642D;&amp;#x5EFA;&amp;#x5728; GitHub Pages &amp;#x4E0A;&amp;#x7684;&amp;#xFF0C;&amp;#x6CA1;&amp;#x6709;&amp;#x4F7F;&amp;#x7528;&amp;#x5355;&amp;#x72EC;&amp;#x7684;&amp;#x56FE;&amp;#x5E8A;&amp;#xFF0C;&amp;#x800C;&amp;#x662F;&amp;#x5728;&amp;#x521B;&amp;#x5EFA;&amp;#x535A;&amp;#x5BA2;&amp;#x6587;&amp;#x4EF6;&amp;#x65F6;&amp;#x5728;&amp;#x540C;&amp;#x4E00;&amp;#x4E2A;&amp;#x76EE;&amp;#x5F55;&amp;#x4E0B;&amp;#x81EA;&amp;#x52A8;&amp;#x521B;&amp;#x5EFA;&amp;#x4E00;&amp;#x4E2A;&amp;#x540C;&amp;#x540D;&amp;#x7684; assets &amp;#x6587;&amp;#x4EF6;&amp;#x5939;&amp;#xFF0C;&amp;#x56FE;&amp;#x7247;&amp;#x5B58;&amp;#x653E;&amp;#x5728;&amp;#x8FD9;&amp;#x4E2A;&amp;#x6587;&amp;#x4EF6;&amp;#x5939;&amp;#x91CC;&amp;#xFF0C;&amp;#x4E0E;&amp;#x535A;&amp;#x5BA2;&amp;#x7684; md &amp;#x6587;&amp;#x4EF6;&amp;#x4E00;&amp;#x540C;&amp;#x6258;&amp;#x7BA1;&amp;#x5728; Github &amp;#x4E0A;&amp;#x3002;&amp;#x8FD9;&amp;#x79CD;&amp;#x65B9;&amp;#x6848;&amp;#x867D;&amp;#x7136;&amp;#x65B9;&amp;#x4FBF;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8FC7;&amp;#x6709;&amp;#x4E24;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x4E00;&amp;#x662F; Github &amp;#x5728;&amp;#x4E2D;&amp;#x56FD;&amp;#x5927;&amp;#x9646;&amp;#x7684;&amp;#x8BBF;&amp;#x95EE;&amp;#x901F;&amp;#x5EA6;&amp;#x975E;&amp;#x5E38;&amp;#x7F13;&amp;#x6162;&amp;#xFF0C;&amp;#x56FE;&amp;#x7247;&amp;#x52A0;&amp;#x8F7D;&amp;#x56F0;&amp;#x96BE;&amp;#xFF0C;&amp;#x4E8C;&amp;#x662F;&amp;#x968F;&amp;#x7740;&amp;#x65F6;&amp;#x95F4;&amp;#x7684;&amp;#x63A8;&amp;#x79FB;&amp;#xFF0C;&amp;#x535A;&amp;#x5BA2;&amp;#x51FA;&amp;#x5E93;&amp;#x7684;&amp;#x4F53;&amp;#x79EF;&amp;#x4F1A;&amp;#x8D8A;&amp;#x6765;&amp;#x8D8A;&amp;#x5927;&amp;#xFF0C;&lt;code&gt;clone&lt;/code&gt;,&lt;code&gt;push&lt;/code&gt;&amp;#x548C;&lt;code&gt;deploy&lt;/code&gt;&amp;#x7B49;&amp;#x64CD;&amp;#x4F5C;&amp;#x90FD;&amp;#x4F1A;&amp;#x6BD4;&amp;#x8F83;&amp;#x8017;&amp;#x65F6;&amp;#x3002;&amp;#x6545;&amp;#x51B3;&amp;#x5B9A;&amp;#x6298;&amp;#x817E;&amp;#x4E00;&amp;#x4E0B;&amp;#x56FE;&amp;#x5E8A;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
    <category term="blog" scheme="https://shiqingxu.gthub.io/tags/blog/"/>
    
  </entry>
  
  <entry>
    <title>睡眠调整日记（2）</title>
    <link href="https://shiqingxu.gthub.io/2025/09/08/sleeping-optimization-diary-2/"/>
    <id>https://shiqingxu.gthub.io/2025/09/08/sleeping-optimization-diary-2/</id>
    <published>2025-09-08T13:11:07.000Z</published>
    <updated>2025-09-09T00:19:16.809Z</updated>
    
    <content type="html"><![CDATA[<p>&#x7ECF;&#x8FC7;&#x4E00;&#x5468;&#x591A;&#x7684;&#x8C03;&#x6574;&#x5B9E;&#x8DF5;&#xFF0C;&#x7761;&#x7720;&#x8D28;&#x91CF;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x591A;&#x3002;&#x8FC7;&#x53BB;&#x4E00;&#x5468;&#x7684;&#x7761;&#x7720;&#x65F6;&#x957F;&#x548C;&#x7CBE;&#x795E;&#x72B6;&#x6001;&#x90FD;&#x6BD4;&#x4E4B;&#x524D;&#x7565;&#x597D;&#xFF0C;&#x5468;&#x65E5;&#x665A;&#x7761;&#x7720;&#x65F6;&#x957F;&#x63A5;&#x8FD1;7&#x5C0F;&#x65F6;&#xFF0C;&#x5468;&#x4E00;&#x548C;&#x5468;&#x4E8C;&#x665A;&#x5747;&#x8FBE;&#x5230;&#x4E86; 7 &#x5C0F;&#x65F6;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x540C;&#x65F6;&#x8C03;&#x6574;&#x4E86;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x54EA;&#x4E2A;&#x56E0;&#x7D20;&#x7684;&#x4F5C;&#x7528;&#x66F4;&#x5927;&#x4E00;&#x4E9B;&#x3002;</p><span id="more"></span><h2 id="&#x5B9E;&#x8DF5;&#x8FC7;&#x7A0B;"><a href="#&#x5B9E;&#x8DF5;&#x8FC7;&#x7A0B;" class="headerlink" title="&#x5B9E;&#x8DF5;&#x8FC7;&#x7A0B;"></a>&#x5B9E;&#x8DF5;&#x8FC7;&#x7A0B;</h2><p>&#x8C03;&#x6574;&#x7684;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x5206;&#x522B;&#x662F;&#x5348;&#x996D;&#x548C;&#x8865;&#x5242;&#xFF0C;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x6062;&#x590D;&#x5230;&#x4E0D;&#x5403;&#x5348;&#x996D;&#x4EE5;&#x53CA;&#x6BCF;&#x5929;&#x5403;&#x4E00;&#x4E9B;&#x7EF4;&#x751F;&#x7D20;&#x4E4B;&#x7C7B;&#x7684;&#x8865;&#x5242;&#x7684;&#x751F;&#x6D3B;&#x4E60;&#x60EF;&#x3002;</p><p>&#x524D;&#x4E24;&#x5929;&#x5F88;&#x597D;&#xFF0C;&#x5468;&#x4E09;&#x665A;&#x4E0A;&#x52A0;&#x73ED;&#x5230;&#x5BB6;&#x6BD4;&#x8F83;&#x665A;&#xFF0C;&#x867D;&#x7136;&#x5FEB;&#x901F;&#x6D17;&#x6F31;&#x4E0A;&#x5E8A;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x80FD;&#x5982;&#x671F;&#x5165;&#x7761;&#xFF0C;&#x6700;&#x7EC8;&#x96F6;&#x70B9;&#x534A;&#x5DE6;&#x53F3;&#x624D;&#x7761;&#x7740;&#xFF1B;&#x5F53;&#x665A;&#x53EA;&#x7761;&#x4E86;6&#x5C0F;&#x65F6;&#xFF0C;&#x5468;&#x56DB;&#x4E0A;&#x5348;&#x7CBE;&#x795E;&#x72B6;&#x6001;&#x4E0D;&#x4F73;&#xFF1B;&#x539F;&#x8BA1;&#x5212;&#x653E;&#x5F03;&#x4E2D;&#x5348;&#x953B;&#x70BC;&#xFF0C;&#x4F46;&#x4E2D;&#x5348;&#x7A81;&#x7136;&#x53C8;&#x7CBE;&#x795E;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x53BB;&#x953B;&#x70BC;&#x4E86;&#x3002;&#x56DE;&#x6765;&#x540E;&#x6CA1;&#x80FD;&#x5348;&#x7761;&#xFF0C;&#x4E0B;&#x5348;&#x7CBE;&#x529B;&#x5DEE;&#xFF0C;&#x65E9;&#x65E9;&#x4E0B;&#x73ED;&#x56DE;&#x5BB6;&#x3002;&#x665A;&#x4E0A;&#x65E9;&#x65E9;&#x4E0A;&#x5E8A;&#xFF0C;&#x4F46;&#x591C;&#x95F4;&#x9891;&#x7E41;&#x9192;&#x6765;&#xFF0C;&#x6700;&#x7EC8;&#x7535;&#x5B50;&#x8868;&#x5F55;&#x5F97;&#x4E86;50&#x4F59;&#x5206;&#x949F;&#x7684;&#x6E05;&#x9192;&#x65F6;&#x95F4;&#xFF0C;&#x603B;&#x7761;&#x7720;&#x65F6;&#x957F;6&#x5C0F;&#x65F6;19&#x5206;&#x949F;&#x3002;</p><p>&#x5468;&#x4E94;&#x8D77;&#x6765;&#x611F;&#x89C9;&#x7CBE;&#x529B;&#x5DE8;&#x5DEE;&#xFF0C;&#x51FA;&#x95E8;&#x524D;&#x76F4;&#x63A5;&#x51B3;&#x5B9A;&#x653E;&#x5F03;&#x4E2D;&#x5348;&#x7684;&#x953B;&#x70BC;&#xFF0C;&#x6545;&#x6CA1;&#x5E26;&#x5065;&#x8EAB;&#x7684;&#x8863;&#x670D;&#x3002;&#x4EE4;&#x4EBA;&#x610F;&#x5916;&#x7684;&#x662F;&#xFF0C;&#x5230;&#x8FBE;&#x5DE5;&#x5730;&#x540E;&#x7CBE;&#x795E;&#x72B6;&#x51B5;&#x6BD4;&#x524D;&#x4E00;&#x5929;&#x597D;&#x5F88;&#x591A;&#xFF0C;&#x4E2D;&#x5348;&#x5176;&#x5B9E;&#x662F;&#x6709;&#x7CBE;&#x529B;&#x53BB;&#x953B;&#x70BC;&#x7684;&#xFF0C;&#x53EF;&#x60DC;&#x6CA1;&#x5E26;&#x8863;&#x670D;&#x3002;&#x4E8E;&#x662F;&#x4E2D;&#x5348;&#x53BB;&#x5403;&#x4E86;&#x5348;&#x996D;&#xFF0C;&#x671F;&#x671B;&#x78B3;&#x6C34;&#x80FD;&#x52A9;&#x7720;&#xFF0C;&#x4E2D;&#x5348;&#x4F3C;&#x4E4E;&#x786E;&#x5B9E;&#x7761;&#x7740;&#x4E86;&#x4E00;&#x70B9;&#x70B9;&#xFF0C;&#x4E0B;&#x5348;&#x72B6;&#x6001;&#x597D;&#x5F88;&#x591A;&#x3002;</p><p>&#x5468;&#x672B;&#x65E9;&#x4E0A;&#x4E0D;&#x7528;&#x65E9;&#x8D77;&#x4E86;&#xFF0C;&#x7761;&#x7720;&#x65F6;&#x957F;&#x8F83;&#x957F;&#xFF0C;&#x4F46;&#x8D28;&#x91CF;&#x4E00;&#x822C;&#x3002;&#x996E;&#x98DF;&#x4E0A;&#xFF0C;&#x4E24;&#x5929;&#x90FD;&#x5728;&#x5916;&#x9762;&#x653E;&#x7EB5;&#x996E;&#x98DF;&#xFF0C;&#x4E0A;&#x5348;&#x5F00;&#x59CB;&#x5C31;&#x8FDB;&#x884C;&#x78B3;&#x6C34;&#x5927;&#x9910;&#xFF0C;&#x5468;&#x65E5;&#x4E0A;&#x5348;&#x8FDE;&#x5403;&#x4E24;&#x5BB6;&#x80A0;&#x7C89;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x53BB;&#x5403;&#x4E86;&#x4E00;&#x4E9B;&#x7CD6;&#x6C34;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x953B;&#x70BC;&#x3002;</p><p>&#x5468;&#x65E5;&#x665A;&#x4E0A;10&#x70B9;&#x51FA;&#x5934;&#x5C31;&#x4E0A;&#x5E8A;&#xFF0C;&#x4E0D;&#x5230;11&#x70B9;&#x7761;&#x7740;&#x3002;&#x5F55;&#x5F97;&#x4E86;&#x8FD1;&#x671F;&#x6700;&#x597D;&#x7684;&#x4E00;&#x6B21;&#x7761;&#x7720;&#x6570;&#x636E;&#xFF0C;&#x603B;&#x65F6;&#x957F;7.5&#x5C0F;&#x65F6;&#xFF0C;&#x6DF1;&#x5EA6;&#x7761;&#x7720;&#x4E00;&#x5C0F;&#x65F6;&#x53C8;&#x4E8C;&#x5341;&#x5206;&#x949F;&#xFF0C;&#x6E05;&#x9192;&#x65F6;&#x95F4;15&#x5206;&#x949F;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x4ECE;&#x65F6;&#x957F;&#x5230;&#x8D28;&#x91CF;&#x90FD;&#x662F;&#x8FD1;&#x671F;&#x6700;&#x4F73;&#x3002;</p><p>&#x5947;&#x602A;&#x7684;&#x662F;&#x9192;&#x6765;&#x540E;&#x611F;&#x89C9;&#x975E;&#x5E38;&#x75B2;&#x60EB;&#xFF0C;&#x751A;&#x81F3;&#x4E45;&#x8FDD;&#x5730;&#x5728;&#x95F9;&#x949F;&#x54CD;&#x540E;&#x53C8;&#x8EBA;&#x4E86;&#x5341;&#x5206;&#x949F;&#xFF0C;&#x4F46;&#x4E5F;&#x5E76;&#x65E0;&#x52A9;&#x4E8E;&#x6062;&#x590D;&#x7CBE;&#x529B;&#x3002;&#x6574;&#x4E2A;&#x4E0A;&#x5348;&#x4E00;&#x76F4;&#x5904;&#x4E8E;&#x8FD9;&#x79CD;&#x7CDF;&#x7CD5;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4E2D;&#x5348;&#x7531;&#x4E8E;&#x5927;&#x96E8;&#x4E5F;&#x6CA1;&#x53BB;&#x953B;&#x70BC;&#xFF0C;&#x96E8;&#x5C0F;&#x4E00;&#x4E9B;&#x540E;&#x53BB;&#x5403;&#x4E86;&#x5348;&#x996D;&#x3002;&#x7136;&#x540E;&#x8DB4;&#x684C;&#x5B50;&#x4F11;&#x606F;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x5E94;&#x8BE5;&#x6709;&#x51E0;&#x5206;&#x949F;&#x5904;&#x4E8E;&#x534A;&#x68A6;&#x534A;&#x9192;&#x4E4B;&#x95F4;&#xFF0C;&#x7B97;&#x662F;&#x7761;&#x7740;&#x4E86;&#x5427;&#xFF0C;&#x4E0B;&#x5348;&#x7CBE;&#x795E;&#x72B6;&#x6001;&#x53D8;&#x597D;&#x3002;</p><p>&#x5173;&#x4E8E;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x6211;&#x8DDF;AI&#x4EA4;&#x6D41;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;AI&#x7ED9;&#x51FA;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x4E00;&#x662F;&#x7761;&#x7720;&#x503A;&#x6CA1;&#x8FD8;&#x5B8C;&#xFF0C;&#x4E8C;&#x662F;&#x5728;&#x4E0D;&#x6070;&#x5F53;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x88AB;&#x95F9;&#x949F;&#x53EB;&#x9192;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x7761;&#x7720;&#x503A;&#x7684;&#x5360;&#x6BD4;&#x8981;&#x66F4;&#x5927;&#x4E00;&#x4E9B;&#x3002;</p><h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x4E0A;&#x5468;&#x867D;&#x6709;&#x4E9B;&#x6CE2;&#x52A8;&#xFF0C;&#x4E0D;&#x8FC7;&#x603B;&#x4F53;&#x4E0A;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x7535;&#x5B50;&#x8868;&#x8BB0;&#x5F55;&#x5230;&#x7684;&#x7761;&#x7720;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x662F;&#x4E2A;&#x4EBA;&#x7684;&#x4F53;&#x611F;&#xFF0C;&#x90FD;&#x6BD4;&#x524D;&#x9762;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x8981;&#x597D;&#x4E00;&#x4E9B;&#x3002;</p><p>&#x4E0B;&#x4E00;&#x6B65;&#x8BA1;&#x5212;&#x7EE7;&#x7EED;&#x4FDD;&#x6301;&#xFF08;&#x5C3D;&#x91CF;&#xFF09;&#x4E0D;&#x5403;&#x5348;&#x996D;&#x548C;&#x5403;&#x8865;&#x5242;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x6BCF;&#x5929;&#x65E9;&#x70B9;&#x4E0A;&#x5E8A;&#x4F11;&#x606F;&#x3002;&#x516D;&#x70B9;&#x534A;&#x7684;&#x8D77;&#x5E8A;&#x65F6;&#x95F4;&#x4E0D;&#x80FD;&#x5EF6;&#x540E;&#xFF0C;&#x5C31;&#x53EA;&#x80FD;&#x5C06;&#x5165;&#x7761;&#x65F6;&#x95F4;&#x63D0;&#x524D;&#x3002;</p><p>&#x53E6;&#x5916;&#xFF0C;&#x4E0B;&#x8F7D;&#x4E86;&#x4E00;&#x4E2A;&#x7761;&#x7720;&#x76D1;&#x6D4B;&#x8F6F;&#x4EF6; autosleep&#xFF0C;&#x89C2;&#x5BDF;&#x4E00;&#x4E0B;&#x5B83;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x89E3;&#x8BFB;&#x548C;&#x82F9;&#x679C;&#x5065;&#x5EB7;&#x5E94;&#x7528;&#x6709;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5DEE;&#x5F02;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x7ECF;&amp;#x8FC7;&amp;#x4E00;&amp;#x5468;&amp;#x591A;&amp;#x7684;&amp;#x8C03;&amp;#x6574;&amp;#x5B9E;&amp;#x8DF5;&amp;#xFF0C;&amp;#x7761;&amp;#x7720;&amp;#x8D28;&amp;#x91CF;&amp;#x5F97;&amp;#x5230;&amp;#x4E86;&amp;#x4E00;&amp;#x5B9A;&amp;#x7A0B;&amp;#x5EA6;&amp;#x7684;&amp;#x63D0;&amp;#x5347;&amp;#xFF0C;&amp;#x867D;&amp;#x7136;&amp;#x4E0D;&amp;#x591A;&amp;#x3002;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E00;&amp;#x5468;&amp;#x7684;&amp;#x7761;&amp;#x7720;&amp;#x65F6;&amp;#x957F;&amp;#x548C;&amp;#x7CBE;&amp;#x795E;&amp;#x72B6;&amp;#x6001;&amp;#x90FD;&amp;#x6BD4;&amp;#x4E4B;&amp;#x524D;&amp;#x7565;&amp;#x597D;&amp;#xFF0C;&amp;#x5468;&amp;#x65E5;&amp;#x665A;&amp;#x7761;&amp;#x7720;&amp;#x65F6;&amp;#x957F;&amp;#x63A5;&amp;#x8FD1;7&amp;#x5C0F;&amp;#x65F6;&amp;#xFF0C;&amp;#x5468;&amp;#x4E00;&amp;#x548C;&amp;#x5468;&amp;#x4E8C;&amp;#x665A;&amp;#x5747;&amp;#x8FBE;&amp;#x5230;&amp;#x4E86; 7 &amp;#x5C0F;&amp;#x65F6;&amp;#x3002;&amp;#x7531;&amp;#x4E8E;&amp;#x6211;&amp;#x540C;&amp;#x65F6;&amp;#x8C03;&amp;#x6574;&amp;#x4E86;&amp;#x4E24;&amp;#x4E2A;&amp;#x53D8;&amp;#x91CF;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x4E5F;&amp;#x4E0D;&amp;#x77E5;&amp;#x9053;&amp;#x662F;&amp;#x54EA;&amp;#x4E2A;&amp;#x56E0;&amp;#x7D20;&amp;#x7684;&amp;#x4F5C;&amp;#x7528;&amp;#x66F4;&amp;#x5927;&amp;#x4E00;&amp;#x4E9B;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="sleeping" scheme="https://shiqingxu.gthub.io/tags/sleeping/"/>
    
    <category term="health" scheme="https://shiqingxu.gthub.io/tags/health/"/>
    
  </entry>
  
  <entry>
    <title>关闭 Windows 的搜索服务</title>
    <link href="https://shiqingxu.gthub.io/2025/09/05/disable-windows-search/"/>
    <id>https://shiqingxu.gthub.io/2025/09/05/disable-windows-search/</id>
    <published>2025-09-05T00:25:48.000Z</published>
    <updated>2025-09-09T00:19:16.809Z</updated>
    
    <content type="html"><![CDATA[<p>&#x5DE5;&#x5730;&#x914D;&#x53D1;&#x7684;&#x7535;&#x8111;&#x662F;&#x4E00;&#x53F0;&#x51E0;&#x5E74;&#x524D;&#x751F;&#x4EA7;&#x3001; &#x7ECF;&#x5386;&#x8FC7;&#x597D;&#x51E0;&#x4EFB;&#x4E3B;&#x4EBA;&#x7684; thinkpad T14&#xFF0C;&#x5904;&#x7406;&#x5668;&#x578B;&#x53F7;&#x4E3A; 11th Gen Intel(R) Core(TM) i7-1165G7&#xFF0C;&#x5C3D;&#x7BA1;&#x7CFB;&#x7EDF;&#x5B89;&#x88C5;&#x7684;&#x662F;&#x5DF2;&#x7ECF;&#x6BD4;&#x8F83;&#x7CBE;&#x7B80;&#x7684; Windows 10 &#x4F01;&#x4E1A;&#x7248; LTSC&#xFF0C;&#x4F46;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x4F9D;&#x7136;&#x6BD4;&#x8F83;&#x5361;&#x987F;&#x3002;</p><span id="more"></span><p>&#x8003;&#x8651;&#x5230;&#x8FD9;&#x53F0;&#x8BBE;&#x5907;&#x8FD8;&#x6CA1;&#x8D70;&#x5230;&#x5176;&#x4E3B;&#x52A8;&#x62A5;&#x5E9F;&#x5E74;&#x9650;&#xFF0C;&#x6211;&#x4E0D;&#x80FD;&#x7533;&#x8BF7;&#x65B0;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x4E3A;&#x4E86;&#x4F18;&#x5316;&#x529E;&#x516C;&#x4F53;&#x9A8C;&#x53EA;&#x80FD;&#x81EA;&#x884C;&#x5BFB;&#x627E;&#x4E00;&#x4E9B;&#x4F18;&#x5316;&#x70B9;&#xFF0C;&#x5173;&#x6389;&#x7CFB;&#x7EDF;&#x7684;&#x641C;&#x7D22;&#x670D;&#x52A1;&#x662F;&#x4ECA;&#x5929;&#x7684;&#x7A81;&#x53D1;&#x5947;&#x60F3;&#x3002;</p><p>&#x5176;&#x5B9E;&#x4E0D;&#x8BBA;&#x662F;&#x5728; Windows &#x8FD8;&#x662F; macOS &#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x6211;&#x90FD;&#x5F88;&#x5C11;&#x7528;&#x7CFB;&#x7EDF;&#x81EA;&#x5E26;&#x7684;&#x641C;&#x7D22;&#x529F;&#x80FD;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4E0D;&#x597D;&#x7528;&#x3002;Windows &#x4E0A;&#x901A;&#x5E38;&#x4F1A;&#x7528;&#x542F;&#x52A8;&#x5668;&#x8F6F;&#x4EF6;&#x6765;&#x641C;&#x7D22;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x914D;&#x5408; everything &#x641C;&#x7D22;&#x6587;&#x4EF6;&#xFF0C;macOS &#x81EA;&#x5E26;&#x7684; spotlight &#x867D;&#x7136;&#x4E5F;&#x4E0D;&#x9519;&#xFF0C;&#x4E0D;&#x8FC7;&#x7B2C;&#x4E09;&#x65B9;&#x8F6F;&#x4EF6;&#x8FD8;&#x662F;&#x66F4;&#x597D;&#x3002;</p><h2 id="&#x5173;&#x95ED;&#x65B9;&#x6CD5;"><a href="#&#x5173;&#x95ED;&#x65B9;&#x6CD5;" class="headerlink" title="&#x5173;&#x95ED;&#x65B9;&#x6CD5;"></a>&#x5173;&#x95ED;&#x65B9;&#x6CD5;</h2><p>&#x5173;&#x95ED;&#x65B9;&#x6CD5;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x6309;<code>win+R</code>&#xFF0C;&#x8F93;&#x5165;<code>services.msc</code>&#xFF0C;&#x5728;&#x5F39;&#x51FA;&#x7684;&#x7A97;&#x53E3;&#x91CC;&#x627E;&#x5230;<code>windows search</code>&#xFF0C;&#x53CC;&#x51FB;&#x8BE5;&#x670D;&#x52A1;&#xFF0C;&#x70B9;&#x51FB;&#x505C;&#x6B62;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x542F;&#x52A8;&#x7C7B;&#x578B;&#x4E2D;&#x9009;&#x62E9;<code>&#x7981;&#x7528;</code>&#x5373;&#x53EF;&#x3002;</p><p><img src="/2025/09/05/disable-windows-search/services_msc.png"></p><p><img src="/2025/09/05/disable-windows-search/disable_search.png"></p><h2 id="&#x66FF;&#x4EE3;&#x5DE5;&#x5177;"><a href="#&#x66FF;&#x4EE3;&#x5DE5;&#x5177;" class="headerlink" title="&#x66FF;&#x4EE3;&#x5DE5;&#x5177;"></a>&#x66FF;&#x4EE3;&#x5DE5;&#x5177;</h2><p>&#x542F;&#x52A8;&#x5668;&#x76EE;&#x524D;&#x7528;&#x7684;&#x662F; <a href="https://github.com/Flow-Launcher/Flow.Launcher">Flow Launcher</a>&#xFF0C;&#x6587;&#x4EF6;&#x641C;&#x7D22;&#x670D;&#x52A1;&#x4F7F;&#x7528; everything&#x3002;macOS &#x4E0A;&#x4F7F;&#x7528;&#x7684; <a href="https://www.raycast.com/">Raycast</a> &#x6B63;&#x5728;&#x7B79;&#x5907; Windows &#x7248;&#xFF0C;&#x63A8;&#x51FA;&#x540E;&#x5E94;&#x8BE5;&#x4F1A;&#x8F6C;&#x8FC7;&#x53BB;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x5DE5;&amp;#x5730;&amp;#x914D;&amp;#x53D1;&amp;#x7684;&amp;#x7535;&amp;#x8111;&amp;#x662F;&amp;#x4E00;&amp;#x53F0;&amp;#x51E0;&amp;#x5E74;&amp;#x524D;&amp;#x751F;&amp;#x4EA7;&amp;#x3001; &amp;#x7ECF;&amp;#x5386;&amp;#x8FC7;&amp;#x597D;&amp;#x51E0;&amp;#x4EFB;&amp;#x4E3B;&amp;#x4EBA;&amp;#x7684; thinkpad T14&amp;#xFF0C;&amp;#x5904;&amp;#x7406;&amp;#x5668;&amp;#x578B;&amp;#x53F7;&amp;#x4E3A; 11th Gen Intel(R) Core(TM) i7-1165G7&amp;#xFF0C;&amp;#x5C3D;&amp;#x7BA1;&amp;#x7CFB;&amp;#x7EDF;&amp;#x5B89;&amp;#x88C5;&amp;#x7684;&amp;#x662F;&amp;#x5DF2;&amp;#x7ECF;&amp;#x6BD4;&amp;#x8F83;&amp;#x7CBE;&amp;#x7B80;&amp;#x7684; Windows 10 &amp;#x4F01;&amp;#x4E1A;&amp;#x7248; LTSC&amp;#xFF0C;&amp;#x4F46;&amp;#x4F7F;&amp;#x7528;&amp;#x8D77;&amp;#x6765;&amp;#x4F9D;&amp;#x7136;&amp;#x6BD4;&amp;#x8F83;&amp;#x5361;&amp;#x987F;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
    <category term="software" scheme="https://shiqingxu.gthub.io/tags/software/"/>
    
  </entry>
  
  <entry>
    <title>一个把 X 变回 Twitter 的浏览器插件</title>
    <link href="https://shiqingxu.gthub.io/2025/09/04/control-panel-for-twitter/"/>
    <id>https://shiqingxu.gthub.io/2025/09/04/control-panel-for-twitter/</id>
    <published>2025-09-04T00:16:28.000Z</published>
    <updated>2025-09-04T00:45:09.098Z</updated>
    
    <content type="html"><![CDATA[<p>&#x81EA;&#x6253;&#x9A6C;&#x4E00;&#x9F99;&#x6536;&#x8D2D; Twitter &#x5E76;&#x5C06;&#x5176;&#x53D8;&#x4E3A; X &#x4EE5;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x6211;&#x4ECE; 2009 &#x5E74;&#x5F00;&#x59CB;&#x7528;&#x7684;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x5E73;&#x53F0;&#x5C31;&#x53D8;&#x5F97;&#x539F;&#x6765;&#x8D8A;&#x96BE;&#x4E8E;&#x4F7F;&#x7528;&#xFF0C;&#x6210;&#x4E3A;&#x4E86;&#x4F17;&#x591A;&#x8425;&#x9500;&#x53F7;&#x5929;&#x5802;&#x5E73;&#x53F0;&#x4E2D;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x800C;&#x4E0D;&#x518D;&#x662F;&#x4EE5;&#x524D;&#x4EBA;&#x4EEC;&#x5F62;&#x5BB9;&#x7684;&#x5C0F;&#x9152;&#x9986;&#x3002;</p><span id="more"></span><p>&#x5F53;&#x7136;&#xFF0C;&#x5BA2;&#x89C2;&#x6765;&#x8BF4;&#xFF0C;&#x9A6C;&#x4E00;&#x9F99;&#x8FDB;&#x9A7B;&#x4EE5;&#x524D;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x9010;&#x6E10;&#x53D8;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EA;&#x662F;&#x4ED6;&#x4F7F;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x5927;&#x5927;&#x52A0;&#x901F;&#x4E86;&#x3002;&#x4F01;&#x4E1A;&#x8981;&#x8D5A;&#x94B1;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x3002;&#x524D;&#x4E24;&#x5929;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x8BF4;&#xFF0C;&#x5076;&#x7136;&#x53D1;&#x73B0;&#x4F60;&#x5C45;&#x7136;&#x8FD8;&#x5728;<strong>&#x575A;&#x6301;</strong>&#x4F7F;&#x7528;Twitter&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x770B;&#x5230;<strong>&#x575A;&#x6301;</strong>&#x4E24;&#x4E2A;&#x5B57;&#x6211;&#x8FD8;&#x89C9;&#x5F97;&#x6709;&#x70B9;&#x513F;&#x79BB;&#x8C31;&#xFF0C;&#x4F46;&#x4ED4;&#x7EC6;&#x60F3;&#x60F3;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x7528;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x662F;&#x9700;&#x8981;&#x575A;&#x6301;&#x624D;&#x80FD;&#x7528;&#x5F97;&#x4E0B;&#x53BB;&#x7684;&#x3002;</p><p>&#x4E0D;&#x8FC7;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x8BA9;&#x5176;&#x7A0D;&#x5FAE;&#x597D;&#x7528;&#x4E00;&#x70B9;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x63D2;&#x4EF6; <a href="https://github.com/insin/control-panel-for-twitter?tab=readme-ov-file"><strong>Control Panel for Twitter</strong></a> &#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x80FD;&#x628A; X &#x53D8;&#x56DE;&#x4EE5;&#x524D; Twitter &#x7684;&#x6837;&#x5B50;&#x3002;</p><p><img src="/2025/09/04/control-panel-for-twitter/chrome_store_screenshot.png"></p><p>&#x629B;&#x5F00;&#x80FD;&#x5237;&#x5230;&#x7684;&#x5185;&#x5BB9;&#x4E0D;&#x8C08;&#xFF0C;&#x7528;&#x4E0A;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x4E4B;&#x540E;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x8BF4;&#x719F;&#x6089;&#x7684;&#x611F;&#x89C9;&#x53C8;&#x56DE;&#x6765;&#x4E86;&#xFF0C;&#x8BBF;&#x95EE;&#x7F51;&#x9875;&#x65F6;&#x80FD;&#x591F;&#x770B;&#x5230;&#x4E45;&#x8FDD;&#x7684;&#x84DD;&#x8272;&#x5C0F;&#x9E1F;&#x3002;</p><p><img src="/2025/09/04/control-panel-for-twitter/blue_bird.png"></p><p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EA;&#x80FD;&#x505A;&#x5230;&#x5F62;&#x4F3C;&#xFF0C;&#x795E;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x4E86;&#xFF0C;&#x67D0;&#x79CD;&#x65F6;&#x4EE3;&#x65E9;&#x5C31;&#x843D;&#x5E55;&#x4E86;&#x3002;</p><p>&#x60F3;&#x8D77;&#x5F53;&#x5E74;&#x64AD;&#x5BA2;&#x8F6F;&#x4EF6; Castro &#x5728;&#x4E2D;&#x56FD;&#x88AB;&#x5C01;&#x9501;&#xFF0C;&#x5176; Twitter &#x8D26;&#x53F7;&#x53D1;&#x5E03;&#x4E86;&#x4E00;&#x6761;&#x901A;&#x77E5;&#xFF0C;&#x4E4B;&#x540E;&#x7528;&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;&#x5C06;&#x5176;&#x7FFB;&#x6210;&#x4E2D;&#x6587;&#x53C8;&#x53D1;&#x4E86;&#x4E00;&#x904D;&#xFF0C;</p><p>&#x5176;&#x4E2D;&#x7684;<em>Times are dark</em> &#x7FFB;&#x8BD1;&#x6210;<strong>&#x65F6;&#x4EE3;&#x5DF2;&#x7ECF;&#x9ED1;&#x4E86;</strong>&#x3002;</p><p><img src="/2025/09/04/control-panel-for-twitter/time_dark.png"></p><p>&#x65F6;&#x4EE3;&#x786E;&#x5B9E;&#x5DF2;&#x7ECF;&#x9ED1;&#x4E86;&#xFF0C;&#x8C37;&#x6B4C;&#x7FFB;&#x8BD1;&#x975E;&#x5E38;&#x4F1A;&#x5199;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x81EA;&amp;#x6253;&amp;#x9A6C;&amp;#x4E00;&amp;#x9F99;&amp;#x6536;&amp;#x8D2D; Twitter &amp;#x5E76;&amp;#x5C06;&amp;#x5176;&amp;#x53D8;&amp;#x4E3A; X &amp;#x4EE5;&amp;#x6765;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x6211;&amp;#x4ECE; 2009 &amp;#x5E74;&amp;#x5F00;&amp;#x59CB;&amp;#x7528;&amp;#x7684;&amp;#x793E;&amp;#x4EA4;&amp;#x7F51;&amp;#x7EDC;&amp;#x5E73;&amp;#x53F0;&amp;#x5C31;&amp;#x53D8;&amp;#x5F97;&amp;#x539F;&amp;#x6765;&amp;#x8D8A;&amp;#x96BE;&amp;#x4E8E;&amp;#x4F7F;&amp;#x7528;&amp;#xFF0C;&amp;#x6210;&amp;#x4E3A;&amp;#x4E86;&amp;#x4F17;&amp;#x591A;&amp;#x8425;&amp;#x9500;&amp;#x53F7;&amp;#x5929;&amp;#x5802;&amp;#x5E73;&amp;#x53F0;&amp;#x4E2D;&amp;#x7684;&amp;#x5176;&amp;#x4E2D;&amp;#x4E00;&amp;#x4E2A;&amp;#xFF0C;&amp;#x800C;&amp;#x4E0D;&amp;#x518D;&amp;#x662F;&amp;#x4EE5;&amp;#x524D;&amp;#x4EBA;&amp;#x4EEC;&amp;#x5F62;&amp;#x5BB9;&amp;#x7684;&amp;#x5C0F;&amp;#x9152;&amp;#x9986;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
    <category term="software" scheme="https://shiqingxu.gthub.io/tags/software/"/>
    
  </entry>
  
  <entry>
    <title>IM 工具输入框没有发送按钮</title>
    <link href="https://shiqingxu.gthub.io/2025/09/03/IM-tools-without-Send-button/"/>
    <id>https://shiqingxu.gthub.io/2025/09/03/IM-tools-without-Send-button/</id>
    <published>2025-09-03T00:24:10.000Z</published>
    <updated>2025-09-03T00:38:44.742Z</updated>
    
    <content type="html"><![CDATA[<p>&#x516C;&#x53F8;&#x81EA;&#x7814;&#x7684; IM &#x6C9F;&#x901A;&#x5DE5;&#x5177;&#xFF0C;&#x76EE;&#x524D;&#x8FD8;&#x5904;&#x4E8E;&#x975E;&#x5E38;&#x96BE;&#x7528;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4E3B;&#x8981;&#x662F; bug &#x592A;&#x591A;&#x3002;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#x91CC;&#x6211;&#x6709;&#x63D0;&#x5230;&#x8FC7;&#x5176;&#x65E5;&#x5386;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x81F3;&#x4ECA;&#x6CA1;&#x6709;&#x88AB;&#x5B8C;&#x5168;&#x89E3;&#x51B3;&#x3002;&#x9664;&#x4E86;bug &#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x4E3B;&#x52A8;&#x8BBE;&#x8BA1;&#x7684;&#x96BE;&#x7528;&#x4E4B;&#x5904;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x6BEB;&#x65E0;&#x5FC5;&#x8981;&#x3002;</p><span id="more"></span><p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6C9F;&#x901A;&#x5DE5;&#x5177;&#xFF0C;&#x8F93;&#x5165;&#x6846;&#x91CC;&#x6CA1;&#x6709;<code>&#x53D1;&#x9001;</code>&#x6309;&#x94AE;&#xFF0C;&#x53EA;&#x80FD;&#x6309;&#x56DE;&#x8F66;&#x53D1;&#x9001;&#x3002;&#x6709;&#x4EBA;&#x5728;&#x7FA4;&#x91CC;&#x63D0;&#x51FA;&#x8D28;&#x7591;&#xFF0C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x8BF4;&#x4F01;&#x4E1A;&#x5FAE;&#x4FE1;&#x4E5F;&#x6CA1;&#x6709;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x4F01;&#x4E1A;&#x5FAE;&#x4FE1;&#x662F;&#x6709;<code>&#x53D1;&#x9001;</code>&#x6309;&#x94AE;&#x7684;&#x3002;</p><p>&#x53EF;&#x80FD;&#x8FD9;&#x4F4D;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x662F;&#x4E2A;&#x952E;&#x76D8;&#x515A;&#xFF0C;&#x559C;&#x6B22;&#x624B;&#x638C;&#x4E0D;&#x7528;&#x79BB;&#x5F00;&#x952E;&#x76D8;&#x7684;&#x6548;&#x7387;&#x3002;&#x4E0D;&#x8FC7;&#x5E76;&#x975E;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x559C;&#x6B22;&#x6216;&#x8005;&#x9700;&#x8981;&#x624B;&#x638C;&#x4E0D;&#x7528;&#x79BB;&#x5F00;&#x952E;&#x76D8;&#xFF0C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x6709;&#x70B9;&#x513F;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x559C;&#x597D;&#x5F3A;&#x52A0;&#x7ED9;&#x7528;&#x6237;&#x4E86;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x5728;&#x4F01;&#x4E1A; IM &#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x7528;&#x9F20;&#x6807;&#x70B9;&#x51FB;<code>&#x53D1;&#x9001;</code>&#x6309;&#x94AE;&#x751A;&#x81F3;&#x6BD4;&#x6309;&#x56DE;&#x8F66;&#x952E;&#x66F4;&#x5E38;&#x7528;&#x3002;</p><p>&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x573A;&#x666F;&#xFF1A;</p><ul><li>&#x7F16;&#x8F91;&#x5B8C;&#x4E00;&#x6BB5;&#x8BDD;&#x4E4B;&#x540E;&#x7528;&#x9F20;&#x6807;&#x6EDA;&#x52A8;&#x68C0;&#x67E5;&#xFF0C;&#x68C0;&#x67E5;&#x5B8C;&#x4E4B;&#x540E;&#x53D1;&#x51FA;&#xFF1B;</li><li>&#x8F93;&#x5165;&#x4E00;&#x6BB5;&#x6587;&#x5B57;&#x4E4B;&#x540E;&#xFF0C;&#x9F20;&#x6807;&#x64CD;&#x4F5C;&#x63D2;&#x5165;emoji&#x53D1;&#x9001;&#xFF1B;</li><li>&#x9F20;&#x6807;&#x9009;&#x62E9;&#x8D34;&#x7EB8;&#x540E;&#x53D1;&#x9001;&#xFF1B;</li></ul><p>&#x5C31;&#x6211;&#x81EA;&#x5DF1;&#x4F7F;&#x7528;&#x7684;&#x60C5;&#x51B5;&#x6765;&#x770B;&#xFF0C;&#x7ECF;&#x5E38;&#x662F;&#x9700;&#x8981;&#x5148;&#x68C0;&#x67E5;&#x518D;&#x53D1;&#x51FA;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x91CD;&#x8981;&#x7684;&#x4F1A;&#x8BAE;&#x7EAA;&#x8981;&#x3001;&#x68C0;&#x67E5;@&#x7684;&#x4EBA;&#x7B49;&#x3002;&#x4E2A;&#x4EBA; IM &#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5F88;&#x6709;&#x6240;&#x8C13;&#xFF0C;&#x4F01;&#x4E1A;&#x573A;&#x666F;&#x4E0B;&#x8FD8;&#x662F;&#x8C28;&#x614E;&#x4E00;&#x4E9B;&#x597D;&#x3002;</p><p>&#x81EA;&#x6709;&#x4EBA;&#x8D28;&#x7591;&#x8FD9;&#x4E2A;&#x70B9;&#x4E4B;&#x540E;&#xFF0C;&#x8FED;&#x4EE3;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x7248;&#x672C;&#x4E86;&#xFF0C;&#x59CB;&#x7EC8;&#x6CA1;&#x6709;&#x4FEE;&#x590D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x90A3;&#x4F4D;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E0D;&#x4EC5;&#x4F01;&#x4E1A;&#x5FAE;&#x4FE1;&#x6709;<code>&#x53D1;&#x9001;</code>&#x6309;&#x94AE;&#xFF0C;&#x5E02;&#x9762;&#x4E0A;&#x80FD;&#x627E;&#x5230;&#x7684;&#x51E0;&#x4E4E;&#x6240;&#x6709; IM &#x5DE5;&#x5177;&#x90FD;&#x662F;&#x6709;&#x8FD9;&#x4E2A;&#x6309;&#x94AE;&#x7684;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x77E5;&#x9053;&#x4E86;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x613F;&#x610F;&#x4FEE;&#x590D;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#xFF0C;&#x5C31;&#x662F;&#x559C;&#x6B22;&#x6559;&#x80B2;&#x7528;&#x6237;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x516C;&amp;#x53F8;&amp;#x81EA;&amp;#x7814;&amp;#x7684; IM &amp;#x6C9F;&amp;#x901A;&amp;#x5DE5;&amp;#x5177;&amp;#xFF0C;&amp;#x76EE;&amp;#x524D;&amp;#x8FD8;&amp;#x5904;&amp;#x4E8E;&amp;#x975E;&amp;#x5E38;&amp;#x96BE;&amp;#x7528;&amp;#x7684;&amp;#x72B6;&amp;#x6001;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8981;&amp;#x662F; bug &amp;#x592A;&amp;#x591A;&amp;#x3002;&amp;#x5728;&amp;#x4E4B;&amp;#x524D;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x535A;&amp;#x5BA2;&amp;#x91CC;&amp;#x6211;&amp;#x6709;&amp;#x63D0;&amp;#x5230;&amp;#x8FC7;&amp;#x5176;&amp;#x65E5;&amp;#x5386;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x81F3;&amp;#x4ECA;&amp;#x6CA1;&amp;#x6709;&amp;#x88AB;&amp;#x5B8C;&amp;#x5168;&amp;#x89E3;&amp;#x51B3;&amp;#x3002;&amp;#x9664;&amp;#x4E86;bug &amp;#x4E4B;&amp;#x5916;&amp;#xFF0C;&amp;#x8FD8;&amp;#x53D1;&amp;#x73B0;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EA7;&amp;#x54C1;&amp;#x7ECF;&amp;#x7406;&amp;#x4E3B;&amp;#x52A8;&amp;#x8BBE;&amp;#x8BA1;&amp;#x7684;&amp;#x96BE;&amp;#x7528;&amp;#x4E4B;&amp;#x5904;&amp;#xFF0C;&amp;#x5E76;&amp;#x4E14;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BBE;&amp;#x8BA1;&amp;#x6BEB;&amp;#x65E0;&amp;#x5FC5;&amp;#x8981;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="software" scheme="https://shiqingxu.gthub.io/tags/software/"/>
    
    <category term="吐槽" scheme="https://shiqingxu.gthub.io/tags/%E5%90%90%E6%A7%BD/"/>
    
  </entry>
  
  <entry>
    <title>统一 Win 与 macOS 两台电脑上的博客文件换行符为 LF</title>
    <link href="https://shiqingxu.gthub.io/2025/09/02/make-CRLF-to-LF/"/>
    <id>https://shiqingxu.gthub.io/2025/09/02/make-CRLF-to-LF/</id>
    <published>2025-09-02T00:34:04.000Z</published>
    <updated>2025-09-03T00:46:02.809Z</updated>
    
    <content type="html"><![CDATA[<p>&#x65E5;&#x5E38;&#x4F1A;&#x5728;&#x4E24;&#x53F0;&#x7535;&#x8111;&#x4E0A;&#x66F4;&#x65B0;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#xFF0C;&#x5E76;&#x901A;&#x8FC7; GitHub &#x4ED3;&#x5E93;&#x5B58;&#x50A8;&#x548C;&#x540C;&#x6B65;&#x535A;&#x5BA2;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x4E00;&#x53F0;&#x7CFB;&#x7EDF;&#x662F; win10&#xFF0C;&#x53E6;&#x4E00;&#x53F0;&#x662F; macOS&#x3002;&#x5927;&#x81F4;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x662F;&#x5199;&#x5B8C;&#x5E76; hexo d &#x4E4B;&#x540E;&#xFF0C;&#x7528; <code>git add</code> <code>git commit</code> <code>git push</code> &#x547D;&#x4EE4;&#xFF0C;&#x5C06;&#x672C;&#x5730;&#x6587;&#x4EF6; push &#x5230; GitHub &#x4ED3;&#x5E93;&#x91CC;&#x3002;&#x5728;&#x53E6;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x4E0A;&#x5199;&#x4F5C;&#x524D;&#x5148; <code>git pull</code> &#x4E00;&#x4E0B;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x6587;&#x4EF6;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;</p><span id="more"></span><p>&#x5728;&#x8FD9;&#x79CD;&#x5DE5;&#x4F5C;&#x6D41;&#x4E4B;&#x4E0B;&#xFF0C;&#x5728; win10 &#x4E0A;&#x6267;&#x884C;<code>git add</code> &#x547D;&#x4EE4;&#x65F6;&#xFF0C;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x6761;&#x63D0;&#x9192;:</p><p> <code>warning: in the working copy of &apos;source/_posts/xxx.md&apos;, LF will be replaced by CRLF the next time Git touches it</code></p><p>&#x8FD9;&#x6761;&#x63D0;&#x9192;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF1A; Git &#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x6587;&#x4EF6; <code>source/_posts/xxx.md</code> &#x76EE;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x662F; Unix &#x98CE;&#x683C;&#x7684;&#x6362;&#x884C;&#x7B26;&#xFF08;LF&#xFF09;&#xFF0C;&#x4F46;&#x6839;&#x636E; win10 &#x4E0A; Git &#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x5B83;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x6B21;&#x64CD;&#x4F5C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x81EA;&#x52A8;&#x628A;&#x6362;&#x884C;&#x7B26;&#x8F6C;&#x6362;&#x6210; Windows &#x98CE;&#x683C;&#x7684;&#xFF08;CRLF&#xFF09;&#x3002;</p><h2 id="&#x4E0D;&#x540C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6362;&#x884C;&#x7B26;&#x5DEE;&#x5F02;"><a href="#&#x4E0D;&#x540C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6362;&#x884C;&#x7B26;&#x5DEE;&#x5F02;" class="headerlink" title="&#x4E0D;&#x540C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6362;&#x884C;&#x7B26;&#x5DEE;&#x5F02;"></a>&#x4E0D;&#x540C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6362;&#x884C;&#x7B26;&#x5DEE;&#x5F02;</h2><p>&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x8868;&#x793A;&#x201C;&#x6362;&#x884C;&#x201D;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x6B8A;&#x5B57;&#x7B26;&#xFF1A;</p><ul><li><strong>LF (Line Feed, <code>\n</code>)<strong>&#xFF1A;</strong>Unix / Linux / macOS</strong> &#x4F7F;&#x7528;&#x7684;&#x6362;&#x884C;&#x7B26;&#x3002;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x201C;&#x6362;&#x5230;&#x4E0B;&#x4E00;&#x884C;&#x201D;&#x3002;</li><li><strong>CRLF (Carriage Return + Line Feed, <code>\r\n</code>)<strong>&#xFF1A;</strong>Windows</strong> &#x4F7F;&#x7528;&#x7684;&#x6362;&#x884C;&#x7B26;&#x3002;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x201C;&#x5149;&#x6807;&#x56DE;&#x5230;&#x884C;&#x9996;&#xFF08;CR&#xFF09;&#x5E76;&#x6362;&#x5230;&#x4E0B;&#x4E00;&#x884C;&#xFF08;LF&#xFF09;&#x201D;&#xFF0C;&#x5C31;&#x50CF;&#x8001;&#x5F0F;&#x6253;&#x5B57;&#x673A;&#x4E00;&#x6837;&#x3002;</li></ul><p>&#x6211;&#x9047;&#x5230;&#x7684;&#x60C5;&#x51B5;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p><ul><li>&#x5728; <strong>mac</strong> &#x4E0A;&#x7F16;&#x8F91;&#x548C;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#xFF0C;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x6362;&#x884C;&#x7B26;&#x662F; <strong>LF</strong>&#x3002;</li><li>&#x628A;&#x6587;&#x4EF6;&#x540C;&#x6B65;&#x5230;&#x4E86; <strong>Windows</strong> &#x7535;&#x8111;&#x4E0A;&#x3002;</li><li>Windows &#x4E0A;&#x7684; Git &#x68C0;&#x6D4B;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x6765;&#x81EA; macOS &#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x63D0;&#x793A;&#x5B83;&#x5C06;&#x4F1A;&#x6839;&#x636E;&#x672C;&#x5730;&#xFF08;Windows&#xFF09;&#x7684;&#x4E60;&#x60EF;&#x6765;&#x5904;&#x7406;&#x6362;&#x884C;&#x7B26;&#x3002;</li></ul><h3 id="Git-&#x7684;&#x89D2;&#x8272;&#xFF1A;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x529F;&#x80FD;"><a href="#Git-&#x7684;&#x89D2;&#x8272;&#xFF1A;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x529F;&#x80FD;" class="headerlink" title="Git &#x7684;&#x89D2;&#x8272;&#xFF1A;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x529F;&#x80FD;"></a>Git &#x7684;&#x89D2;&#x8272;&#xFF1A;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x529F;&#x80FD;</h3><p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8DE8;&#x5E73;&#x53F0;&#x534F;&#x4F5C;&#x65F6;&#x7684;&#x6362;&#x884C;&#x7B26;&#x6DF7;&#x4E71;&#x95EE;&#x9898;&#xFF0C;Git &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>core.autocrlf</code> &#x7684;&#x914D;&#x7F6E;&#x9879;&#xFF0C;&#x5B83;&#x80FD;&#x81EA;&#x52A8;&#x5728;&#x63D0;&#x4EA4;&#x548C;&#x68C0;&#x51FA;&#x4EE3;&#x7801;&#x65F6;&#x8F6C;&#x6362;&#x6362;&#x884C;&#x7B26;&#x3002;</p><p>&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x6709;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x503C;&#xFF1A;</p><ul><li><code>true</code>&#xFF1A;&#x8FD9;&#x662F; <strong>Windows &#x5B89;&#x88C5; Git &#x65F6;&#x7684;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;</strong>&#x3002;<ul><li>&#x5F53;<strong>&#x63D0;&#x4EA4; (<code>git add</code>)</strong> &#x6587;&#x4EF6;&#x65F6;&#xFF0C;Git &#x4F1A;&#x81EA;&#x52A8;&#x5C06; CRLF &#x8F6C;&#x6362;&#x4E3A; LF&#xFF0C;&#x518D;&#x5B58;&#x5165;&#x4ED3;&#x5E93;&#x3002;</li><li>&#x5F53;<strong>&#x68C0;&#x51FA; (<code>git checkout</code> &#x6216; <code>git clone</code>)</strong> &#x6587;&#x4EF6;&#x65F6;&#xFF0C;Git &#x4F1A;&#x81EA;&#x52A8;&#x5C06;&#x4ED3;&#x5E93;&#x4E2D;&#x7684; LF &#x8F6C;&#x6362;&#x4E3A; CRLF&#xFF0C;&#x65B9;&#x4FBF;&#x5728; Windows &#x4E0A;&#x67E5;&#x770B;&#x548C;&#x7F16;&#x8F91;&#x3002;</li></ul></li><li><code>input</code>&#xFF1A;&#x8FD9;&#x662F; <strong>macOS &#x548C; Linux &#x7528;&#x6237;&#x63A8;&#x8350;&#x7684;&#x8BBE;&#x7F6E;</strong>&#x3002;<ul><li>&#x5F53;<strong>&#x63D0;&#x4EA4; (<code>git add</code>)</strong> &#x6587;&#x4EF6;&#x65F6;&#xFF0C;Git &#x4F1A;&#x5C06; CRLF &#x8F6C;&#x6362;&#x4E3A; LF&#x3002;</li><li>&#x5F53;<strong>&#x68C0;&#x51FA; (<code>git checkout</code>)</strong> &#x65F6;&#xFF0C;<strong>&#x4E0D;&#x505A;&#x4EFB;&#x4F55;&#x8F6C;&#x6362;</strong>&#xFF0C;&#x4FDD;&#x7559;&#x4ED3;&#x5E93;&#x4E2D;&#x7684; LF&#x3002;</li></ul></li><li><code>false</code>&#xFF1A;&#x5173;&#x95ED;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x529F;&#x80FD;&#x3002;Git &#x4E0D;&#x4F1A;&#x7406;&#x4F1A;&#x6362;&#x884C;&#x7B26;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x770B;&#x5230;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x63D0;&#x4EA4;&#x7684;&#x5C31;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x8FD9;&#x5728;&#x8DE8;&#x5E73;&#x53F0;&#x534F;&#x4F5C;&#x65F6;&#x5BB9;&#x6613;&#x9020;&#x6210;&#x95EE;&#x9898;&#x3002;</li></ul><p>&#x5F53;&#x6211; <code>git add</code> &#x4E00;&#x4E2A; LF &#x6587;&#x4EF6;&#x65F6;&#xFF0C;Git &#x544A;&#x8BC9;&#x6211;&#xFF1A;&#x201C;&#x867D;&#x7136;&#x4F60;&#x73B0;&#x5728;&#x628A;&#x5B83;&#x52A0;&#x5230;&#x6682;&#x5B58;&#x533A;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5728;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x91CC;&#x8FD8;&#x662F; LF &#x683C;&#x5F0F;&#x3002;&#x4E0B;&#x6B21;&#x6211;&#x518D;&#x2018;&#x78B0;&#x2019;&#x5230;&#x5B83;&#xFF08;&#x6BD4;&#x5982; <code>commit</code> &#x4E4B;&#x540E;&#x518D; <code>checkout</code>&#xFF09;&#xFF0C;&#x6211;&#x5C31;&#x4F1A;&#x628A;&#x5B83;&#x53D8;&#x6210; CRLF &#x683C;&#x5F0F;&#x3002;&#x201D;</p><h2 id="&#x89E3;&#x51B3;&#x65B9;&#x6CD5;"><a href="#&#x89E3;&#x51B3;&#x65B9;&#x6CD5;" class="headerlink" title="&#x89E3;&#x51B3;&#x65B9;&#x6CD5;"></a>&#x89E3;&#x51B3;&#x65B9;&#x6CD5;</h2><p>&#x5C3D;&#x7BA1;&#x8FD9;&#x4E2A;&#x63D0;&#x9192;&#x4E0D;&#x5E26;&#x6765;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x8FC7;&#x6BCF;&#x6B21;&#x9047;&#x5230;&#x8FD8;&#x662F;&#x7565;&#x5FAE;&#x6709;&#x70B9;&#x513F;&#x70E6;&#x4EBA;&#xFF0C;&#x51B3;&#x5B9A;&#x7EDF;&#x4E00;&#x4E00;&#x4E0B;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x6362;&#x884C;&#x7B26;&#x98CE;&#x683C;&#x3002;</p><h3 id="&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x7EDF;&#x4E00;&#x4E24;&#x53F0;&#x7535;&#x8111;&#x7684;-Git-&#x914D;&#x7F6E;"><a href="#&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x7EDF;&#x4E00;&#x4E24;&#x53F0;&#x7535;&#x8111;&#x7684;-Git-&#x914D;&#x7F6E;" class="headerlink" title="&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x7EDF;&#x4E00;&#x4E24;&#x53F0;&#x7535;&#x8111;&#x7684; Git &#x914D;&#x7F6E;"></a>&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x7EDF;&#x4E00;&#x4E24;&#x53F0;&#x7535;&#x8111;&#x7684; Git &#x914D;&#x7F6E;</h3><p>&#x4E3A;&#x4E86;&#x8BA9; Git &#x7684;&#x884C;&#x4E3A;&#x5728;&#x6211;&#x7684;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x4E0A;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x548C;&#x6E05;&#x6670;&#xFF0C;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x8BBE;&#x7F6E; <code>core.autocrlf</code>&#x3002;</p><ol><li><p><strong>&#x5728; Win10&#x4E0A;</strong>&#xFF0C;&#x6253;&#x5F00; Git Bash &#x6216;&#x547D;&#x4EE4;&#x884C;&#xFF0C;&#x8FD0;&#x884C;&#xFF1A;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">git config --global core.autocrlf true</span><br></pre></td></tr></table></figure></li><li><p><strong>&#x5728; macOS &#x4E0A;</strong>&#xFF0C;&#x6253;&#x5F00;&#x7EC8;&#x7AEF;&#xFF0C;&#x8FD0;&#x884C;&#xFF1A;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">git config --global core.autocrlf input</span><br></pre></td></tr></table></figure></li></ol><p>&#x8FD9;&#x6837;&#x914D;&#x7F6E;&#x540E;&#xFF0C;&#x65E0;&#x8BBA;&#x5728;&#x54EA;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0A;&#x64CD;&#x4F5C;&#xFF0C;&#x63D0;&#x4EA4;&#x5230;&#x4ED3;&#x5E93;&#x7684;&#x6587;&#x4EF6;&#x6700;&#x7EC8;&#x90FD;&#x4F1A;&#x88AB;&#x7EDF;&#x4E00;&#x4E3A; LF &#x683C;&#x5F0F;&#x3002;Windows &#x4F1A;&#x5728;&#x672C;&#x5730;&#x4E3A;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#xFF0C;&#x800C; Mac &#x5219;&#x76F4;&#x63A5;&#x4F7F;&#x7528; LF&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x8DE8;&#x5E73;&#x53F0;&#x95EE;&#x9898;&#x3002;</p><h3 id="&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x4F7F;&#x7528;-gitattributes-&#x6587;&#x4EF6;"><a href="#&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x4F7F;&#x7528;-gitattributes-&#x6587;&#x4EF6;" class="headerlink" title="&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x4F7F;&#x7528; .gitattributes &#x6587;&#x4EF6;"></a>&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x4F7F;&#x7528; <code>.gitattributes</code> &#x6587;&#x4EF6;</h3><p>&#x8FD9;&#x662F;&#x5728;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x5E0C;&#x671B;&#x9879;&#x76EE;&#x672C;&#x8EAB;&#x5C31;&#x5305;&#x542B;&#x914D;&#x7F6E;&#x65F6;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x4F1A;&#x8986;&#x76D6;&#x4E2A;&#x4EBA;&#x7684;&#x5168;&#x5C40;&#x914D;&#x7F6E;&#xFF0C;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x4F7F;&#x7528;&#x8BE5;&#x4ED3;&#x5E93;&#x7684;&#x4EBA;&#x90FD;&#x9075;&#x5FAA;&#x540C;&#x6837;&#x7684;&#x89C4;&#x5219;&#x3002;</p><ol><li><p>&#x5728;&#x535A;&#x5BA2;&#x4ED3;&#x5E93;&#x7684;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>.gitattributes</code> &#x7684;&#x6587;&#x4EF6;&#x3002;</p></li><li><p>&#x5728;&#x8BE5;&#x6587;&#x4EF6;&#x4E2D;&#x6DFB;&#x52A0;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">* text=auto</span><br></pre></td></tr></table></figure></li><li><p>&#x5C06; <code>.gitattributes</code> &#x6587;&#x4EF6; <code>add</code>, <code>commit</code>, <code>push</code> &#x5230; <code>main</code> &#x5206;&#x652F;&#x3002;</p></li></ol><p><strong><code>\* text=auto</code> &#x7684;&#x4F5C;&#x7528;&#x662F;&#xFF1A;</strong> Git &#x4F1A;&#x81EA;&#x52A8;&#x5224;&#x65AD;&#x54EA;&#x4E9B;&#x662F;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x3002;&#x5BF9;&#x4E8E;&#x5B83;&#x8BA4;&#x4E3A;&#x662F;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5B83;&#x4F1A;&#x5728; Windows &#x4E0A;&#x542F;&#x7528; LF &#x2194; CRLF &#x7684;&#x8F6C;&#x6362;&#xFF0C;&#x800C;&#x5728; macOS/Linux &#x4E0A;&#x5219;&#x7981;&#x7528;&#x8F6C;&#x6362;&#xFF0C;&#x786E;&#x4FDD;&#x4ED3;&#x5E93;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x662F; LF&#x3002;&#x8FD9;&#x57FA;&#x672C;&#x4E0A;&#x5B9E;&#x73B0;&#x4E86;&#x548C;&#x65B9;&#x6CD5;&#x4E00;&#x540C;&#x6837;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x597D;&#x5904;&#x662F;&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x662F;&#x8DDF;&#x7740;&#x9879;&#x76EE;&#x8D70;&#x7684;&#xFF0C;&#x4EE5;&#x540E;&#x6362;&#x4E86;&#x65B0;&#x7535;&#x8111;&#x4E5F;&#x65E0;&#x9700;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x3002;</p><p>&#x4E3A;&#x4E86;&#x4E00;&#x52B3;&#x6C38;&#x9038;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x65B9;&#x6CD5;&#x4E8C;&#xFF0C;&#x4EE5;&#x540E;&#x518D;&#x6362;&#x7535;&#x8111;&#x3001;&#x91CD;&#x88C5;&#x7CFB;&#x7EDF;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8BBE;&#x7F6E;&#x4E86;&#x3002;</p><h2 id="&#x5237;&#x65B0;&#x672C;&#x5730;&#x6587;&#x4EF6;"><a href="#&#x5237;&#x65B0;&#x672C;&#x5730;&#x6587;&#x4EF6;" class="headerlink" title="&#x5237;&#x65B0;&#x672C;&#x5730;&#x6587;&#x4EF6;"></a>&#x5237;&#x65B0;&#x672C;&#x5730;&#x6587;&#x4EF6;</h2><p>&#x4EC5;&#x6DFB;&#x52A0; <code>.gitattributes</code>&#x53EA;&#x4F1A;&#x6539;&#x53D8;&#x672A;&#x6765;&#x65B0;&#x589E;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5BF9;&#x4E8E;&#x672C;&#x5730;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x9700;&#x8BA9; Git &#x91CD;&#x65B0;&#x5904;&#x7406;&#x4E00;&#x904D;&#x3002;</p><p>1&#x3001;&#x5220;&#x9664; Git &#x6682;&#x5B58;&#x533A;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x8BB0;&#x5F55;&#xFF0C;&#x4F46;&#x4FDD;&#x7559;&#x672C;&#x5730;&#x6587;&#x4EF6;&#x3002;</p><p><code>git rm --cached -r .</code></p><p>2&#x3001;&#x8BA9; Git &#x91CD;&#x65B0;&#x628A;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x52A0;&#x56DE;&#x6682;&#x5B58;&#x533A;&#xFF0C;&#x5E76;&#x5237;&#x65B0;&#x5DE5;&#x4F5C;&#x533A;&#x3002;</p><p><code>git reset --hard HEAD</code></p><p>&#x53E6;&#x4E00;&#x4E2A;&#x65B9;&#x6848;&#x5219;&#x662F;&#x76F4;&#x63A5;&#x5220;&#x9664;&#x672C;&#x5730;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x62C9;&#x53D6;&#x4E00;&#x904D;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x65E5;&amp;#x5E38;&amp;#x4F1A;&amp;#x5728;&amp;#x4E24;&amp;#x53F0;&amp;#x7535;&amp;#x8111;&amp;#x4E0A;&amp;#x66F4;&amp;#x65B0;&amp;#x8FD9;&amp;#x4E2A;&amp;#x535A;&amp;#x5BA2;&amp;#xFF0C;&amp;#x5E76;&amp;#x901A;&amp;#x8FC7; GitHub &amp;#x4ED3;&amp;#x5E93;&amp;#x5B58;&amp;#x50A8;&amp;#x548C;&amp;#x540C;&amp;#x6B65;&amp;#x535A;&amp;#x5BA2;&amp;#x6E90;&amp;#x6587;&amp;#x4EF6;&amp;#xFF0C;&amp;#x4E00;&amp;#x53F0;&amp;#x7CFB;&amp;#x7EDF;&amp;#x662F; win10&amp;#xFF0C;&amp;#x53E6;&amp;#x4E00;&amp;#x53F0;&amp;#x662F; macOS&amp;#x3002;&amp;#x5927;&amp;#x81F4;&amp;#x7684;&amp;#x5DE5;&amp;#x4F5C;&amp;#x6D41;&amp;#x662F;&amp;#x5199;&amp;#x5B8C;&amp;#x5E76; hexo d &amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x7528; &lt;code&gt;git add&lt;/code&gt; &lt;code&gt;git commit&lt;/code&gt; &lt;code&gt;git push&lt;/code&gt; &amp;#x547D;&amp;#x4EE4;&amp;#xFF0C;&amp;#x5C06;&amp;#x672C;&amp;#x5730;&amp;#x6587;&amp;#x4EF6; push &amp;#x5230; GitHub &amp;#x4ED3;&amp;#x5E93;&amp;#x91CC;&amp;#x3002;&amp;#x5728;&amp;#x53E6;&amp;#x4E00;&amp;#x53F0;&amp;#x7535;&amp;#x8111;&amp;#x4E0A;&amp;#x5199;&amp;#x4F5C;&amp;#x524D;&amp;#x5148; &lt;code&gt;git pull&lt;/code&gt; &amp;#x4E00;&amp;#x4E0B;&amp;#xFF0C;&amp;#x4EE5;&amp;#x4FDD;&amp;#x8BC1;&amp;#x6587;&amp;#x4EF6;&amp;#x7684;&amp;#x4E00;&amp;#x81F4;&amp;#x6027;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
    <category term="blog" scheme="https://shiqingxu.gthub.io/tags/blog/"/>
    
  </entry>
  
  <entry>
    <title>睡眠调整日记（1）</title>
    <link href="https://shiqingxu.gthub.io/2025/09/01/sleeping-optimization-diary-1/"/>
    <id>https://shiqingxu.gthub.io/2025/09/01/sleeping-optimization-diary-1/</id>
    <published>2025-09-01T00:24:54.000Z</published>
    <updated>2025-09-03T00:38:44.950Z</updated>
    
    <content type="html"><![CDATA[<p>&#x81EA;&#x544A;&#x522B;&#x9AD8;&#x4E2D;&#x5C01;&#x95ED;&#x5F0F;&#x7BA1;&#x7406;&#x7684;&#x96C6;&#x4F53;&#x751F;&#x6D3B;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x518D;&#x4E5F;&#x6CA1;&#x80FD;&#x591F;&#x65E0;&#x75DB;&#x65E9;&#x7761;&#x65E9;&#x8D77;&#x8FC7;&#x3002;&#x5C3D;&#x7BA1;&#x6709;&#x8FC7;&#x8BB8;&#x591A;&#x6B21;&#x4E0B;&#x5B9A;&#x51B3;&#x5FC3;&#x8981;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x6668;&#x578B;&#x4EBA;&#xFF0C;&#x4F46;&#x5C1D;&#x8BD5;&#x591A;&#x6B21;&#x5747;&#x5DF2;&#x5931;&#x8D25;&#x544A;&#x7EC8;&#xFF0C;&#x5E76;&#x56E0;&#x6B64;&#x7ECF;&#x5E38;&#x8D23;&#x5907;&#x81EA;&#x5DF1;&#x3002;&#x76F4;&#x5230;&#x770B;&#x51FA;&#x7761;&#x7720;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x7684;&#x4E13;&#x5BB6; <em>Matthew Walker</em> &#x7684;&#x8457;&#x4F5C; <em>Why We Sleep</em> &#x91CC;&#x8C08;&#x5230;&#x6709;&#x4E9B;&#x4EBA;&#x5929;&#x751F;&#x665A;&#x7761;&#x665A;&#x8D77;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x57FA;&#x56E0;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x6211;&#x7684;&#x5FC3;&#x6001;&#x624D;&#x7A0D;&#x5FAE;&#x5E73;&#x548C;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x5728;&#x7761;&#x7720;&#x8FD9;&#x4EF6;&#x4E8B;&#x4E0A;&#x4E0D;&#x518D;&#x90A3;&#x4E48;&#x82DB;&#x8D23;&#x81EA;&#x5DF1;&#x3002;</p><span id="more"></span><p>2023 &#x5E74;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x82B1;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x53BB;&#x5173;&#x6CE8;&#x5982;&#x4F55;&#x8BA9;&#x81EA;&#x5DF1;&#x6D3B;&#x5F97;&#x66F4;&#x5065;&#x5EB7;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x90A3;&#x4F1A;&#x513F;&#x4E5F;&#x5199;&#x8FC7;&#x4E86;&#x8DDF;Fasting&#x6709;&#x5173;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x6211;&#x4E5F;&#x4E0B;&#x51B3;&#x5FC3;&#x5C1D;&#x8BD5;&#x65E9;&#x7761;&#x65E9;&#x8D77;&#xFF0C;&#x5E76;&#x5927;&#x6982;&#x575A;&#x6301;&#x4E86;&#x4E09;&#x56DB;&#x5929;&#x4E00;&#x65E9;&#x8D77;&#x5E8A;&#x51FA;&#x95E8;&#x53BB;&#x5065;&#x8EAB;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x5931;&#x8D25;&#x4E86;&#x3002;</p><p><img src="/2025/09/01/sleeping-optimization-diary-1/WhyWeSleep1.png"></p><p>&#x6211;&#x53EF;&#x80FD;&#x5929;&#x751F;&#x5C31;&#x662F;&#x4E2A;&#x591C;&#x732B;&#x5B50;&#x5427;&#x3002;&#x4E5F;&#x662F;&#x5728;&#x90A3;&#x65F6;&#x5019;&#x521D;&#x6B21;&#x8BFB;&#x5230;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x3002;</p><h2 id="&#x665A;&#x7761;&#x578B;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x65E9;&#x7761;&#x65E9;&#x8D77;"><a href="#&#x665A;&#x7761;&#x578B;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x65E9;&#x7761;&#x65E9;&#x8D77;" class="headerlink" title="&#x665A;&#x7761;&#x578B;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x65E9;&#x7761;&#x65E9;&#x8D77;"></a>&#x665A;&#x7761;&#x578B;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x65E9;&#x7761;&#x65E9;&#x8D77;</h2><p>&#x4EE4;&#x4EBA;&#x610F;&#x5916;&#x7684;&#x662F;&#xFF0C;&#x4ECA;&#x5E74;&#x627E;&#x5230;&#x4E00;&#x4EFD;&#x5355;&#x7A0B;&#x901A;&#x52E4;&#x65F6;&#x95F4;&#x957F;&#x8FBE;&#x4E00;&#x5C0F;&#x65F6;&#x7684;&#x65B0;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x7A81;&#x7136;&#x5C31;&#x65E0;&#x75DB;&#x5B9E;&#x73B0;&#x4E86;&#x65E9;&#x7761;&#x65E9;&#x8D77;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x81F3;&#x4ECA;&#x4E09;&#x4E2A;&#x591A;&#x6708;&#x8FC7;&#x53BB;&#xFF0C;&#x5927;&#x6982;&#x53EA;&#x6709;&#x90A3;&#x4E48;&#x4E24;&#x4E09;&#x4E2A;&#x5468;&#x65E5;&#x7684;&#x665A;&#x4E0A;&#x56E0;&#x4E3A;&#x5468;&#x672B;&#x7684;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#x800C;&#x7A0D;&#x5FAE;&#x665A;&#x7761;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x5468;&#x672B;&#x7684;&#x65E9;&#x4E0A;&#x4E5F;&#x4F1A;&#x8BA9;&#x81EA;&#x5DF1;&#x591A;&#x7761;&#x4E00;&#x4E9B;&#xFF08;&#x56E0;&#x4E3A;&#x5DE5;&#x4F5C;&#x65E5;&#x7684;&#x7761;&#x7720;&#x65F6;&#x957F;&#x4E0D;&#x8DB3;&#xFF09;&#xFF0C;&#x867D;&#x7136;&#x7ECF;&#x5E38;&#x56E0;&#x4E3A;&#x751F;&#x7269;&#x949F;&#x7684;&#x539F;&#x56E0;&#x5728;&#x5468;&#x672B;&#x4E5F;&#x4F1A;&#x65E9;&#x65E9;&#x9192;&#x6765;&#x3002;</p><p>&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#x4E45;&#x8FDD;&#x5730;&#x9700;&#x8981;&#x5728; 9 &#x70B9;&#x51C6;&#x65F6;&#x6253;&#x5361;&#xFF0C;&#x800C;&#x6211;&#x7684;&#x5355;&#x7A0B;&#x901A;&#x52E4;&#x65F6;&#x95F4;&#x957F;&#x8FBE;&#x4E00;&#x5C0F;&#x65F6;&#xFF0C;&#x4E0D;&#x80FD;&#x50CF;&#x4EE5;&#x524D;&#x90A3;&#x6837;&#x8E29;&#x70B9;&#x6253;&#x5361;&#xFF0C;&#x65E9;&#x4E0A;&#x4E0D;&#x7559;&#x8DB3;&#x591F;&#x7684;&#x5197;&#x4F59;&#x65F6;&#x95F4;&#x7684;&#x8BDD;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x56E0;&#x4E3A;&#x610F;&#x5916;&#x4E8B;&#x4EF6;&#x8FDF;&#x5230;&#x3002;&#x7ECF;&#x8FC7;&#x591A;&#x6B21;&#x7684;&#x8BD5;&#x9A8C;&#x8C03;&#x6574;&#xFF0C;&#x6700;&#x7EC8;&#x628A;&#x5E38;&#x89C4;&#x7684;&#x8D77;&#x5E8A;&#x65F6;&#x95F4;&#x8BBE;&#x5B9A;&#x4E3A;6:30&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4FDD;&#x969C;&#x5728;7:10&#x5206;&#x5DE6;&#x53F3;&#x51FA;&#x95E8;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x8981;&#x8FD9;&#x4E48;&#x65E9;&#xFF0C;&#x9664;&#x4E86;&#x8981;&#x4FDD;&#x7559;&#x8DB3;&#x591F;&#x7684;&#x7F13;&#x51B2;&#x65F6;&#x95F4;&#x4E4B;&#x5916;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x518D;&#x665A;&#x4E00;&#x4E9B;&#x51FA;&#x95E8;&#xFF0C;&#x6BD4;&#x5982;&#x5230;&#x4E03;&#x70B9;&#x534A;&#xFF0C;&#x5730;&#x94C1;&#x91CC;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x62E5;&#x6324;&#x3002;&#x5982;&#x6B64;&#x62E5;&#x6324;&#x7684;&#x53C8;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x901A;&#x52E4;&#x4E0D;&#x662F;&#x5F88;&#x5229;&#x4E8E;&#x6211;&#x7684;&#x7CBE;&#x795E;&#x5065;&#x5EB7;&#x3002;</p><p>&#x6B64;&#x5916;&#xFF0C;&#x65E9;&#x70B9;&#x5230;&#x529E;&#x516C;&#x5BA4;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x6BB5;&#x65E0;&#x4EBA;&#x6253;&#x6270;&#x7684;&#x505A;&#x4E8B;&#x65F6;&#x95F4;&#xFF0C;&#x4EE5;&#x53CA;&#x6D17;&#x6C34;&#x676F;&#x4EC0;&#x4E48;&#x7684;&#x4E0D;&#x7528;&#x6392;&#x961F;&#xFF0C;&#x603B;&#x4E4B;&#x597D;&#x5904;&#x591A;&#x591A;&#x3002;</p><h2 id="&#x7761;&#x7720;&#x7F3A;&#x4E4F;"><a href="#&#x7761;&#x7720;&#x7F3A;&#x4E4F;" class="headerlink" title="&#x7761;&#x7720;&#x7F3A;&#x4E4F;"></a>&#x7761;&#x7720;&#x7F3A;&#x4E4F;</h2><p>&#x7136;&#x800C;&#xFF0C;&#x51E1;&#x4E8B;&#x7686;&#x6709;&#x4EE3;&#x4EF7;&#x3002;&#x6211;&#x5E76;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6BCF;&#x5929;&#x90FD;&#x5728;23&#x70B9;&#x4E4B;&#x524D;&#x4E0A;&#x5E8A;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#xFF0C;&#x800C;&#x5373;&#x4F7F;&#x80FD;&#x51C6;&#x65F6;&#x4E0A;&#x5E8A;&#xFF0C;&#x771F;&#x6B63;&#x5165;&#x7761;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x5F88;&#x53EF;&#x80FD;&#x5728;0&#x70B9;&#x524D;&#x540E;&#x4E86;&#x3002;&#x52A0;&#x4E0A;&#x6211;&#x7684;&#x7761;&#x7720;&#x8D28;&#x91CF;&#x4E0D;&#x4F73;&#xFF0C;&#x624B;&#x8868;&#x51E0;&#x4E4E;&#x6BCF;&#x5929;&#x90FD;&#x80FD;&#x8BB0;&#x5F55;&#x5230;&#x591C;&#x95F4;&#x9891;&#x7E41;&#x9192;&#x6765;&#xFF0C;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x65E9;&#x4E0A;&#x516D;&#x70B9;&#x534A;&#x8D77;&#x5E8A;&#x7684;&#x8BDD;&#x603B;&#x7761;&#x7720;&#x65F6;&#x95F4;&#x7ECF;&#x5E38;&#x4E0D;&#x8DB3;&#x516D;&#x5C0F;&#x65F6;&#xFF0C;&#x8FD9;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x663E;&#x7136;&#x4E0D;&#x591F;&#x3002;</p><p>&#x52A0;&#x4E0A;&#x6211;&#x4E2D;&#x5348;&#x4E5F;&#x7A81;&#x7136;&#x5B8C;&#x5168;&#x65E0;&#x6CD5;&#x7761;&#x7740;&#x4E86;&#x3002;&#x521A;&#x5F00;&#x59CB;&#x6765;&#x8FD9;&#x91CC;&#x4E0A;&#x73ED;&#x7684;&#x4E0D;&#x5230;&#x4E00;&#x4E2A;&#x6708;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x4E2D;&#x5348;&#x662F;&#x53EF;&#x4EE5;&#x772F;&#x51E0;&#x5206;&#x949F;&#x7684;&#xFF0C;&#x4F46;&#x4E0D;&#x77E5;&#x4E3A;&#x4F55;&#x7A81;&#x7136;&#x5C31;&#x7761;&#x4E0D;&#x7740;&#x4E86;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x4E0B;&#x5348;&#x7684;&#x7CBE;&#x529B;&#x6211;&#x5076;&#x5C14;&#x4F1A;&#x8DDF;&#x7740; Andrew Huberman &#x7684;&#x89C6;&#x9891;&#x505A;&#x5341;&#x5206;&#x949F;&#x7684; NSDR&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x80FD;&#x7ACB;&#x5373;&#x6062;&#x590D;&#x7CBE;&#x529B;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x65E0;&#x6548;&#x3002;</p><p>&#x957F;&#x671F;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x7684;&#x7CBE;&#x529B;&#x53D8;&#x5F97;&#x5F88;&#x5DEE;&#xFF0C;&#x6BCF;&#x5929;&#x4EC5;&#x6709;&#x4E00;&#x5C0F;&#x6BB5;&#x65F6;&#x95F4;&#x4F1A;&#x611F;&#x89C9;&#x5F88;&#x6E05;&#x9192;&#xFF0C;&#x7136;&#x540E;&#x5468;&#x672B;&#x4E5F;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x7CBE;&#x529B;&#x51FA;&#x53BB;&#x73A9;&#xFF0C;&#x53EA;&#x80FD;&#x5728;&#x5BB6;&#x8EBA;&#x7740;&#x4F11;&#x606F;&#xFF0C;&#x4F46;&#x4E5F;&#x4F11;&#x606F;&#x4E0D;&#x8FC7;&#x6765;&#x3002;</p><h2 id="&#x5C1D;&#x8BD5;&#x6539;&#x53D8;&#x4E00;&#x4E0B;"><a href="#&#x5C1D;&#x8BD5;&#x6539;&#x53D8;&#x4E00;&#x4E0B;" class="headerlink" title="&#x5C1D;&#x8BD5;&#x6539;&#x53D8;&#x4E00;&#x4E0B;"></a>&#x5C1D;&#x8BD5;&#x6539;&#x53D8;&#x4E00;&#x4E0B;</h2><p>&#x957F;&#x671F;&#x5982;&#x6B64;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x53EF;&#x6301;&#x7EED;&#x7684;&#xFF0C;&#x4F1A;&#x5BF9;&#x8EAB;&#x5FC3;&#x5065;&#x5EB7;&#x5E26;&#x6765;&#x4E25;&#x91CD;&#x7684;&#x4F24;&#x5BB3;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x51B3;&#x5B9A;&#x5BF9;&#x751F;&#x6D3B;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x8C03;&#x6574;&#xFF0C;&#x89C2;&#x5BDF;&#x54EA;&#x4E9B;&#x884C;&#x4E3A;&#x80FD;&#x5E26;&#x6765;&#x597D;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x3002;</p><p>&#x6211;&#x7684;&#x601D;&#x8DEF;&#x662F;&#xFF0C;&#x65E2;&#x7136;&#x521A;&#x6765;&#x4E0A;&#x73ED;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x7CBE;&#x795E;&#x72B6;&#x6001;&#x4E0D;&#x9519;&#xFF0C;&#x90A3;&#x5C31;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x540E;&#x6765;&#x751F;&#x6D3B;&#x4E60;&#x60EF;&#x6709;&#x4E86;&#x54EA;&#x4E9B;&#x6539;&#x53D8;&#xFF0C;&#x628A;&#x6539;&#x4E86;&#x7684;&#x518D;&#x6539;&#x56DE;&#x53BB;&#x8BD5;&#x8BD5;&#x3002;</p><p>&#x76EE;&#x524D;&#x60F3;&#x5230;&#x7684;&#x6539;&#x53D8;&#x6709;&#x4E24;&#x6761;&#x3002;</p><p>1&#x3001;&#x5348;&#x9910;</p><p>&#x81EA;&#x4ECE;23&#x5E74;&#x4EE5;&#x6765;&#x6211;&#x517B;&#x6210;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x5403;&#x5348;&#x996D;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x53EA;&#x6709;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x6BD4;&#x5982;&#x65C5;&#x6E38;&#x3001;&#x805A;&#x9910;&#x3001;&#x966A;&#x5BB6;&#x4EBA;&#x624D;&#x4F1A;&#x5403;&#x5348;&#x996D;&#x3002;&#x4F46;&#x662F;&#x81EA;&#x6253;&#x4E2D;&#x5348;&#x53BB;&#x5065;&#x8EAB;&#x623F;&#x953B;&#x70BC;&#x4EE5;&#x6765;&#xFF0C;&#x6211;&#x53C8;&#x5F00;&#x59CB;&#x5403;&#x5348;&#x996D;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x953B;&#x70BC;&#x5B8C;&#x4E0D;&#x5403;&#x6709;&#x65F6;&#x4F1A;&#x6BD4;&#x8F83;&#x997F;&#xFF0C;&#x5F71;&#x54CD;&#x4E0B;&#x5348;&#x7684;&#x72B6;&#x6001;&#x3002;</p><p>&#x53E6;&#x5916;&#xFF0C;&#x7531;&#x4E8E;&#x8FD1;&#x671F;&#x7F3A;&#x4E4F;&#x7761;&#x7720;&#xFF0C;&#x6709;&#x65F6;&#x5373;&#x4F7F;&#x4E0D;&#x53BB;&#x953B;&#x70BC;&#xFF0C;&#x4E5F;&#x4F1A;&#x503E;&#x5411;&#x4E8E;&#x5403;&#x70B9;&#x4E1C;&#x897F;&#xFF0C;&#x4EE5;&#x5E2E;&#x52A9;&#x4E2D;&#x5348;&#x5165;&#x7761;&#xFF0C;&#x867D;&#x7136;&#x4E5F;&#x5E76;&#x65E0;&#x6548;&#x679C;&#x3002;</p><p>&#x6211;&#x901A;&#x5E38;&#x4F1A;&#x9009;&#x90A3;&#x79CD;&#x4FBF;&#x5B9C;&#x7684;&#x4E2D;&#x5F0F;&#x81EA;&#x9009;&#x5FEB;&#x9910;&#x5E97;&#xFF0C;&#x4FBF;&#x5B9C;&#x91CF;&#x5927;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x7528;&#x7684;&#x539F;&#x6750;&#x6599;&#x5E76;&#x4E0D;&#x5065;&#x5EB7;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x5BF9;&#x5065;&#x5EB7;&#x6709;&#x4E0D;&#x5229;&#x5F71;&#x54CD;&#x4ECE;&#x800C;&#x5F71;&#x54CD;&#x7761;&#x7720;&#x3002;</p><p>&#x51B3;&#x5B9A;&#x4E0D;&#x5403;&#x5348;&#x996D;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4F8B;&#x5916;&#x60C5;&#x51B5;&#x8981;&#x5403;&#x7684;&#x8BDD;&#xFF0C;&#x53BB;&#x9009;&#x62E9;&#x770B;&#x4E0A;&#x53BB;&#x5E72;&#x51C0;&#x4E00;&#x4E9B;&#x7684;&#x5E97;&#x3002;</p><p>2&#x3001;&#x8865;&#x5242;</p><p>&#x7531;&#x4E8E;&#x773C;&#x775B;&#x4E0D;&#x8212;&#x670D;&#xFF0C;&#x524D;&#x9762;&#x6709;&#x6BB5;&#x65F6;&#x95F4;&#x6211;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x5403;&#x53F6;&#x9EC4;&#x7D20;&#xFF0C;&#x987A;&#x4FBF;&#x4E5F;&#x5403;&#x4E00;&#x4E9B;&#x522B;&#x7684;&#x8865;&#x5242;&#xFF0C;&#x5982;&#x590D;&#x5408;&#x7EF4;&#x751F;&#x7D20;&#x3001;&#x9C7C;&#x6CB9;&#x3001;&#x9499;&#x7247;&#x7B49;&#x3002;&#x6700;&#x8FD1;&#x5FD8;&#x8BB0;&#x5403;&#x4E86;&#xFF0C;&#x6216;&#x8BB8;&#x8EAB;&#x4F53;&#x7F3A;&#x4E4F;&#x67D0;&#x79CD;&#x8425;&#x517B;&#x5143;&#x7D20;&#x800C;&#x5BFC;&#x81F4;&#x7CBE;&#x529B;&#x4E0D;&#x4F73;&#x3002;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x8BBE;&#x5B9A;&#x4E86;&#x6BCF;&#x65E5;&#x7528;&#x836F;&#x63D0;&#x9192;&#xFF0C;&#x540E;&#x9762;&#x6062;&#x590D;&#x5403;&#x8865;&#x5242;&#x3002;</p><p>&#x6211;&#x5E76;&#x4E0D;&#x6E05;&#x695A;&#x4E0A;&#x9762;&#x8FD9;&#x4E24;&#x6761;&#x8DDF;&#x7761;&#x7720;&#x6709;&#x65E0;&#x5173;&#x7CFB;&#xFF0C;&#x603B;&#x4E4B;&#x5148;&#x8BD5;&#x8BD5;&#xFF0C;&#x4E0D;&#x7BA1;&#x6709;&#x65E0;&#x5173;&#x7CFB;&#x603B;&#x5F52;&#x5BF9;&#x8EAB;&#x4F53;&#x662F;&#x6709;&#x597D;&#x5904;&#x7684;&#x3002;</p><p>&#x540E;&#x9762;&#x4F1A;&#x89C2;&#x5BDF;&#x7761;&#x7720;&#x60C5;&#x51B5;&#xFF0C;&#x4E5F;&#x4F1A;&#x5C1D;&#x8BD5;&#x8C03;&#x8282;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x5728;&#x8FD9;&#x91CC;&#x5B9A;&#x671F;&#x8BB0;&#x5F55;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x81EA;&amp;#x544A;&amp;#x522B;&amp;#x9AD8;&amp;#x4E2D;&amp;#x5C01;&amp;#x95ED;&amp;#x5F0F;&amp;#x7BA1;&amp;#x7406;&amp;#x7684;&amp;#x96C6;&amp;#x4F53;&amp;#x751F;&amp;#x6D3B;&amp;#x540E;&amp;#xFF0C;&amp;#x6211;&amp;#x5C31;&amp;#x518D;&amp;#x4E5F;&amp;#x6CA1;&amp;#x80FD;&amp;#x591F;&amp;#x65E0;&amp;#x75DB;&amp;#x65E9;&amp;#x7761;&amp;#x65E9;&amp;#x8D77;&amp;#x8FC7;&amp;#x3002;&amp;#x5C3D;&amp;#x7BA1;&amp;#x6709;&amp;#x8FC7;&amp;#x8BB8;&amp;#x591A;&amp;#x6B21;&amp;#x4E0B;&amp;#x5B9A;&amp;#x51B3;&amp;#x5FC3;&amp;#x8981;&amp;#x6210;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;&amp;#x6668;&amp;#x578B;&amp;#x4EBA;&amp;#xFF0C;&amp;#x4F46;&amp;#x5C1D;&amp;#x8BD5;&amp;#x591A;&amp;#x6B21;&amp;#x5747;&amp;#x5DF2;&amp;#x5931;&amp;#x8D25;&amp;#x544A;&amp;#x7EC8;&amp;#xFF0C;&amp;#x5E76;&amp;#x56E0;&amp;#x6B64;&amp;#x7ECF;&amp;#x5E38;&amp;#x8D23;&amp;#x5907;&amp;#x81EA;&amp;#x5DF1;&amp;#x3002;&amp;#x76F4;&amp;#x5230;&amp;#x770B;&amp;#x51FA;&amp;#x7761;&amp;#x7720;&amp;#x7814;&amp;#x7A76;&amp;#x9886;&amp;#x57DF;&amp;#x7684;&amp;#x4E13;&amp;#x5BB6; &lt;em&gt;Matthew Walker&lt;/em&gt; &amp;#x7684;&amp;#x8457;&amp;#x4F5C; &lt;em&gt;Why We Sleep&lt;/em&gt; &amp;#x91CC;&amp;#x8C08;&amp;#x5230;&amp;#x6709;&amp;#x4E9B;&amp;#x4EBA;&amp;#x5929;&amp;#x751F;&amp;#x665A;&amp;#x7761;&amp;#x665A;&amp;#x8D77;&amp;#xFF0C;&amp;#x8FD9;&amp;#x662F;&amp;#x7531;&amp;#x57FA;&amp;#x56E0;&amp;#x51B3;&amp;#x5B9A;&amp;#x7684;&amp;#xFF0C;&amp;#x6211;&amp;#x7684;&amp;#x5FC3;&amp;#x6001;&amp;#x624D;&amp;#x7A0D;&amp;#x5FAE;&amp;#x5E73;&amp;#x548C;&amp;#x4E86;&amp;#x4E00;&amp;#x4E9B;&amp;#xFF0C;&amp;#x5728;&amp;#x7761;&amp;#x7720;&amp;#x8FD9;&amp;#x4EF6;&amp;#x4E8B;&amp;#x4E0A;&amp;#x4E0D;&amp;#x518D;&amp;#x90A3;&amp;#x4E48;&amp;#x82DB;&amp;#x8D23;&amp;#x81EA;&amp;#x5DF1;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="sleeping" scheme="https://shiqingxu.gthub.io/tags/sleeping/"/>
    
    <category term="health" scheme="https://shiqingxu.gthub.io/tags/health/"/>
    
  </entry>
  
  <entry>
    <title>再次到桂林阳朔</title>
    <link href="https://shiqingxu.gthub.io/2025/08/30/revisit-yangshuo/"/>
    <id>https://shiqingxu.gthub.io/2025/08/30/revisit-yangshuo/</id>
    <published>2025-08-30T13:50:07.000Z</published>
    <updated>2025-09-03T00:38:44.797Z</updated>
    
    <content type="html"><![CDATA[<p>&#x53BB;&#x5E74;&#x81EA;&#x9A7E;&#x65F6;&#x8DEF;&#x8FC7;&#x4E86;&#x6842;&#x6797;&#x9633;&#x6714;&#xFF0C;&#x8FD8;&#x5728;&#x6F13;&#x6C5F;&#x8FB9;&#x4E0A;&#x627E;&#x5230;&#x4E00;&#x7247;&#x5730;&#x65B9;&#x9732;&#x8425;&#x4E86;&#x4E00;&#x665A;&#x3002;&#x5F53;&#x5730;&#x6751;&#x6C11;&#x6709;&#x5728;&#x7BA1;&#x7406;&#xFF0C;&#x6BCF;&#x8F66;&#x6BCF;&#x5929;&#x6536; 20 &#x5143;&#x7BA1;&#x7406;&#x8D39;&#xFF0C;&#x63D0;&#x4F9B;&#x536B;&#x751F;&#x95F4;&#x548C;&#x57FA;&#x672C;&#x7684;&#x73AF;&#x5883;&#x7EF4;&#x62A4;&#x5DE5;&#x4F5C;&#xFF0C;&#x6574;&#x4F53;&#x6765;&#x8BF4;&#x4F53;&#x9A8C;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x3002;&#x5DE7;&#x5408;&#x7684;&#x662F;&#xFF0C;&#x4ECA;&#x5E74;&#x90E8;&#x95E8;&#x7EC4;&#x7EC7;&#x56E2;&#x5EFA;&#x6D3B;&#x52A8;&#xFF0C;&#x76EE;&#x7684;&#x5730;&#x5C31;&#x662F;&#x6842;&#x6797;&#x548C;&#x9633;&#x6714;&#x3002;</p><span id="more"></span><p>&#x66F4;&#x5DE7;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x6B21;&#x56E2;&#x5EFA;&#x884C;&#x7A0B;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x6BB5;&#x6F13;&#x6C5F;&#x6E38;&#x8239;&#x3002;&#x6211;&#x5FC3;&#x8BF4;&#x4F1A;&#x4E0D;&#x4F1A;&#x5728;&#x8239;&#x4E0A;&#x8DEF;&#x8FC7;&#x53BB;&#x5E74;&#x9732;&#x8425;&#x5730;&#x5730;&#x65B9;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x65F6;&#x80FD;&#x89C1;&#x5230;&#x5F88;&#x591A;&#x6E38;&#x8239;&#x6765;&#x6765;&#x5F80;&#x5F80;&#x3002;&#x4E8E;&#x662F;&#x627E;&#x51FA;&#x53BB;&#x5E74;&#x7684;&#x7167;&#x7247;&#x770B;&#x4E86;&#x4E0B;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#xFF0C;&#x679C;&#x7136;&#x6E38;&#x8239;&#x8DEF;&#x7EBF;&#x662F;&#x8DEF;&#x8FC7;&#x7684;&#x3002;&#x4E8E;&#x662F;&#x6574;&#x4E2A;&#x5750;&#x8239;&#x7684;&#x884C;&#x7A0B;&#x5C31;&#x591A;&#x4E86;&#x4E00;&#x5206;&#x671F;&#x5F85;&#xFF0C;&#x671F;&#x5F85;&#x4ECE;&#x8239;&#x4E0A;&#x770B;&#x4E00;&#x773C;&#x8FD9;&#x4E2A;&#x7559;&#x4E0B;&#x4E86;&#x7F8E;&#x597D;&#x56DE;&#x5FC6;&#x7684;&#x5730;&#x65B9;&#x3002;</p><p>&#x884C;&#x8239;&#x65F6;&#x95F4;&#x5F88;&#x6F2B;&#x957F;&#xFF0C;&#x6709;&#x4E09;&#x56DB;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x9732;&#x8425;&#x5730;&#x5728;&#x63A5;&#x8FD1;&#x8DEF;&#x7EBF;&#x7EC8;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5FEB;&#x5230;&#x8FBE;&#x65F6;&#x6211;&#x4E0D;&#x505C;&#x67E5;&#x770B;&#x624B;&#x673A;&#x5B9A;&#x4F4D;&#xFF0C;&#x4EE5;&#x9632;&#x9519;&#x8FC7;&#x3002;&#x5FEB; 12 &#x70B9;&#x65F6;&#x8239;&#x4E0A;&#x5F00;&#x996D;&#xFF0C;&#x6070;&#x597D;&#x4E5F;&#x5FEB;&#x5230;&#x4F4D;&#x7F6E;&#x4E86;&#xFF0C;&#x6211;&#x6839;&#x636E;&#x8239;&#x7684;&#x901F;&#x5EA6;&#x4F30;&#x8BA1;&#x5FEB;&#x901F;&#x4E00;&#x70B9;&#x7684;&#x8BDD;&#x662F;&#x53EF;&#x4EE5;&#x5403;&#x5B8C;&#x996D;&#x8FD8;&#x80FD;&#x8D76;&#x4E0A;&#x53BB;&#x770B;&#x7684;&#xFF0C;&#x4E8E;&#x662F;&#x6392;&#x961F;&#x53D6;&#x9910;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4E94;&#x516D;&#x5206;&#x949F;&#x4E4B;&#x5185;&#x8FC5;&#x901F;&#x5403;&#x5B8C;&#x3002;</p><p>&#x7136;&#x540E;&#x7ACB;&#x5373;&#x722C;&#x4E0A;&#x7532;&#x677F;&#xFF0C;&#x7531;&#x4E8E;&#x662F;&#x4E2D;&#x5348;&#xFF0C;&#x70C8;&#x65E5;&#x5F53;&#x7A7A;&#xFF0C;&#x52A0;&#x4E0A;&#x5927;&#x5BB6;&#x90FD;&#x521A;&#x5403;&#x5B8C;&#x996D;&#xFF0C;&#x7532;&#x677F;&#x4E0A;&#x5DF2;&#x7ECF;&#x7A7A;&#x65E0;&#x4E00;&#x4EBA;&#x4E86;&#xFF0C;&#x72EC;&#x4EAB;&#x6574;&#x4E2A;&#x7532;&#x677F;&#x3002;&#x722C;&#x4E0A;&#x53BB;&#x662F;&#x5DF2;&#x7ECF;&#x80FD;&#x8FDC;&#x8FDC;&#x770B;&#x5230;&#x53BB;&#x5E74;&#x7684;&#x9732;&#x8425;&#x5730;&#x4E86;&#x3002;</p><p>&#x6FC0;&#x52A8;&#x4E4B;&#x5FC3;&#x6EA2;&#x4E8E;&#x8A00;&#x8868;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x8FD9;&#x4E48;&#x5FEB;&#x5C31;&#x6545;&#x5730;&#x91CD;&#x6E38;&#x3002;&#x800C;&#x4E14;&#x662F;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x770B;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x3002;</p><p>&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x6B64;&#x70ED;&#x7684;&#x5929;&#x6C14;&#xFF0C;&#x5C45;&#x7136;&#x8FD8;&#x6709;&#x4E24;&#x9876;&#x5E10;&#x7BF7;&#x624E;&#x5728;&#x90A3;&#x91CC;&#x3002;</p><h2 id="&#x53BB;&#x5E74;&#x7684;&#x9732;&#x8425;&#x89C6;&#x89D2;"><a href="#&#x53BB;&#x5E74;&#x7684;&#x9732;&#x8425;&#x89C6;&#x89D2;" class="headerlink" title="&#x53BB;&#x5E74;&#x7684;&#x9732;&#x8425;&#x89C6;&#x89D2;"></a>&#x53BB;&#x5E74;&#x7684;&#x9732;&#x8425;&#x89C6;&#x89D2;</h2><p><img src="/2025/08/30/revisit-yangshuo/camper.jpg" alt="&#x751F;&#x706B;&#x505A;&#x996D;"></p><p><img src="/2025/08/30/revisit-yangshuo/fire_stoker.jpg"></p><h2 id="&#x4ECA;&#x5E74;&#x7684;&#x6E38;&#x8239;&#x89C6;&#x89D2;"><a href="#&#x4ECA;&#x5E74;&#x7684;&#x6E38;&#x8239;&#x89C6;&#x89D2;" class="headerlink" title="&#x4ECA;&#x5E74;&#x7684;&#x6E38;&#x8239;&#x89C6;&#x89D2;"></a>&#x4ECA;&#x5E74;&#x7684;&#x6E38;&#x8239;&#x89C6;&#x89D2;</h2><p><img src="/2025/08/30/revisit-yangshuo/IMG_1029.jpg"></p><p><img src="/2025/08/30/revisit-yangshuo/IDG_20250830_115110_726.JPG" alt="&#x70C8;&#x65E5;&#x4E0B;&#x7684;&#x5E10;&#x7BF7;"></p><p><img src="/2025/08/30/revisit-yangshuo/IDG_20250830_115023_773.JPG" alt="&#x53BB;&#x5E74;&#xFF08;&#x53EF;&#x80FD;&#xFF09;&#x7528;&#x8FC7;&#x7684;&#x5783;&#x573E;&#x6876;"></p><p>&#x6F13;&#x6C5F;&#x5F88;&#x7F8E;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x673A;&#x4F1A;&#xFF0C;&#x8FD8;&#x613F;&#x610F;&#x5230;&#x8FD9;&#x91CC;&#x6765;&#x9732;&#x8425;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x53BB;&amp;#x5E74;&amp;#x81EA;&amp;#x9A7E;&amp;#x65F6;&amp;#x8DEF;&amp;#x8FC7;&amp;#x4E86;&amp;#x6842;&amp;#x6797;&amp;#x9633;&amp;#x6714;&amp;#xFF0C;&amp;#x8FD8;&amp;#x5728;&amp;#x6F13;&amp;#x6C5F;&amp;#x8FB9;&amp;#x4E0A;&amp;#x627E;&amp;#x5230;&amp;#x4E00;&amp;#x7247;&amp;#x5730;&amp;#x65B9;&amp;#x9732;&amp;#x8425;&amp;#x4E86;&amp;#x4E00;&amp;#x665A;&amp;#x3002;&amp;#x5F53;&amp;#x5730;&amp;#x6751;&amp;#x6C11;&amp;#x6709;&amp;#x5728;&amp;#x7BA1;&amp;#x7406;&amp;#xFF0C;&amp;#x6BCF;&amp;#x8F66;&amp;#x6BCF;&amp;#x5929;&amp;#x6536; 20 &amp;#x5143;&amp;#x7BA1;&amp;#x7406;&amp;#x8D39;&amp;#xFF0C;&amp;#x63D0;&amp;#x4F9B;&amp;#x536B;&amp;#x751F;&amp;#x95F4;&amp;#x548C;&amp;#x57FA;&amp;#x672C;&amp;#x7684;&amp;#x73AF;&amp;#x5883;&amp;#x7EF4;&amp;#x62A4;&amp;#x5DE5;&amp;#x4F5C;&amp;#xFF0C;&amp;#x6574;&amp;#x4F53;&amp;#x6765;&amp;#x8BF4;&amp;#x4F53;&amp;#x9A8C;&amp;#x975E;&amp;#x5E38;&amp;#x4E0D;&amp;#x9519;&amp;#x3002;&amp;#x5DE7;&amp;#x5408;&amp;#x7684;&amp;#x662F;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5E74;&amp;#x90E8;&amp;#x95E8;&amp;#x7EC4;&amp;#x7EC7;&amp;#x56E2;&amp;#x5EFA;&amp;#x6D3B;&amp;#x52A8;&amp;#xFF0C;&amp;#x76EE;&amp;#x7684;&amp;#x5730;&amp;#x5C31;&amp;#x662F;&amp;#x6842;&amp;#x6797;&amp;#x548C;&amp;#x9633;&amp;#x6714;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="travel" scheme="https://shiqingxu.gthub.io/tags/travel/"/>
    
  </entry>
  
  <entry>
    <title>关闭 WPS 的稻壳儿自动启动</title>
    <link href="https://shiqingxu.gthub.io/2025/08/29/kill-wps-docer-autorun/"/>
    <id>https://shiqingxu.gthub.io/2025/08/29/kill-wps-docer-autorun/</id>
    <published>2025-08-29T14:24:57.000Z</published>
    <updated>2025-09-03T00:38:44.782Z</updated>
    
    <content type="html"><![CDATA[<p>&#x524D;&#x51E0;&#x5929;&#x8C08;&#x5230;&#x5F00;&#x59CB;&#x4F7F;&#x7528;<a href="https://xushiqing.xyz/2025/08/25/useing-wps-and-wetype/">&#x56FD;&#x4EA7;&#x8F6F;&#x4EF6; WPS</a>&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x8FD9;&#x8F6F;&#x4EF6;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x6076;&#x5FC3;&#x7684;&#x884C;&#x4E3A;&#x9700;&#x8981;&#x514B;&#x670D;&#x3002;</p><span id="more"></span><p>&#x5F00;&#x59CB;&#x4F7F;&#x7528; WPS &#x4E4B;&#x540E;&#x5728;&#x591A;&#x53F0;&#x8BBE;&#x5907;&#x4E0A;&#x90FD;&#x5B89;&#x88C5;&#x4E86;&#x5B83;&#xFF0C;&#x5305;&#x62EC;&#x516C;&#x53F8;&#x7684;&#x7535;&#x8111;&#x548C;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x51E0;&#x53F0;&#x7535;&#x8111;&#xFF0C;&#x4F46;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x516C;&#x53F8;&#x7535;&#x8111;&#x4E0A;&#x4F7F;&#x7528;&#x3002;&#x6BCF;&#x6B21;&#x6253;&#x5F00;&#x8F6F;&#x4EF6;&#x4E4B;&#x540E;&#x90FD;&#x4F1A;&#x81EA;&#x52A8;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x53EB;&#x7A3B;&#x58F3;&#x513F;&#x7684;&#x6807;&#x7B7E;&#x9875;&#xFF0C;&#x63A8;&#x5E7F;&#x4ED6;&#x4EEC;&#x7684;&#x7D20;&#x6750;&#x5E93;&#xFF0C;&#x6211;&#x627E;&#x4E86;&#x65E0;&#x6570;&#x6B21;&#x5173;&#x95ED;&#x8FD9;&#x4E2A;&#x81EA;&#x52A8;&#x542F;&#x52A8;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x5374;&#x59CB;&#x7EC8;&#x627E;&#x4E0D;&#x5230;&#x3002;&#x751A;&#x81F3;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x6210;&#x4E3A;&#x4E86;&#x6211;&#x4E0D;&#x60F3;&#x6253;&#x5F00;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x7684;&#x91CD;&#x8981;&#x539F;&#x56E0;&#xFF0C;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x8BBE;&#x5907;&#x4E0A;&#x8FD8;&#x662F;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x4E0E;&#x5FAE;&#x8F6F;&#x7684; office365&#x3002;</p><p>&#x76F4;&#x5230;&#x6709;&#x4E00;&#x6B21;&#x5076;&#x7136;&#x53D1;&#x73B0;&#x53EA;&#x8981;&#x5728;&#x8FD9;&#x4E2A;&#x6807;&#x7B7E;&#x9875;&#x4E0A;&#x53F3;&#x952E;&#xFF0C;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x5173;&#x95ED;&#x81EA;&#x52A8;&#x542F;&#x52A8;&#x7684;&#x9009;&#x9879;&#x4E86;&#x3002;</p><p><img src="/2025/08/29/kill-wps-docer-autorun/kill_docer_autorun.png"></p><p>&#x7531;&#x4E8E;&#x5173;&#x95ED;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5982;&#x6B64;&#x7B80;&#x5355;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#x75DB;&#x9A82;&#x81EA;&#x5DF1;&#x600E;&#x4E48;&#x8FD9;&#x4E48;&#x50BB;&#x4E4B;&#x540E;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x3002;&#x76F4;&#x5230;&#x6700;&#x8FD1;&#x5728;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x4E0A;&#x91CD;&#x65B0;&#x5B89;&#x88C5;&#x4E86;&#x7CFB;&#x7EDF;&#xFF0C;&#x91CD;&#x65B0;&#x5B89;&#x88C5; WPS &#x4E4B;&#x540E;&#x53C8;&#x9047;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x8BB0;&#x4E0D;&#x8D77;&#x4E4B;&#x524D;&#x662F;&#x600E;&#x4E48;&#x5173;&#x95ED;&#x7684;&#xFF0C;&#x53C8;&#x627E;&#x4E86;&#x4E00;&#x9635;&#x624D;&#x627E;&#x5230;&#x5173;&#x95ED;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p><p>&#x8FD8;&#x662F;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x5427;&#xFF0C;&#x7701;&#x5F97;&#x4E4B;&#x540E;&#x53C8;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x524D;&amp;#x51E0;&amp;#x5929;&amp;#x8C08;&amp;#x5230;&amp;#x5F00;&amp;#x59CB;&amp;#x4F7F;&amp;#x7528;&lt;a href=&quot;https://xushiqing.xyz/2025/08/25/useing-wps-and-wetype/&quot;&gt;&amp;#x56FD;&amp;#x4EA7;&amp;#x8F6F;&amp;#x4EF6; WPS&lt;/a&gt;&amp;#xFF0C;&amp;#x4E0D;&amp;#x5F97;&amp;#x4E0D;&amp;#x8BF4;&amp;#x8FD9;&amp;#x8F6F;&amp;#x4EF6;&amp;#x8FD8;&amp;#x662F;&amp;#x6709;&amp;#x4E00;&amp;#x4E9B;&amp;#x975E;&amp;#x5E38;&amp;#x6076;&amp;#x5FC3;&amp;#x7684;&amp;#x884C;&amp;#x4E3A;&amp;#x9700;&amp;#x8981;&amp;#x514B;&amp;#x670D;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
  </entry>
  
  <entry>
    <title>更新 Next 主题至最新版</title>
    <link href="https://shiqingxu.gthub.io/2025/08/28/update-hexo-theme-next/"/>
    <id>https://shiqingxu.gthub.io/2025/08/28/update-hexo-theme-next/</id>
    <published>2025-08-28T02:33:32.000Z</published>
    <updated>2025-09-03T00:38:44.960Z</updated>
    
    <content type="html"><![CDATA[<p>&#x5728;&#x8FD9;&#x4E2A; Hexo &#x535A;&#x5BA2;&#x4E0A;&#x7528;&#x7684;&#x662F;&#x6D41;&#x884C;&#x7684; Next &#x4E3B;&#x9898;&#xFF0C;&#x5076;&#x7136;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x4F9D;&#x7136;&#x5728;&#x66F4;&#x65B0;&#xFF0C;&#x800C;&#x6211;&#x7528;&#x7684;&#x8FD8;&#x662F;&#x597D;&#x51E0;&#x5E74;&#x524D;&#x7684;&#x7248;&#x672C;&#x3002;&#x867D;&#x6CA1;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#xFF0C;&#x4E5F;&#x6CA1;&#x5173;&#x6CE8;&#x66F4;&#x65B0;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x4E0D;&#x8FC7;&#x672C;&#x7740;&#x7528;&#x65B0;&#x4E0D;&#x7528;&#x65E7;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x8FD8;&#x662F;&#x51B3;&#x5B9A;&#x66F4;&#x65B0;&#x5230;&#x6700;&#x65B0;&#x7248;&#x3002;</p><span id="more"></span><p>&#x66F4;&#x65B0;&#x4E3B;&#x9898;&#x5927;&#x4F53;&#x4E0A;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x901A;&#x8FC7; npm &#x66F4;&#x65B0;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x901A;&#x8FC7; Git &#x6765;&#x66F4;&#x65B0;&#xFF0C;&#x5177;&#x4F53;&#x7528;&#x54EA;&#x79CD;&#x65B9;&#x6CD5;&#x53D6;&#x51B3;&#x4E8E;&#x5F53;&#x521D;&#x5B89;&#x88C5;&#x65F6;&#x662F;&#x7528;&#x7684; npm &#x8FD8;&#x662F;Git&#x3002;</p><h2 id="&#x901A;&#x8FC7;-npm-&#x66F4;&#x65B0;"><a href="#&#x901A;&#x8FC7;-npm-&#x66F4;&#x65B0;" class="headerlink" title="&#x901A;&#x8FC7; npm &#x66F4;&#x65B0;"></a>&#x901A;&#x8FC7; npm &#x66F4;&#x65B0;</h2><p><strong>&#x8FDB;&#x5165; Hexo &#x535A;&#x5BA2;&#x6839;&#x76EE;&#x5F55;</strong>&#xFF1A;&#x6253;&#x5F00;&#x7EC8;&#x7AEF;&#xFF0C;&#x5E76;&#x5207;&#x6362;&#x5230; Hexo &#x9879;&#x76EE;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x3002;</p><p><strong>&#x66F4;&#x65B0;&#x4E3B;&#x9898;&#x5305;</strong>&#xFF1A;&#x6267;&#x884C;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#xFF0C;&#x5C06; <code>hexo-theme-next</code> &#x5305;&#x66F4;&#x65B0;&#x5230;&#x6700;&#x65B0;&#x7248;&#x672C;&#xFF1A;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">npm install hexo-theme-next@latest</span><br></pre></td></tr></table></figure><p><strong>&#x6E05;&#x7406;&#x5E76;&#x91CD;&#x65B0;&#x751F;&#x6210;</strong>&#xFF1A;&#x66F4;&#x65B0;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x6700;&#x597D;&#x6E05;&#x7406;&#x4E00;&#x4E0B;&#x65E7;&#x7684;&#x7F13;&#x5B58;&#x548C;&#x751F;&#x6210;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x7F51;&#x7AD9;&#xFF1A;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">hexo clean</span><br><span class="line">hexo g</span><br></pre></td></tr></table></figure><p><strong>&#x9884;&#x89C8;&#x7F51;&#x7AD9;</strong>&#xFF1A;&#x542F;&#x52A8;&#x672C;&#x5730; Hexo &#x670D;&#x52A1;&#x5668;&#x6765;&#x9884;&#x89C8;&#x66F4;&#x6539;&#xFF0C;&#x786E;&#x4FDD;&#x4E00;&#x5207;&#x663E;&#x793A;&#x6B63;&#x5E38;&#xFF1A;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">hexo s</span><br></pre></td></tr></table></figure><p>&#x6253;&#x5F00;&#x6D4F;&#x89C8;&#x5668;&#x5E76;&#x8BBF;&#x95EE; <code>http://localhost:4000</code> &#x6765;&#x68C0;&#x67E5;&#x6548;&#x679C;&#x3002;</p><h2 id="&#x901A;&#x8FC7;git&#x66F4;&#x65B0;"><a href="#&#x901A;&#x8FC7;git&#x66F4;&#x65B0;" class="headerlink" title="&#x901A;&#x8FC7;git&#x66F4;&#x65B0;"></a>&#x901A;&#x8FC7;git&#x66F4;&#x65B0;</h2><p>&#x5982;&#x679C;&#x5F53;&#x521D;&#x662F;&#x4ECE; GitHub &#x4ED3;&#x5E93;&#x514B;&#x9686;&#xFF08;clone&#xFF09;&#x7684; NexT &#x4E3B;&#x9898;&#xFF0C;&#x66F4;&#x65B0;&#x9700;&#x8981;&#x901A;&#x8FC7; Git &#x547D;&#x4EE4;&#x6765;&#x5B8C;&#x6210;&#x3002;</p><ol><li><p><strong>&#x8FDB;&#x5165;&#x4E3B;&#x9898;&#x76EE;&#x5F55;</strong>&#xFF1A;&#x6253;&#x5F00;&#x7EC8;&#x7AEF;&#xFF0C;&#x8FDB;&#x5165; Hexo &#x535A;&#x5BA2;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x7684; <code>themes/next</code> &#x6587;&#x4EF6;&#x5939;&#x3002;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cd themes/next</span><br></pre></td></tr></table></figure></li><li><p><strong>&#x62C9;&#x53D6;&#x6700;&#x65B0;&#x66F4;&#x6539;</strong>&#xFF1A;&#x4ECE; NexT &#x7684;&#x5B98;&#x65B9;&#x4ED3;&#x5E93;&#x83B7;&#x53D6;&#x5E76;&#x5408;&#x5E76;&#x6700;&#x65B0;&#x7684;&#x66F4;&#x65B0;&#xFF1A;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">git pull</span><br></pre></td></tr></table></figure><p><strong>&#x6CE8;&#x610F;</strong>&#xFF1A;&#x5982;&#x679C;&#x66FE;&#x76F4;&#x63A5;&#x4FEE;&#x6539;&#x8FC7;&#x4E3B;&#x9898;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x5408;&#x5E76;&#x51B2;&#x7A81;&#xFF08;merge conflicts&#xFF09;&#x3002;&#x6700;&#x597D;&#x63D0;&#x524D;&#x5C06;&#x81EA;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;&#x5206;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x6B64;&#x7C7B;&#x95EE;&#x9898;&#x3002;</p></li><li><p><strong>&#x6E05;&#x7406;&#x3001;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x5E76;&#x9884;&#x89C8;</strong>&#xFF1A;&#x4E0E; npm &#x65B9;&#x6CD5;&#x7C7B;&#x4F3C;&#xFF0C;&#x5728;&#x62C9;&#x53D6;&#x66F4;&#x65B0;&#x540E;&#xFF0C;&#x56DE;&#x5230;&#x535A;&#x5BA2;&#x7684;&#x6839;&#x76EE;&#x5F55;&#x5E76;&#x8FD0;&#x884C;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#xFF1A;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">cd ../..</span><br><span class="line">hexo clean</span><br><span class="line">hexo g</span><br><span class="line">hexo s</span><br></pre></td></tr></table></figure><p>&#x7136;&#x540E;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x9884;&#x89C8;&#x6548;&#x679C;&#x3002;</p></li></ol><h2 id="&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x81EA;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;"><a href="#&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x81EA;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;" class="headerlink" title="&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x81EA;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;"></a>&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x81EA;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;</h2><p>&#x76F4;&#x63A5;&#x4FEE;&#x6539;&#x4E3B;&#x9898;&#x6587;&#x4EF6;&#x5939;&#x5185;&#x7684;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x6587;&#x4EF6; (<code>_config.yml</code>) &#x4F1A;&#x5728;&#x66F4;&#x65B0;&#x65F6;&#x5E26;&#x6765;&#x9EBB;&#x70E6;&#x3002;Next&#x5B98;&#x65B9;&#x63A8;&#x8350;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x662F;&#x4F7F;&#x7528;&#x201C;&#x5907;&#x7528;&#x4E3B;&#x9898;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x201D;&#x3002;</p><ol><li><p><strong>&#x521B;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;&#x6587;&#x4EF6;</strong>&#xFF1A;&#x5728; Hexo &#x535A;&#x5BA2;&#x7684; <strong>&#x6839;&#x76EE;&#x5F55;</strong> &#x4E0B;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>_config.next.yml</code> &#x7684;&#x65B0;&#x6587;&#x4EF6;&#x3002;</p></li><li><p><strong>&#x590D;&#x5236;&#x5E76;&#x81EA;&#x5B9A;&#x4E49;</strong>&#xFF1A;&#x5C06;&#x9700;&#x8981;&#x8986;&#x76D6;&#x7684;&#x4E3B;&#x9898;&#x914D;&#x7F6E;&#x4ECE; <code>themes/next/_config.yml</code> &#x6587;&#x4EF6;&#x4E2D;&#x590D;&#x5236;&#x5230;&#x65B0;&#x5EFA;&#x7684; <code>_config.next.yml</code> &#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x53EF;&#x4EE5;&#x5C06;&#x81EA;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;&#x4E0E;&#x4E3B;&#x9898;&#x7684;&#x6838;&#x5FC3;&#x6587;&#x4EF6;&#x5206;&#x79BB;&#x5F00;&#x3002;</p></li><li><p><strong>&#x5728;&#x4E3B;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x5F15;&#x7528;</strong>&#xFF1A;&#x5728; Hexo &#x7684;&#x4E3B;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF08;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x7684; <code>_config.yml</code>&#xFF09;&#x4E2D;&#xFF0C;&#x786E;&#x4FDD; <code>theme</code> &#x7684;&#x503C;&#x8BBE;&#x7F6E;&#x4E3A; <code>next</code>&#x3002;&#x81EA;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;&#x4F1A;&#x81EA;&#x52A8;&#x88AB;&#x52A0;&#x8F7D;&#x3002;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line"># _config.yml (&#x535A;&#x5BA2;&#x6839;&#x76EE;&#x5F55;)</span><br><span class="line">theme: next</span><br></pre></td></tr></table></figure><p>&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x66F4;&#x65B0;&#x4E3B;&#x9898;&#x540E;&#xFF0C;&#x4E2A;&#x6027;&#x5316;&#x8BBE;&#x7F6E;&#x4E5F;&#x4F1A;&#x88AB;&#x4FDD;&#x7559;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x6539;&#x52A8;&#x4E3B;&#x9898;&#x7684;&#x539F;&#x59CB;&#x6587;&#x4EF6;&#x3002;</p></li></ol><h2 id="&#x6211;&#x662F;&#x5982;&#x4F55;&#x66F4;&#x65B0;&#x7684;"><a href="#&#x6211;&#x662F;&#x5982;&#x4F55;&#x66F4;&#x65B0;&#x7684;" class="headerlink" title="&#x6211;&#x662F;&#x5982;&#x4F55;&#x66F4;&#x65B0;&#x7684;"></a>&#x6211;&#x662F;&#x5982;&#x4F55;&#x66F4;&#x65B0;&#x7684;</h2><p>&#x6211;&#x5F53;&#x521D;&#x662F;&#x901A;&#x8FC7;GitHub&#x5B89;&#x88C5;&#x7684;&#xFF0C;&#x6309;&#x7406;&#x8BF4;&#x5E94;&#x8BE5;&#x901A;&#x8FC7; Git &#x6765;&#x66F4;&#x65B0;&#x3002;&#x4F46;&#x662F;&#x6211;&#x9690;&#x7EA6;&#x8BB0;&#x5F97;&#x5B89;&#x88C5;&#x65F6;&#x7531;&#x4E8E; hexo &#x662F;&#x90E8;&#x7F72;&#x5728; GitHub Pages&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x5907;&#x4EFD;&#x5728;&#x540C;&#x6B65;&#x4E2A;&#x4ED3;&#x5E93;&#x91CC;&#x7684; main &#x5206;&#x652F;&#x4E0A;&#xFF0C;&#x800C; Next &#x4E3B;&#x9898;&#x4E5F;&#x662F;&#x901A;&#x8FC7; Git &#x5B89;&#x88C5;&#xFF0C;&#x4ED3;&#x5E93;&#x5957;&#x4ED3;&#x5E93;&#x5728;&#x5907;&#x4EFD;&#x65F6;&#x9020;&#x6210;&#x4E86;&#x4E00;&#x4E9B;&#x51B2;&#x7A81;&#xFF0C;&#x8FD8;&#x4E13;&#x95E8;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x6765;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x6015;&#x7528; Git &#x66F4;&#x65B0;&#x4F1A;&#x5E26;&#x6765;&#x95EE;&#x9898;&#x3002;</p><p>&#x6240;&#x4EE5;&#x60F3;&#x7740;&#x5E72;&#x8106;&#x91CD;&#x65B0;&#x7528; npm &#x7684;&#x65B9;&#x6CD5;&#x5B89;&#x88C5;&#x4E00;&#x904D;&#xFF0C;&#x4EE5;&#x540E;&#x7528; npm &#x66F4;&#x65B0;&#xFF0C;&#x6BD4;&#x8F83;&#x7701;&#x5FC3;&#x3002;</p><ol><li><p>&#x6309;&#x4E0A;&#x4E00;&#x7AE0;&#x8282;&#x5185;&#x5BB9;&#x5907;&#x4EFD;&#x81EA;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p></li><li><p>&#x5220;&#x9664; <strong><code>themes\next</code></strong> &#x6587;&#x4EF6;&#x5939;&#x3002;</p></li><li><p>&#x7EC8;&#x7AEF;&#x8FDB;&#x5165;&#x535A;&#x5BA2;&#x6839;&#x76EE;&#x5F55;&#xFF0C;&#x6267;&#x884C;&#x4E00;&#x4E0B;&#x547D;&#x4EE4;&#x5B89;&#x88C5;&#x6700;&#x65B0;&#x7248; Next &#x4E3B;&#x9898;&#x3002;</p><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">npm install hexo-theme-next@latest</span><br></pre></td></tr></table></figure></li></ol><p>&#x540E;&#x9762;&#x5C31;&#x662F;&#x4E00;&#x6837;&#x7684;&#x6E05;&#x7406;&#x3001;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x3001;&#x672C;&#x5730;&#x9884;&#x89C8;&#x64CD;&#x4F5C;&#x4E86;&#x3002;</p><h2 id="npm-&#x5B89;&#x88C5;&#x4E0E;-Git-&#x5B89;&#x88C5;&#x6709;&#x4F55;&#x4E0D;&#x540C;"><a href="#npm-&#x5B89;&#x88C5;&#x4E0E;-Git-&#x5B89;&#x88C5;&#x6709;&#x4F55;&#x4E0D;&#x540C;" class="headerlink" title="npm &#x5B89;&#x88C5;&#x4E0E; Git &#x5B89;&#x88C5;&#x6709;&#x4F55;&#x4E0D;&#x540C;"></a>npm &#x5B89;&#x88C5;&#x4E0E; Git &#x5B89;&#x88C5;&#x6709;&#x4F55;&#x4E0D;&#x540C;</h2><p>&#x7528; Git clone &#x5B89;&#x88C5;&#x65F6;&#xFF0C;&#x4E3B;&#x9898;&#x6587;&#x4EF6;&#x5939;&#x88AB;&#x653E;&#x5728;themes&#x6587;&#x4EF6;&#x5939;&#x4E0B;&#xFF0C;&#x662F; <strong><code>themes\next</code></strong>  &#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x7528; npm &#x5B89;&#x88C5;&#x5219;&#x662F;&#x5C06; NexT &#x4E3B;&#x9898;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7684;&#x201C;&#x7A0B;&#x5E8F;&#x5305;&#x201D;&#x6216;&#x201C;&#x4F9D;&#x8D56;&#x9879;&#x201D;&#x6765;&#x5B89;&#x88C5;&#x3002;&#x6240;&#x6709;&#x901A;&#x8FC7; npm &#x5B89;&#x88C5;&#x7684;&#x5305;&#xFF0C;&#x90FD;&#x4F1A;&#x88AB;&#x7EDF;&#x4E00;&#x5B58;&#x653E;&#x5728;&#x9879;&#x76EE;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x4E00;&#x4E2A;&#x53EB;&#x505A; <strong><code>node_modules</code></strong> &#x7684;&#x6587;&#x4EF6;&#x5939;&#x91CC;&#xFF0C;**<code>themes</code>**&#x6587;&#x4EF6;&#x5939;&#x5C31;&#x7A7A;&#x4E86;&#x3002;</p><p>&#x540E;&#x9762;&#x518D;&#x627E;&#x65F6;&#x95F4;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x8DE8;&#x8D8A;&#x597D;&#x51E0;&#x5E74;&#x7684;&#x7248;&#x672C;&#x6709;&#x4F55;&#x4E0D;&#x540C;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x65B0;&#x7684;&#x503C;&#x5F97;&#x6298;&#x817E;&#x7684;&#x5730;&#x65B9;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x5728;&amp;#x8FD9;&amp;#x4E2A; Hexo &amp;#x535A;&amp;#x5BA2;&amp;#x4E0A;&amp;#x7528;&amp;#x7684;&amp;#x662F;&amp;#x6D41;&amp;#x884C;&amp;#x7684; Next &amp;#x4E3B;&amp;#x9898;&amp;#xFF0C;&amp;#x5076;&amp;#x7136;&amp;#x770B;&amp;#x5230;&amp;#x8FD9;&amp;#x4E2A;&amp;#x9879;&amp;#x76EE;&amp;#x4F9D;&amp;#x7136;&amp;#x5728;&amp;#x66F4;&amp;#x65B0;&amp;#xFF0C;&amp;#x800C;&amp;#x6211;&amp;#x7528;&amp;#x7684;&amp;#x8FD8;&amp;#x662F;&amp;#x597D;&amp;#x51E0;&amp;#x5E74;&amp;#x524D;&amp;#x7684;&amp;#x7248;&amp;#x672C;&amp;#x3002;&amp;#x867D;&amp;#x6CA1;&amp;#x4EC0;&amp;#x4E48;&amp;#x5F71;&amp;#x54CD;&amp;#xFF0C;&amp;#x4E5F;&amp;#x6CA1;&amp;#x5173;&amp;#x6CE8;&amp;#x66F4;&amp;#x65B0;&amp;#x4E86;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8FC7;&amp;#x672C;&amp;#x7740;&amp;#x7528;&amp;#x65B0;&amp;#x4E0D;&amp;#x7528;&amp;#x65E7;&amp;#x7684;&amp;#x539F;&amp;#x5219;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x51B3;&amp;#x5B9A;&amp;#x66F4;&amp;#x65B0;&amp;#x5230;&amp;#x6700;&amp;#x65B0;&amp;#x7248;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
  </entry>
  
  <entry>
    <title>更换写字软件主题</title>
    <link href="https://shiqingxu.gthub.io/2025/08/27/changing-typora-themes/"/>
    <id>https://shiqingxu.gthub.io/2025/08/27/changing-typora-themes/</id>
    <published>2025-08-27T00:32:39.000Z</published>
    <updated>2025-09-03T00:38:44.767Z</updated>
    
    <content type="html"><![CDATA[<p>&#x6BCF;&#x6B21;&#x5728;&#x4E00;&#x53F0;&#x65B0;&#x7684;&#x6216;&#x91CD;&#x88C5;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x7535;&#x8111;&#x4E0A;&#x5B89;&#x88C5;&#x4E0E;&#x5199;&#x5B57;&#x6709;&#x5173;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;Typora&#x3001;Obsidian&#x3001;vscode&#x7B49;&#xFF0C;&#x603B;&#x514D;&#x4E0D;&#x4E86;&#x4F1A;&#x5C1D;&#x8BD5;&#x66F4;&#x6362;&#x4E00;&#x4E2A;&#x559C;&#x6B22;&#x7684;&#x4E3B;&#x9898;&#x3002;</p><p>&#x8FD1;&#x671F;&#x53D1;&#x73B0;&#x7684;&#x4E00;&#x4E2A;Typora&#x7684;&#x4E3B;&#x9898;&#x975E;&#x5E38;&#x8BA8;&#x559C;&#xFF0C;&#x53EB;&#x505A;<a href="https://github.com/linklinco/Typora-Theme-Alise">Alise</a>&#xFF0C;&#x4E8E;&#x662F;&#x4E00;&#x80A1;&#x8111;&#x628A;&#x51E0;&#x53F0;&#x8BBE;&#x5907;&#x4E0A;&#x90FD;&#x6362;&#x4E0A;&#x4E86;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x3002;</p><span id="more"></span><p>&#x5BF9;&#x4E8E;&#x5199;&#x4E2D;&#x6587;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x5E94;&#x7528;&#x7684;&#x5B57;&#x4F53;&#x975E;&#x5E38;&#x8D4F;&#x5FC3;&#x60A6;&#x76EE;&#xFF0C;&#x6574;&#x4F53;&#x8BBE;&#x8BA1;&#x4E5F;&#x633A;&#x597D;&#x770B;&#x7684;&#x3002;</p><p><img src="/2025/08/27/changing-typora-themes/Alise.png" alt="GitHub&#x4ED3;&#x5E93;&#x4E0A;&#x7684;&#x622A;&#x56FE;"></p><p>&#x4E0D;&#x8FC7;&#x7528;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x628A;&#x5DE5;&#x4F5C;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x4E3B;&#x9898;&#x6362;&#x56DE;&#x6700;&#x7B80;&#x5355;&#x7684;GitHub&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x7684;&#x989C;&#x8272;&#x548C;&#x5B57;&#x4F53;&#xFF0C;&#x5728;&#x522B;&#x4EBA;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x50CF;&#x662F;&#x5728;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x5728;&#x770B;&#x4EC0;&#x4E48;&#x7F51;&#x7EDC;&#x5C0F;&#x8BF4;&#x4E4B;&#x7C7B;&#x7684;&#x3002;</p><p>&#x4E0E;&#x4E4B;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;Obsidian&#x548C;vscode&#x5728;&#x5DE5;&#x4F5C;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x4E3B;&#x9898;&#x4E5F;&#x662F;&#x9009;&#x4E86;&#x4E2A;&#x63A5;&#x8FD1;&#x9ED8;&#x8BA4;&#x6D45;&#x8272;&#x4E3B;&#x9898;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x4F7F;&#x4E4B;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x50CF;&#x5728;&#x6478;&#x9C7C;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x6BCF;&amp;#x6B21;&amp;#x5728;&amp;#x4E00;&amp;#x53F0;&amp;#x65B0;&amp;#x7684;&amp;#x6216;&amp;#x91CD;&amp;#x88C5;&amp;#x4E86;&amp;#x7CFB;&amp;#x7EDF;&amp;#x7684;&amp;#x7535;&amp;#x8111;&amp;#x4E0A;&amp;#x5B89;&amp;#x88C5;&amp;#x4E0E;&amp;#x5199;&amp;#x5B57;&amp;#x6709;&amp;#x5173;&amp;#x7684;&amp;#x8F6F;&amp;#x4EF6;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;Typora&amp;#x3001;Obsidian&amp;#x3001;vscode&amp;#x7B49;&amp;#xFF0C;&amp;#x603B;&amp;#x514D;&amp;#x4E0D;&amp;#x4E86;&amp;#x4F1A;&amp;#x5C1D;&amp;#x8BD5;&amp;#x66F4;&amp;#x6362;&amp;#x4E00;&amp;#x4E2A;&amp;#x559C;&amp;#x6B22;&amp;#x7684;&amp;#x4E3B;&amp;#x9898;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x8FD1;&amp;#x671F;&amp;#x53D1;&amp;#x73B0;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;Typora&amp;#x7684;&amp;#x4E3B;&amp;#x9898;&amp;#x975E;&amp;#x5E38;&amp;#x8BA8;&amp;#x559C;&amp;#xFF0C;&amp;#x53EB;&amp;#x505A;&lt;a href=&quot;https://github.com/linklinco/Typora-Theme-Alise&quot;&gt;Alise&lt;/a&gt;&amp;#xFF0C;&amp;#x4E8E;&amp;#x662F;&amp;#x4E00;&amp;#x80A1;&amp;#x8111;&amp;#x628A;&amp;#x51E0;&amp;#x53F0;&amp;#x8BBE;&amp;#x5907;&amp;#x4E0A;&amp;#x90FD;&amp;#x6362;&amp;#x4E0A;&amp;#x4E86;&amp;#x8FD9;&amp;#x4E2A;&amp;#x4E3B;&amp;#x9898;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
  </entry>
  
  <entry>
    <title>把 Obsidian 当作浏览器</title>
    <link href="https://shiqingxu.gthub.io/2025/08/26/obsidian-as-a-browser/"/>
    <id>https://shiqingxu.gthub.io/2025/08/26/obsidian-as-a-browser/</id>
    <published>2025-08-26T13:05:38.000Z</published>
    <updated>2025-09-03T00:38:44.782Z</updated>
    
    <content type="html"><![CDATA[<p>&#x5076;&#x7136;&#x53D1;&#x73B0; Obsidian &#x7684; <a href="https://help.obsidian.md/plugins/web-viewer">web-viewer</a> &#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x5F53;&#x505A;&#x4E00;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x4F7F;&#x7528;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x80FD;&#x4F5C;&#x4E3A;&#x4E3B;&#x529B;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x60C5;&#x5F62;&#x4E0B;&#x4F7F;&#x7528;&#x3002;</p><p>&#x4E0E;&#x666E;&#x901A;&#x6D4F;&#x89C8;&#x5668;&#x76F8;&#x6BD4;&#xFF0C;Obsidian &#x6700;&#x5927;&#x7684;&#x7279;&#x70B9;&#x662F;&#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x4E00;&#x5207;&#x5E72;&#x6270;&#xFF0C;&#x53EA;&#x4FDD;&#x7559;&#x7F51;&#x9875;&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x3002;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x5C06;&#x7F51;&#x9875;&#x4E00;&#x952E;&#x4FDD;&#x5B58;&#x5728;&#x81EA;&#x5DF1;&#x7684; vault &#x4E2D;&#x3002;&#x5F53;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6C89;&#x6D78;&#x5F0F;&#x9605;&#x8BFB;&#x4E0E;&#x77E5;&#x8BC6;&#x6355;&#x83B7;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4E34;&#x65F6;&#x7528; Obsidian &#x6765;&#x8BBF;&#x95EE;&#x7F51;&#x9875;&#x3002;</p><span id="more"></span><p>&#x5F53;&#x7136;&#xFF0C;&#x4E0A;&#x8FF0;&#x5185;&#x5BB9;&#x90FD;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#xFF0C;&#x4E0D;&#x8FC7;&#x5B9E;&#x73B0;&#x6548;&#x679C;&#x4E0D;&#x5982;&#x76F4;&#x63A5;&#x5728; Obsidian &#x5185;&#x8BBF;&#x95EE;&#x3002;</p><p>&#x5982;&#x679C;&#x662F; Obsidian &#x6DF1;&#x5EA6;&#x7528;&#x6237;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x5B83;&#x5F88;&#x591A;&#x7528;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p><p>&#x4EE5;&#x4E0B;&#x4FE1;&#x606F;&#x7531; Gemini &#x751F;&#x6210;</p><hr><p><strong>&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4E0E;&#x4EFB;&#x52A1;&#x8DDF;&#x8E2A;&#xFF1A;</strong> &#x8BB8;&#x591A;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x9700;&#x8981;&#x9891;&#x7E41;&#x8BBF;&#x95EE;&#x7279;&#x5B9A;&#x7684;&#x7F51;&#x9875;&#x5E94;&#x7528;&#xFF08;&#x5982; Trello&#x3001;Jira&#x3001;Google Sheets&#x3001;&#x65E5;&#x5386;&#x7B49;&#xFF09;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728; Obsidian &#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x533A;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x7F51;&#x9875;&#x5D4C;&#x5165;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x9762;&#x677F;&#x4E2D;&#xFF0C;&#x4E0E;&#x4F60;&#x7684;&#x6BCF;&#x65E5;&#x8BA1;&#x5212;&#x7B14;&#x8BB0;&#x3001;&#x9879;&#x76EE;&#x7B14;&#x8BB0;&#x5E76;&#x6392;&#x663E;&#x793A;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x65E0;&#x9700;&#x6253;&#x5F00;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x6807;&#x7B7E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x754C;&#x9762;&#x4E2D;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x67E5;&#x770B;&#x3001;&#x8FDB;&#x5EA6;&#x66F4;&#x65B0;&#x548C;&#x7B14;&#x8BB0;&#x8BB0;&#x5F55;&#x3002;</p><p><strong>&#x5185;&#x5BB9;&#x521B;&#x4F5C;&#x4E0E;&#x5F15;&#x7528;&#xFF1A;</strong> &#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x5927;&#x91CF;&#x5F15;&#x7528;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x7684;&#x4F5C;&#x8005;&#x3001;&#x5B66;&#x751F;&#x6216;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;Obsidian &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x5199;&#x4F5C;&#x73AF;&#x5883;&#x3002;&#x53EF;&#x4EE5;&#x5C06;&#x5F15;&#x7528;&#x7684;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x5D4C;&#x5165;&#x5230;&#x7B14;&#x8BB0;&#x4E2D;&#xFF0C;&#x76F4;&#x63A5;&#x5728;&#x65C1;&#x8FB9;&#x8FDB;&#x884C;&#x4E8C;&#x6B21;&#x521B;&#x4F5C;&#x3001;&#x6807;&#x6CE8;&#x6216;&#x603B;&#x7ED3;&#x3002;&#x7531;&#x4E8E;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x672C;&#x5730;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x79BB;&#x7EBF;&#x72B6;&#x6001;&#x4E0B;&#x4E5F;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#x3002;</p><p><strong>&#x521B;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x4EEA;&#x8868;&#x76D8;&#xFF1A;</strong> &#x53EF;&#x4EE5;&#x5C06;&#x7ECF;&#x5E38;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x9875;&#xFF08;&#x5982;&#x6570;&#x636E;&#x770B;&#x677F;&#x3001;&#x65B0;&#x95FB;&#x6E90;&#x3001;&#x9879;&#x76EE;&#x72B6;&#x6001;&#x9875;&#x9762;&#x7B49;&#xFF09;&#x5D4C;&#x5165;&#x5230; Obsidian &#x7684; Canvas &#x6216;&#x4E3B;&#x754C;&#x9762;&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x4E2A;&#x6027;&#x5316;&#x7684;&#x4FE1;&#x606F;&#x4EEA;&#x8868;&#x76D8;&#x3002;&#x8FD9;&#x4E2A;&#x4EEA;&#x8868;&#x76D8;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5DE5;&#x4F5C;&#x4E60;&#x60EF;&#x548C;&#x9700;&#x6C42;&#x5B9A;&#x5236;&#xFF0C;&#x4E00;&#x6253;&#x5F00; Obsidian &#x5C31;&#x80FD;&#x770B;&#x5230;&#x6240;&#x6709;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x4E00;&#x7AD9;&#x5F0F;&#x7684;&#x4FE1;&#x606F;&#x5165;&#x53E3;&#x3002;</p><hr><p>&#x4EE5;&#x4E0A;&#x4FE1;&#x606F;&#x7531; Gemini &#x751F;&#x6210;</p><p>&#x6211;&#x5E76;&#x975E;&#x4E00;&#x4E2A; Obsidian &#x6DF1;&#x5EA6;&#x7528;&#x6237;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x5C06;&#x5176;&#x5F53;&#x505A;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x4E2D;&#x4E34;&#x65F6;&#x8BB0;&#x5F55;&#x4E1C;&#x897F;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#xFF0C;&#x751A;&#x81F3;&#x90FD;&#x6CA1;&#x6709;&#x540C;&#x6B65;&#x4E0D;&#x540C;&#x8BBE;&#x5907;&#x4E0A;&#x7684; vault&#x3002;&#x6240;&#x4EE5;&#x4E0A;&#x9762;&#x7531; AI &#x544A;&#x8BC9;&#x6211;&#x7684;&#x7528;&#x6CD5;&#x6211;&#x90FD;&#x7528;&#x4E0D;&#x4E0A;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x7528;&#x3002;&#x65E5;&#x5E38;&#x5BF9;&#x4E8E;&#x5C06; Obsidian &#x4F5C;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x6700;&#x591A;&#x7684;&#x662F;&#x8BBF;&#x95EE; readwise reader &#x8BFB;&#x4E66;&#x65F6;&#x53EF;&#x4EE5;&#x8BA9;&#x9875;&#x9762;&#x66F4;&#x52A0;&#x7B80;&#x6D01;&#xFF0C;&#x8BFB; RSS &#x8BA2;&#x9605;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x65F6;&#x53EF;&#x4EE5;&#x66F4;&#x65B9;&#x4FBF;&#x5730;&#x4FDD;&#x5B58;&#x5230;&#x672C;&#x5730;&#x3002;&#x4EE5;&#x53CA;&#xFF0C;&#x6478;&#x9C7C;&#x7684;&#x65F6;&#x5019;&#x66F4;&#x52A0;&#x4E0D;&#x5BB9;&#x6613;&#x88AB;&#x4EBA;&#x53D1;&#x73B0;:)</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x5076;&amp;#x7136;&amp;#x53D1;&amp;#x73B0; Obsidian &amp;#x7684; &lt;a href=&quot;https://help.obsidian.md/plugins/web-viewer&quot;&gt;web-viewer&lt;/a&gt; &amp;#x529F;&amp;#x80FD;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x5F53;&amp;#x505A;&amp;#x4E00;&amp;#x4E2A;&amp;#x6D4F;&amp;#x89C8;&amp;#x5668;&amp;#x6765;&amp;#x4F7F;&amp;#x7528;&amp;#x3002;&amp;#x5F53;&amp;#x7136;&amp;#xFF0C;&amp;#x4E0D;&amp;#x80FD;&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E3B;&amp;#x529B;&amp;#x6D4F;&amp;#x89C8;&amp;#x5668;&amp;#xFF0C;&amp;#x800C;&amp;#x662F;&amp;#x5728;&amp;#x4E00;&amp;#x4E9B;&amp;#x7279;&amp;#x5B9A;&amp;#x60C5;&amp;#x5F62;&amp;#x4E0B;&amp;#x4F7F;&amp;#x7528;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x4E0E;&amp;#x666E;&amp;#x901A;&amp;#x6D4F;&amp;#x89C8;&amp;#x5668;&amp;#x76F8;&amp;#x6BD4;&amp;#xFF0C;Obsidian &amp;#x6700;&amp;#x5927;&amp;#x7684;&amp;#x7279;&amp;#x70B9;&amp;#x662F;&amp;#x53EF;&amp;#x4EE5;&amp;#x6D88;&amp;#x9664;&amp;#x4E00;&amp;#x5207;&amp;#x5E72;&amp;#x6270;&amp;#xFF0C;&amp;#x53EA;&amp;#x4FDD;&amp;#x7559;&amp;#x7F51;&amp;#x9875;&amp;#x4E3B;&amp;#x4F53;&amp;#x5185;&amp;#x5BB9;&amp;#x3002;&amp;#x7136;&amp;#x540E;&amp;#x53EF;&amp;#x4EE5;&amp;#x65B9;&amp;#x4FBF;&amp;#x5730;&amp;#x5C06;&amp;#x7F51;&amp;#x9875;&amp;#x4E00;&amp;#x952E;&amp;#x4FDD;&amp;#x5B58;&amp;#x5728;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684; vault &amp;#x4E2D;&amp;#x3002;&amp;#x5F53;&amp;#x9700;&amp;#x8981;&amp;#x8FDB;&amp;#x884C;&amp;#x6C89;&amp;#x6D78;&amp;#x5F0F;&amp;#x9605;&amp;#x8BFB;&amp;#x4E0E;&amp;#x77E5;&amp;#x8BC6;&amp;#x6355;&amp;#x83B7;&amp;#x65F6;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x4E34;&amp;#x65F6;&amp;#x7528; Obsidian &amp;#x6765;&amp;#x8BBF;&amp;#x95EE;&amp;#x7F51;&amp;#x9875;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
  </entry>
  
  <entry>
    <title>热情与课题分离</title>
    <link href="https://shiqingxu.gthub.io/2025/08/26/passion-and-separation-of-tasks/"/>
    <id>https://shiqingxu.gthub.io/2025/08/26/passion-and-separation-of-tasks/</id>
    <published>2025-08-26T00:24:31.000Z</published>
    <updated>2025-09-03T00:38:44.797Z</updated>
    
    <content type="html"><![CDATA[<p>&#x8FD9;&#x4E24;&#x5929;&#x770B;&#x5230;&#x738B;&#x52C7;&#x8001;&#x5E08;&#x5199;&#x7684;&#x4E00;&#x7BC7;&#x7B54;&#x63A8;&#x53CB;&#x63D0;&#x95EE;<a href="https://manateelazycat.github.io/2025/08/22/keep-hot/">&#x5982;&#x4F55;&#x624D;&#x80FD;&#x6709;&#x70ED;&#x60C5;</a>&#xFF0C;&#x7ED3;&#x8BBA;&#x662F;&#x521B;&#x4E1A;&#x7684;&#x70ED;&#x60C5;&#x6765;&#x6E90;&#x4E8E;&#x81EA;&#x7531;&#x6784;&#x5EFA;&#xFF0C;&#x6253;&#x5DE5;&#x8005;&#x7684;&#x70ED;&#x60C5;&#x6765;&#x6E90;&#x4E8E;&#x8BFE;&#x9898;&#x5206;&#x79BB;&#x3002;</p><span id="more"></span><p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6253;&#x5DE5;&#x8005;&#xFF0C;&#x80FD;&#x591F;&#x611F;&#x53D7;&#x5230;&#x8BFE;&#x9898;&#x5206;&#x79BB;&#x5BF9;&#x4E8E;&#x907F;&#x514D;&#x5185;&#x8017;&#x6765;&#x8BF4;&#x786E;&#x5B9E;&#x5927;&#x6709;&#x88E8;&#x76CA;&#xFF0C;&#x5341;&#x5206;&#x6709;&#x52A9;&#x4E8E;&#x51CF;&#x5C11;&#x5DE5;&#x4F5C;&#x5BF9;&#x81EA;&#x5DF1;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x70ED;&#x60C5;&#x7684;&#x635F;&#x8017;&#x3002;</p><p>&#x6211;&#x7684;leader&#x4E5F;&#x7ECF;&#x5E38;&#x8DDF;&#x6211;&#x4EEC;&#x8BF4;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E2D;&#x9047;&#x5230;&#x96BE;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x4EBA;&#xFF0C;&#x81EA;&#x5DF1;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8981;&#x63D0;&#x9192;&#x81EA;&#x5DF1;&#x8BFE;&#x9898;&#x5206;&#x79BB;&#x3002;</p><p>&#x4E0D;&#x8FC7;&#x8981;&#x8BF4;&#x5DE5;&#x4F5C;&#x4E0A;&#x5982;&#x4F55;&#x4FDD;&#x6301;&#x70ED;&#x60C5;&#xFF0C;&#x8BFE;&#x9898;&#x5206;&#x79BB;&#x6050;&#x6015;&#x5E76;&#x975E;&#x5168;&#x662F;&#x597D;&#x5904;&#x3002;&#x8BB0;&#x5F97;&#x4E4B;&#x524D;&#x770B;&#x674E;&#x7B11;&#x6765;&#x8BF4;&#x8FC7;&#xFF0C;&#x4FDD;&#x6301;&#x9AD8;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x5DE5;&#x4F5C;&#x7684;&#x4E8B;&#x60C5;&#x5F53;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x4EFB;&#x52A1;&#x5207;&#x6362;&#xFF0C;&#x800C;&#x4EFB;&#x52A1;&#x5207;&#x6362;&#x662F;&#x6BD4;&#x8F83;&#x5F71;&#x54CD;&#x6548;&#x7387;&#x7684;&#x3002;</p><p>&#x5176;&#x5B9E;&#x70ED;&#x60C5;&#x4E5F;&#x662F;&#x7C7B;&#x4F3C;&#xFF0C;&#x628A;&#x5DE5;&#x4F5C;&#x7684;&#x4E8B;&#x60C5;&#x5F53;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5FC3;&#x6001;&#x4E0A;&#x5C31;&#x4F1A;&#x7C7B;&#x4F3C;&#x4E8E;&#x521B;&#x4E1A;&#x8005;&#xFF0C;&#x4ECE;&#x4FDD;&#x6301;&#x70ED;&#x60C5;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x5E94;&#x5F53;&#x662F;&#x6BD4;&#x8BFE;&#x9898;&#x5206;&#x79BB;&#x66F4;&#x6709;&#x6548;&#x3002;</p><p>&#x4E0D;&#x8FC7;&#x8FD9;&#x6837;&#x505A;&#x4E5F;&#x6709;&#x4E2A;&#x524D;&#x63D0;&#xFF0C;&#x5C31;&#x662F;&#x516C;&#x53F8;&#x8981;&#x5584;&#x5F85;&#x5458;&#x5DE5;&#x3002;&#x5982;&#x679C;&#x516C;&#x53F8;&#x662F;&#x4E2A;&#x5265;&#x524A;&#x8005;&#xFF0C;&#x6253;&#x5DE5;&#x8005;&#x5F88;&#x96BE;&#x628A;&#x516C;&#x53F8;&#x7684;&#x4E8B;&#x60C5;&#x5F53;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x6765;&#x505A;&#xFF0C;&#x80FD;&#x505A;&#x5230;&#x8BFE;&#x9898;&#x5206;&#x79BB;&#x5DF2;&#x7ECF;&#x5F88;&#x4E0D;&#x9519;&#x4E86;&#x3002;&#x5982;&#x679C;&#x6709;&#x6761;&#x4EF6;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x5C3D;&#x5FEB;&#x79BB;&#x5F00;&#xFF0C;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x6253;&#x5DE5;&#x7684;&#x5730;&#x65B9;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x8FD9;&amp;#x4E24;&amp;#x5929;&amp;#x770B;&amp;#x5230;&amp;#x738B;&amp;#x52C7;&amp;#x8001;&amp;#x5E08;&amp;#x5199;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x7B54;&amp;#x63A8;&amp;#x53CB;&amp;#x63D0;&amp;#x95EE;&lt;a href=&quot;https://manateelazycat.github.io/2025/08/22/keep-hot/&quot;&gt;&amp;#x5982;&amp;#x4F55;&amp;#x624D;&amp;#x80FD;&amp;#x6709;&amp;#x70ED;&amp;#x60C5;&lt;/a&gt;&amp;#xFF0C;&amp;#x7ED3;&amp;#x8BBA;&amp;#x662F;&amp;#x521B;&amp;#x4E1A;&amp;#x7684;&amp;#x70ED;&amp;#x60C5;&amp;#x6765;&amp;#x6E90;&amp;#x4E8E;&amp;#x81EA;&amp;#x7531;&amp;#x6784;&amp;#x5EFA;&amp;#xFF0C;&amp;#x6253;&amp;#x5DE5;&amp;#x8005;&amp;#x7684;&amp;#x70ED;&amp;#x60C5;&amp;#x6765;&amp;#x6E90;&amp;#x4E8E;&amp;#x8BFE;&amp;#x9898;&amp;#x5206;&amp;#x79BB;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="think" scheme="https://shiqingxu.gthub.io/tags/think/"/>
    
  </entry>
  
  <entry>
    <title>开始使用国产软件WPS和微信输入法</title>
    <link href="https://shiqingxu.gthub.io/2025/08/25/useing-wps-and-wetype/"/>
    <id>https://shiqingxu.gthub.io/2025/08/25/useing-wps-and-wetype/</id>
    <published>2025-08-25T00:41:34.000Z</published>
    <updated>2025-09-03T00:38:44.960Z</updated>
    
    <content type="html"><![CDATA[<p>&#x591A;&#x5E74;&#x6765;&#xFF0C;&#x6211;&#x5BF9;&#x4E8E;&#x65E5;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x4E00;&#x76F4;&#x6709;&#x4E00;&#x4E9B;&#x5F3A;&#x8FEB;&#x75C7;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x6D01;&#x7656;&#xFF0C;&#x90E8;&#x5206;&#x662F;&#x51FA;&#x4E8E;&#x907F;&#x514D;&#x6CC4;&#x9732;&#x9690;&#x79C1;&#x7684;&#x8003;&#x8651;&#x3001;&#x90E8;&#x5206;&#x662F;&#x51FA;&#x4E8E;&#x53D7;&#x4E0D;&#x4E86;&#x5F88;&#x591A;&#x56FD;&#x4EA7;&#x8F6F;&#x4EF6;&#x4E0D;&#x505C;&#x5F39;&#x5E7F;&#x544A;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x4E0D;&#x592A;&#x559C;&#x6B22;&#x81C3;&#x80BF;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x4E0D;&#x8FC7;&#x8FD1;&#x671F;&#x56E0;&#x4E3A;&#x5DE5;&#x4F5C;&#x7684;&#x7F18;&#x6545;&#xFF0C;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x653E;&#x5728;&#x4EE5;&#x524D;&#x7684;&#x6211;&#x662F;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;WPS&#x548C;&#x5FAE;&#x4FE1;&#x8F93;&#x5165;&#x6CD5;&#x3002;</p><span id="more"></span><p>&#x5173;&#x4E8E;WPS&#xFF0C;&#x4EE5;&#x524D;&#x6CA1;&#x7528;&#x8FC7;&#x7684;&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x8FD9;&#x6B3E;&#x8F6F;&#x4EF6;&#x5B58;&#x5728;&#x7684;&#x5386;&#x53F2;&#x5DF2;&#x7ECF;&#x5F88;&#x4E45;&#x8FDC;&#x4E86;&#xFF0C;&#x6211;&#x5BF9;&#x5176;&#x5370;&#x8C61;&#x8FD8;&#x505C;&#x7559;&#x5728;&#x5927;&#x5B66;&#x65F6;&#x540C;&#x5B66;&#x4EEC;&#x906D;&#x9047;&#x7684;&#x683C;&#x5F0F;&#x4E0E;&#x5FAE;&#x8F6F;&#x7684;office&#x5957;&#x4EF6;&#x517C;&#x5BB9;&#x6027;&#x4E0D;&#x5B8C;&#x7F8E;&#xFF0C;&#x4EE5;&#x53CA;&#x524D;&#x51E0;&#x5E74;&#x542C;&#x8BF4;&#x7684;&#x4E22;&#x6570;&#x636E;&#x6253;&#x5BA2;&#x670D;&#x7535;&#x8BDD;&#x65E0;&#x6CD5;&#x6062;&#x590D;&#x4F46;&#x662F;&#x4E70;&#x4F1A;&#x5458;&#x5C31;&#x53EF;&#x4EE5;&#x6062;&#x590D;&#x4E4B;&#x7C7B;&#x7684;&#x4F20;&#x95FB;&#x3002;&#x8FD9;&#x4E9B;&#x5E74;&#x4E00;&#x76F4;&#x8BA2;&#x9605;&#x5FAE;&#x8F6F;&#x7684; office 365 &#x5BB6;&#x5EAD;&#x7248;&#xFF0C;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x4E00;&#x5207;&#x5173;&#x4E8E;&#x6587;&#x6863;&#x5904;&#x7406;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x8BD5;&#x7528;WPS&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x5468;&#x56F4;&#x592A;&#x591A;&#x4EBA;&#x7528;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x80FD;&#x5927;&#x6982;&#x89C2;&#x5BDF;&#x5230;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x7684;&#x5E76;&#x4E0D;&#x600E;&#x4E48;&#x597D;&#x770B;&#x7684;&#x754C;&#x9762;&#x548C;&#x5F39;&#x7A97;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x66F4;&#x662F;&#x5FC3;&#x751F;&#x538C;&#x6076;&#x3002;</p><p>&#x8FD9;&#x6B21;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x7684;&#x5951;&#x673A;&#x662F;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E2D;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x8DDF;&#x56FD;&#x5916;&#x7684;&#x540C;&#x4E8B;&#x5F00;&#x4F1A;&#xFF0C;&#x7EC4;&#x91CC;&#x540C;&#x4E8B;&#x7ED9;&#x6211;&#x5C55;&#x793A;&#x4E86;WPS&#x7684;&#x8BED;&#x97F3;&#x901F;&#x8BB0;&#x529F;&#x80FD;&#xFF0C;&#x80FD;&#x591F;&#x5C06;&#x4F1A;&#x8BAE;&#x5F55;&#x4E0B;&#x6765;&#x8F6C;&#x6210;&#x6587;&#x5B57;&#x5E76;&#x7FFB;&#x8BD1;&#xFF0C;&#x8C03;&#x7528;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x8BAF;&#x98DE;&#x7684;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x6BD4;&#x8F83;&#x5207;&#x4E2D;&#x6211;&#x7684;&#x75DB;&#x70B9;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x76F4;&#x63A5;&#x8D2D;&#x4E70;&#x8BAF;&#x98DE;&#x4F1A;&#x5458;&#x4E5F;&#x5E76;&#x4E0D;&#x4FBF;&#x5B9C;&#xFF0C;&#x8D2D;&#x4E70;WPS&#x4F1A;&#x5458;&#x7684;&#x8BDD;&#x9664;&#x4E86;&#x8BED;&#x97F3;&#x901F;&#x8BB0;&#x4E0E;&#x7FFB;&#x8BD1;&#x8FD8;&#x80FD;&#x83B7;&#x5F97;&#x4E00;&#x5957;&#x529E;&#x516C;&#x8F6F;&#x4EF6;&#xFF0C;&#x6070;&#x9022;&#x8D2D;&#x7269;&#x8282;&#x4E8E;&#x662F;&#x4EE5;&#x6BCF;&#x5E74;&#x767E;&#x5143;&#x51FA;&#x5934;&#x7684;&#x4EF7;&#x683C;&#x76F4;&#x63A5;&#x4E70;&#x4E86;&#x4E09;&#x5E74;&#x5927;&#x4F1A;&#x5458;&#x3002;</p><p>&#x81F3;&#x4E8E;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x6211;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x6709;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x81EA;&#x6253;&#x5341;&#x51E0;&#x5E74;&#x524D;&#x5F00;&#x59CB;&#x7528;&#x5C0F;&#x72FC;&#x6BEB;&#x4EE5;&#x6765;&#xFF0C;&#x7535;&#x8111;&#x4E0A;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x7528;&#x8FD9;&#x4E2A;&#x3002;&#x4E3B;&#x529B;&#x673A;&#x4ECE;win&#x5207;&#x6362;&#x5230;mac&#x4E4B;&#x540E;&#xFF0C;&#x5728;mac&#x4E0A;&#x7528;&#x540C;&#x662F;&#x57FA;&#x4E8E;RIME&#x8F93;&#x5165;&#x6CD5;&#x5F15;&#x64CE;&#x5F00;&#x53D1;&#x7684;&#x4E2D;&#x5DDE;&#x97F5;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x800C;Windows&#x7531;&#x4E8E;&#x7528;&#x7684;&#x5C11;&#xFF0C;&#x67D0;&#x6B21;&#x91CD;&#x88C5;&#x7CFB;&#x7EDF;&#x4E4B;&#x540E;&#x5C31;&#x61D2;&#x5F97;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x7CFB;&#x7EDF;&#x5185;&#x7F6E;&#x7684;&#x5FAE;&#x8F6F;&#x62FC;&#x97F3;&#x4E86;&#x3002;</p><p>&#x4F46;&#x5FAE;&#x8F6F;&#x62FC;&#x97F3;&#x5076;&#x5C14;&#x7528;&#x4E00;&#x4E0B;&#x8FD8;&#x884C;&#xFF0C;&#x4F5C;&#x4E3A;&#x65E5;&#x5E38;&#x8F93;&#x5165;&#x6CD5;&#x7684;&#x8BDD;&#x4E0D;&#x592A;&#x8DDF;&#x624B;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5B83;&#x7684;&#x5019;&#x9009;&#x8BCD;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x6211;&#x603B;&#x662F;&#x4E0D;&#x80FD;&#x9002;&#x5E94;&#xFF0C;&#x5BFC;&#x81F4;&#x7ECF;&#x5E38;&#x8F93;&#x5165;&#x9519;&#x522B;&#x5B57;&#x3002;&#x6700;&#x65B0;&#x7684;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x516C;&#x53F8;&#x914D;&#x53D1;&#x7684;&#x662F;thinkpad&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5FAE;&#x8F6F;&#x62FC;&#x97F3;&#x4E4B;&#x540E;&#x4E0D;&#x5F97;&#x4E0D;&#x91CD;&#x65B0;&#x5B89;&#x88C5;&#x4E86;&#x5C0F;&#x72FC;&#x6BEB;&#xFF0C;&#x5E76;&#x5BFC;&#x5165;&#x4E86;&#x5341;&#x51E0;&#x5E74;&#x6765;&#x79EF;&#x7D2F;&#x7684;&#x4E2A;&#x4EBA;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p><p>&#x7531;&#x4E8E;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6211;&#x6709;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x4E2D;&#x82F1;&#x6DF7;&#x8F93;&#x9700;&#x6C42;&#xFF0C;&#x8FD9;&#x4E2A;&#x9700;&#x6C42;&#x5728;&#x5C0F;&#x72FC;&#x6BEB;&#x4E0A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x4E0D;&#x96BE;&#xFF0C;&#x4F46;&#x6211;&#x5728;Gemini&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#x5C1D;&#x8BD5;&#x4E86;&#x4E24;&#x4E09;&#x6B21;&#xFF0C;&#x5747;&#x4EE5;&#x5931;&#x8D25;&#x544A;&#x7EC8;&#x3002;&#x6700;&#x540E;&#x5FC3;&#x60F3;&#xFF0C;&#x522B;&#x6298;&#x817E;&#x4E86;&#xFF0C;&#x5C31;&#x88C5;&#x4E2A;&#x56FD;&#x4EA7;&#x8F93;&#x5165;&#x6CD5;&#x8BD5;&#x8BD5;&#x5427;&#x3002;&#x641C;&#x72D7;&#x8FC7;&#x4E8E;&#x82B1;&#x54E8;&#xFF0C;&#x60F3;&#x8D77;&#x6765;&#x521A;&#x63A8;&#x51FA;&#x4E0D;&#x4E45;&#x7684;&#x5FAE;&#x4FE1;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#x754C;&#x9762;&#x6BD4;&#x8F83;&#x7B80;&#x6D01;&#xFF0C;&#x4E8E;&#x662F;&#x5B89;&#x88C5;&#x8BD5;&#x7528;&#x3002;</p><p>&#x8FD9;&#x4E24;&#x4E2A;&#x8F6F;&#x4EF6;&#x8BD5;&#x7528;&#x7684;&#x6548;&#x679C;&#x90FD;&#x8D85;&#x51FA;&#x4E86;&#x6211;&#x7684;&#x9884;&#x671F;&#x3002;&#x9996;&#x5148;&#x662F;WPS&#xFF0C;&#x9664;&#x4E86;AI&#x901F;&#x8BB0;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4E5F;&#x5C1D;&#x8BD5;&#x7528;&#x5B83;&#x6765;&#x529E;&#x516C;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6BD4;office&#x5957;&#x4EF6;&#x66F4;&#x6613;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x96C6;&#x6210;&#x4E86;AI&#x529F;&#x80FD;&#x3002;&#x516C;&#x53F8;&#x6709;&#x4E00;&#x4E2A;&#x6211;&#x7ECF;&#x5E38;&#x4F1A;&#x7528;&#x5230;&#x7684;&#x6587;&#x4EF6;&#x6A21;&#x677F;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4F55;&#x7528;word&#x6253;&#x5F00;&#x7F16;&#x8F91;&#x65F6;&#x603B;&#x4F1A;&#x6BD4;&#x8F83;&#x5361;&#x987F;&#xFF0C;&#x800C;&#x4E14;&#x683C;&#x5F0F;&#x5BB9;&#x6613;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x7528;WPS&#x95EE;&#x9898;&#x5C31;&#x5C11;&#x5F97;&#x591A;&#xFF0C;&#x4E8E;&#x662F;WPS&#x9010;&#x6E10;&#x53D8;&#x6210;&#x4E86;&#x6211;&#x7684;&#x529E;&#x516C;&#x5957;&#x4EF6;&#x4E3B;&#x529B;&#x3002;</p><p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x559C;&#x6B22;&#x5F39;&#x7A97;&#x3001;&#x559C;&#x6B22;&#x81EA;&#x5DF1;&#x6253;&#x5F00;&#x4E00;&#x4E9B;&#x63A8;&#x5E7F;&#x9875;&#x9762;&#x7684;&#x95EE;&#x9898;&#x786E;&#x5B9E;&#x5F88;&#x70E6;&#x4EBA;&#xFF0C;&#x6211;&#x82B1;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x628A;&#x80FD;&#x5173;&#x7684;&#x90FD;&#x627E;&#x5230;&#x5F00;&#x5173;&#x5173;&#x6389;&#x4E86;&#xFF0C;&#x7981;&#x7528;&#x4E86;&#x4E91;&#x76D8;&#x7684;&#x81EA;&#x542F;&#x52A8;&#xFF0C;&#x8FD9;&#x6837;&#x65E5;&#x5E38;&#x4F7F;&#x7528;&#x4E0D;&#x592A;&#x4F1A;&#x88AB;&#x5E7F;&#x544A;&#x9A9A;&#x6270;&#x4E86;&#x3002;</p><p>&#x81F3;&#x4E8E;&#x5FAE;&#x4FE1;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x5176;&#x5728;&#x4FDD;&#x6301;&#x8F6F;&#x4EF6;&#x7B80;&#x6D01;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x597D;&#x7528;&#x7A0B;&#x5EA6;&#x5927;&#x5927;&#x8D85;&#x51FA;&#x4E86;&#x6211;&#x7684;&#x9884;&#x671F;&#x3002;&#x5C24;&#x5176;&#x662F;&#x5176;&#x8DE8;&#x8BBE;&#x5907;&#x540C;&#x6B65;&#x526A;&#x5207;&#x677F;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6781;&#x4E3A;&#x65B9;&#x4FBF;&#x3002;</p><p>&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4EE5;&#x524D;&#x7684;&#x6211;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x5C31;&#x4F1A;&#x56E0;&#x4E3A;&#x9690;&#x79C1;&#x6CC4;&#x9732;&#x7684;&#x62C5;&#x5FE7;&#x800C;&#x7709;&#x6BDB;&#x5012;&#x7ACB;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5FAE;&#x4FE1;&#x8F93;&#x5165;&#x6CD5;&#x8FD9;&#x91CC;&#x6211;&#x4E4B;&#x6240;&#x4EE5;&#x4E0D;&#x5728;&#x610F;&#xFF0C;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x76F8;&#x4FE1;&#x5FAE;&#x4FE1;&#x4E0D;&#x4F1A;&#x6CC4;&#x9732;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x4F5C;&#x4E3A;&#x5168;&#x6C11;IM&#x5DE5;&#x5177;&#x7684;&#x5FAE;&#x4FE1;&#xFF0C;&#x672C;&#x8EAB;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x83B7;&#x53D6;&#x5230;&#x6211;&#x4E2A;&#x4EBA;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x9690;&#x79C1;&#x4FE1;&#x606F;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x6CD5;&#x65E0;&#x6CD5;&#x628A;&#x6211;&#x66F4;&#x591A;&#x7684;&#x9690;&#x79C1;&#x4FE1;&#x606F;&#x4EA4;&#x51FA;&#x53BB;&#x3002;</p><p>&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#x9887;&#x6709;&#x70B9;&#x513F;&#x7834;&#x7F50;&#x513F;&#x7834;&#x6454;&#x7684;&#x610F;&#x601D;&#x5427;&#x3002;&#x8FD9;&#x4E2A;&#x8F93;&#x5165;&#x6CD5;&#x662F;&#x5982;&#x6B64;&#x7684;&#x597D;&#x7528;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#x8FDE;&#x624B;&#x673A;&#x4E0A;&#x4E5F;&#x5B89;&#x88C5;&#x4E86;&#xFF0C;&#x66FF;&#x6362;&#x4E86;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x4F7F;&#x7528;&#x7684;iOS&#x81EA;&#x5E26;&#x8F93;&#x5165;&#x6CD5;&#x3002;</p><p>&#x8BF4;&#x5230;iOS&#x81EA;&#x5E26;&#x8F93;&#x5165;&#x6CD5;&#xFF0C;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x90FD;&#x633A;&#x96BE;&#x7528;&#x7684;&#xFF0C;&#x6700;&#x70E6;&#x4EBA;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4E09;&#x5929;&#x4E24;&#x5934;&#x4E22;&#x8BCD;&#x5E93;&#xFF0C;&#x4EE5;&#x53CA;&#x83AB;&#x540D;&#x5361;&#x987F;&#xFF0C;&#x6362;&#x6210;&#x5FAE;&#x4FE1;&#x8F93;&#x5165;&#x6CD5;&#x4E4B;&#x540E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x90FD;&#x6CA1;&#x6709;&#x4E86;&#x3002;</p><p>&#x6709;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5BF9;&#x8F6F;&#x4EF6;&#x53D8;&#x5F97;&#x5BBD;&#x5BB9;&#x591A;&#x4E86;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x8C13;&#x7684;&#x4E2A;&#x4EBA;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#x4E5F;&#x4E0D;&#x90A3;&#x4E48;&#x6267;&#x7740;&#x4E86;&#x3002;&#x8FD1;&#x671F;&#x53D1;&#x751F;&#x7684;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x662F;&#x5728;&#x4E2A;&#x4EBA;&#x7535;&#x8111;&#x4E0A;&#x5B89;&#x88C5;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x8FDC;&#x7A0B;&#x53CA;&#x5B89;&#x5168;&#x8F6F;&#x4EF6;&#x3002;&#x4EE5;&#x524D;&#x6211;&#x5728;&#x5BB6;&#x7528;&#x81EA;&#x5DF1;&#x7535;&#x8111;&#x52A0;&#x73ED;&#x65F6;&#xFF0C;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x7684;&#x865A;&#x62DF;&#x673A;&#x91CC;&#x3002;&#x4E0A;&#x5468;&#x672B;&#x52A0;&#x73ED;&#x65F6;&#x7531;&#x4E8E;&#x8981;&#x540C;&#x65F6;&#x5904;&#x7406;&#x7684;&#x6587;&#x4EF6;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x800C;&#x6211;&#x7684; Mini PC &#x5B9A;&#x4F4D;&#x662F;&#x65E5;&#x5E38;&#x529E;&#x516C;&#xFF0C;&#x6027;&#x80FD;&#x5E76;&#x4E0D;&#x5F3A;&#x52B2;&#xFF0C;&#x677F;&#x8F7D;&#x5185;&#x5B58;&#x53EA;&#x6709;24G&#x65E0;&#x6CD5;&#x6269;&#x5C55;&#xFF0C;&#x5728;&#x865A;&#x62DF;&#x673A;&#x91CC;&#x529E;&#x516C;&#x591A;&#x5C11;&#x6709;&#x70B9;&#x513F;&#x96BE;&#x4E3A;&#x5B83;&#x4E86;&#x3002;&#x6070;&#x9022;&#x516C;&#x53F8;&#x6700;&#x8FD1;&#x5728;&#x53BB;&#x817E;&#x8BAF;&#x5316;&#xFF0C;&#x628A;&#x539F;&#x817E;&#x8BAF;&#x7684;iOA&#x8F6F;&#x4EF6;&#x66FF;&#x6362;&#x6210;&#x4E86;&#x81EA;&#x7814;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4E8E;&#x662F;&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;&#x76F4;&#x63A5;&#x5B89;&#x88C5;&#x5728;&#x81EA;&#x5DF1;&#x7535;&#x8111;&#x4E0A;&#xFF0C;&#x4E0D;&#x7528;&#x4EC0;&#x4E48;&#x865A;&#x62DF;&#x673A;&#x4E86;&#x3002;</p><p>&#x60F3;&#x8D77;&#x4EE5;&#x524D;&#x7528;Android&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x9650;&#x5236;&#x56FD;&#x4EA7;app&#xFF0C;&#x82B1;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x6298;&#x817E;&#x4E86;&#x5F88;&#x591A;&#x9879;&#x76EE;&#xFF0C;&#x6700;&#x7EC8;&#x6536;&#x83B7;&#x7684;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x6298;&#x817E;&#x7684;&#x8FC7;&#x7A0B;&#x4E50;&#x8DA3;&#x5427;&#xFF0C;&#x5BF9;&#x4E2A;&#x4EBA;&#x9690;&#x79C1;&#x7684;&#x4FDD;&#x62A4;&#x6709;&#x6CA1;&#x6709;&#x52A9;&#x529B;&#xFF0C;&#x771F;&#x7684;&#x5F88;&#x96BE;&#x8BF4;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x591A;&amp;#x5E74;&amp;#x6765;&amp;#xFF0C;&amp;#x6211;&amp;#x5BF9;&amp;#x4E8E;&amp;#x65E5;&amp;#x5E38;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x8F6F;&amp;#x4EF6;&amp;#x4E00;&amp;#x76F4;&amp;#x6709;&amp;#x4E00;&amp;#x4E9B;&amp;#x5F3A;&amp;#x8FEB;&amp;#x75C7;&amp;#xFF0C;&amp;#x6216;&amp;#x8005;&amp;#x8BF4;&amp;#x6D01;&amp;#x7656;&amp;#xFF0C;&amp;#x90E8;&amp;#x5206;&amp;#x662F;&amp;#x51FA;&amp;#x4E8E;&amp;#x907F;&amp;#x514D;&amp;#x6CC4;&amp;#x9732;&amp;#x9690;&amp;#x79C1;&amp;#x7684;&amp;#x8003;&amp;#x8651;&amp;#x3001;&amp;#x90E8;&amp;#x5206;&amp;#x662F;&amp;#x51FA;&amp;#x4E8E;&amp;#x53D7;&amp;#x4E0D;&amp;#x4E86;&amp;#x5F88;&amp;#x591A;&amp;#x56FD;&amp;#x4EA7;&amp;#x8F6F;&amp;#x4EF6;&amp;#x4E0D;&amp;#x505C;&amp;#x5F39;&amp;#x5E7F;&amp;#x544A;&amp;#xFF0C;&amp;#x8FD8;&amp;#x6709;&amp;#x4E00;&amp;#x90E8;&amp;#x5206;&amp;#x662F;&amp;#x4E0D;&amp;#x592A;&amp;#x559C;&amp;#x6B22;&amp;#x81C3;&amp;#x80BF;&amp;#x7684;&amp;#x8F6F;&amp;#x4EF6;&amp;#x3002;&amp;#x4E0D;&amp;#x8FC7;&amp;#x8FD1;&amp;#x671F;&amp;#x56E0;&amp;#x4E3A;&amp;#x5DE5;&amp;#x4F5C;&amp;#x7684;&amp;#x7F18;&amp;#x6545;&amp;#xFF0C;&amp;#x5F00;&amp;#x59CB;&amp;#x4F7F;&amp;#x7528;&amp;#x4E24;&amp;#x4E2A;&amp;#x653E;&amp;#x5728;&amp;#x4EE5;&amp;#x524D;&amp;#x7684;&amp;#x6211;&amp;#x662F;&amp;#x7EDD;&amp;#x5BF9;&amp;#x4E0D;&amp;#x4F1A;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x8F6F;&amp;#x4EF6;&amp;#xFF0C;WPS&amp;#x548C;&amp;#x5FAE;&amp;#x4FE1;&amp;#x8F93;&amp;#x5165;&amp;#x6CD5;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
    <category term="感想" scheme="https://shiqingxu.gthub.io/tags/%E6%84%9F%E6%83%B3/"/>
    
  </entry>
  
  <entry>
    <title>一台电脑输出两路信号到 LG SDQHD 实现分屏显示</title>
    <link href="https://shiqingxu.gthub.io/2025/08/24/LG-Monitor-split/"/>
    <id>https://shiqingxu.gthub.io/2025/08/24/LG-Monitor-split/</id>
    <published>2025-08-24T08:05:31.000Z</published>
    <updated>2025-09-03T00:38:44.742Z</updated>
    
    <content type="html"><![CDATA[<p>LG &#x6709;&#x4E00;&#x6B3E; SDQHD &#x578B;&#x53F7;&#x663E;&#x793A;&#x5668;&#xFF0C;&#x6BD4;&#x4F8B;&#x4E3A; 16:18&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0; PBP &#x5206;&#x5C4F;&#xFF0C;&#x83B7;&#x5F97;&#x4E0A;&#x4E0B;&#x4E24;&#x5757; 16:9 &#x7684;&#x5C4F;&#x5E55;&#x3002;&#x4E4B;&#x524D;&#x6211;&#x4E00;&#x822C;&#x5728;&#x4F7F;&#x7528;&#x4E24;&#x53F0;&#x7535;&#x8111;&#x540C;&#x65F6;&#x63A5;&#x5165;&#x8FD9;&#x5757;&#x5C4F;&#x5E55;&#x65F6;&#x624D;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x5219;&#x66F4;&#x5E38;&#x4F5C;&#x4E3A;&#x4E00;&#x6574;&#x5757;&#x5C4F;&#x5E55;&#x6765;&#x4F7F;&#x7528;&#x3002;</p><span id="more"></span><p>&#x4E0D;&#x8FC7; 16:18 &#x8FD9;&#x4E2A;&#x6BD4;&#x4F8B;&#x5E76;&#x4E0D;&#x600E;&#x4E48;&#x597D;&#x7528;&#xFF0C;&#x65E5;&#x5E38;&#x4F7F;&#x7528;&#x65F6;&#x9700;&#x8981;&#x7ECF;&#x5E38;&#x8003;&#x8651;&#x7A97;&#x53E3;&#x6392;&#x5217;&#xFF0C;&#x4E3A;&#x6B64;&#x8FD8;&#x7814;&#x7A76;&#x8BD5;&#x7528;&#x4E86;&#x597D;&#x51E0;&#x6B3E;&#x7A97;&#x53E3;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#x3002;&#x6700;&#x8FD1;&#x7528;&#x5C0F;&#x4E3B;&#x673A;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x6709;&#x4E24;&#x4E2A; HDMI &#x63A5;&#x53E3;&#xFF0C;&#x5FFD;&#x7136;&#x60F3;&#x5230;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x4E5F;&#x53EF;&#x4EE5;&#x5206;&#x4E24;&#x8DEF;&#x8F93;&#x51FA;&#x554A;&#xFF0C;&#x4E8E;&#x662F;&#x8BD5;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x679C;&#x7136;&#x53EF;&#x4EE5;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x5916;&#x754C;&#x4E24;&#x5757;&#x663E;&#x793A;&#x5668;&#xFF0C;&#x4E0D;&#x600E;&#x4E48;&#x7528;&#x82B1;&#x7CBE;&#x529B;&#x5728;&#x4E00;&#x5757; 16:18 &#x7684;&#x5C4F;&#x5E55;&#x4E0A;&#x505A;&#x7A97;&#x53E3;&#x7BA1;&#x7406;&#x4E86;&#x3002;</p><p>&#x8BD5;&#x4E86;&#x4E00;&#x4E0B; mac &#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x4E00;&#x8DEF; typc-c &#x8F93;&#x51FA;&#xFF0C;&#x4E00;&#x8DEF; HDMI &#x8F93;&#x51FA;&#x3002;</p><p><img src="/2025/08/24/LG-Monitor-split/settings.png"></p><p><img src="/2025/08/24/LG-Monitor-split/arrange.png"></p><p>&#x6548;&#x679C;&#x5982;&#x4E0B;&#xFF0C;&#x7528;&#x8D77;&#x6765;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x6BD4;&#x8F83;&#x53EF;&#x60DC;&#x7684;&#x662F;&#x663E;&#x793A;&#x5668;&#x53EA;&#x6709;&#x4E00;&#x4E2A; type-c &#x63A5;&#x53E3;&#xFF0C;&#x4E0D;&#x7136;&#x5728; mac &#x4E0A;&#x53EF;&#x4EE5;&#x4E24;&#x8DEF;&#x4FE1;&#x53F7;&#x90FD;&#x8D70; type-c&#xFF0C;&#x5C31;&#x4E0D;&#x7528;&#x628A;&#x7EBF;&#x653E;&#x5728;&#x53F3;&#x8FB9;&#x5F71;&#x54CD;&#x9F20;&#x6807;&#x7684;&#x4F7F;&#x7528;&#x4E86;&#x3002;</p><p><img src="/2025/08/24/LG-Monitor-split/split.jpg"></p>]]></content>
    
    
    <summary type="html">&lt;p&gt;LG &amp;#x6709;&amp;#x4E00;&amp;#x6B3E; SDQHD &amp;#x578B;&amp;#x53F7;&amp;#x663E;&amp;#x793A;&amp;#x5668;&amp;#xFF0C;&amp;#x6BD4;&amp;#x4F8B;&amp;#x4E3A; 16:18&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x5B9E;&amp;#x73B0; PBP &amp;#x5206;&amp;#x5C4F;&amp;#xFF0C;&amp;#x83B7;&amp;#x5F97;&amp;#x4E0A;&amp;#x4E0B;&amp;#x4E24;&amp;#x5757; 16:9 &amp;#x7684;&amp;#x5C4F;&amp;#x5E55;&amp;#x3002;&amp;#x4E4B;&amp;#x524D;&amp;#x6211;&amp;#x4E00;&amp;#x822C;&amp;#x5728;&amp;#x4F7F;&amp;#x7528;&amp;#x4E24;&amp;#x53F0;&amp;#x7535;&amp;#x8111;&amp;#x540C;&amp;#x65F6;&amp;#x63A5;&amp;#x5165;&amp;#x8FD9;&amp;#x5757;&amp;#x5C4F;&amp;#x5E55;&amp;#x65F6;&amp;#x624D;&amp;#x4F7F;&amp;#x7528;&amp;#x8FD9;&amp;#x4E2A;&amp;#x529F;&amp;#x80FD;&amp;#xFF0C;&amp;#x4E00;&amp;#x53F0;&amp;#x7535;&amp;#x8111;&amp;#x5219;&amp;#x66F4;&amp;#x5E38;&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x6574;&amp;#x5757;&amp;#x5C4F;&amp;#x5E55;&amp;#x6765;&amp;#x4F7F;&amp;#x7528;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
  </entry>
  
  <entry>
    <title>广州电信光猫改桥接模式</title>
    <link href="https://shiqingxu.gthub.io/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/"/>
    <id>https://shiqingxu.gthub.io/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/</id>
    <published>2025-08-22T00:37:39.000Z</published>
    <updated>2025-09-03T00:38:44.697Z</updated>
    
    <content type="html"><![CDATA[<p>&#x6700;&#x8FD1;&#x7ED9;&#x5BB6;&#x91CC;&#x6DFB;&#x7F6E;&#x4E86;&#x4E00;&#x53F0;&#x5C0F;&#x8BBE;&#x5907;&#x505A;&#x5BB6;&#x5EAD;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E3A;&#x4E86;&#x7528;&#x4E0A;&#x8BBE;&#x5907;&#x7684; 2.5G &#x7684;&#x7F51;&#x53E3;&#xFF0C;&#x987A;&#x4FBF;&#x5347;&#x7EA7;&#x4E86;&#x4E0B;&#x5185;&#x7F51;&#x73AF;&#x5883;&#x3002;&#x672C;&#x6253;&#x7B97;&#x4E70;&#x4E2A; 2.5G &#x4EA4;&#x6362;&#x673A;&#xFF0C;&#x5076;&#x7136;&#x53D1;&#x73B0;&#x5982;&#x4ECA;&#x4E24;&#x767E;&#x591A;&#x5757;&#x94B1;&#x5C31;&#x80FD;&#x4E70;&#x5230;&#x5E26; 2 &#x4E2A; 2.5G &#x7F51;&#x53E3;&#x7684; WiFi7 &#x8DEF;&#x7531;&#x5668;&#x4E86;&#x3002;&#x6682;&#x65F6;&#x6211;&#x4E5F;&#x53EA;&#x6709;&#x4E00;&#x53F0;&#x8BBE;&#x5907;&#x9700;&#x8981; 2.5G &#x7F51;&#x53E3;&#xFF0C;&#x7D22;&#x6027;&#x6CA1;&#x4E70;&#x4EA4;&#x6362;&#x673A;&#x6539;&#x4E70;&#x8DEF;&#x7531;&#x5668;&#x4E86;&#x3002;</p><p>&#x4E4B;&#x524D;&#x5149;&#x732B;&#x4E00;&#x76F4;&#x662F;&#x9ED8;&#x8BA4;&#x7684;&#x8DEF;&#x7531;&#x6A21;&#x5F0F;&#xFF0C;&#x751A;&#x81F3;&#x4E00;&#x5EA6;&#x76F4;&#x63A5;&#x7528;&#x5149;&#x732B;&#x7684; WiFi &#x4FE1;&#x53F7;&#xFF0C;&#x73B0;&#x5728;&#x65E2;&#x7136;&#x6709;&#x66F4;&#x597D;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x4E86;&#xFF0C;&#x987A;&#x4FBF;&#x6539;&#x6210;&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#xFF0C;&#x8BA9;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x66F4;&#x7A33;&#x5B9A;&#x4E00;&#x4E9B;&#xFF0C;&#x540E;&#x7EED;&#x8FDC;&#x7A0B;&#x6298;&#x817E;&#x5BB6;&#x5EAD;&#x670D;&#x52A1;&#x5668;&#x4E5F;&#x65B9;&#x4FBF;&#x3002;</p><span id="more"></span><h3 id="&#x524D;&#x7F6E;&#x5DE5;&#x4F5C;&#xFF1A;&#x83B7;&#x53D6;&#x5BBD;&#x5E26;&#x8D26;&#x53F7;&#x5BC6;&#x7801;"><a href="#&#x524D;&#x7F6E;&#x5DE5;&#x4F5C;&#xFF1A;&#x83B7;&#x53D6;&#x5BBD;&#x5E26;&#x8D26;&#x53F7;&#x5BC6;&#x7801;" class="headerlink" title="&#x524D;&#x7F6E;&#x5DE5;&#x4F5C;&#xFF1A;&#x83B7;&#x53D6;&#x5BBD;&#x5E26;&#x8D26;&#x53F7;&#x5BC6;&#x7801;"></a>&#x524D;&#x7F6E;&#x5DE5;&#x4F5C;&#xFF1A;&#x83B7;&#x53D6;&#x5BBD;&#x5E26;&#x8D26;&#x53F7;&#x5BC6;&#x7801;</h3><p>&#x4F7F;&#x7528;&#x8DEF;&#x7531;&#x5668;&#x62E8;&#x53F7;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5BBD;&#x5E26;&#x7684;&#x8D26;&#x53F7;&#x5BC6;&#x7801;&#xFF0C;&#x6709;&#x7684;&#x5BBD;&#x5E26;&#x5E08;&#x5085;&#x88C5;&#x673A;&#x65F6;&#x4F1A;&#x5199;&#x4E0B;&#x6765;&#x8D34;&#x5728;&#x5149;&#x732B;&#x4E0A;&#xFF0C;&#x6211;&#x4E4B;&#x524D;&#x5728;&#x522B;&#x7684;&#x57CE;&#x5E02;&#x65F6;&#x9047;&#x5230;&#x8FC7;&#x3002;&#x5E7F;&#x5DDE;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x8D34;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x8D26;&#x53F7;&#x5BC6;&#x7801;&#xFF0C;&#x662F;&#x6253;&#x7535;&#x4FE1;&#x5BA2;&#x670D;&#x8BA9;&#x4ED6;&#x4EEC;&#x5E2E;&#x6211;&#x91CD;&#x7F6E;&#x4E86;&#x4E00;&#x4E0B;&#x3002;</p><p>&#x4E4B;&#x524D;&#x8FD8;&#x6709;&#x4E00;&#x6B21;&#x4F4F;&#x5728;&#x516C;&#x53F8;&#x63D0;&#x4F9B;&#x7684;&#x516C;&#x5BD3;&#x91CC;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x9510;&#x6377;&#x8DEF;&#x7531;&#x5668;&#x63D2;&#x5230;&#x5149;&#x732B;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8D26;&#x53F7;&#x5BC6;&#x7801;&#x590D;&#x5236;&#x8FC7;&#x53BB;&#xFF0C;&#x8FD9;&#x6B21;&#x6211;&#x6CA1;&#x6709;&#x5C1D;&#x8BD5;&#x3002;</p><h3 id="&#x767B;&#x5F55;&#x5149;&#x732B;&#x8D85;&#x7EA7;&#x7BA1;&#x7406;&#x5458;&#x540E;&#x53F0;"><a href="#&#x767B;&#x5F55;&#x5149;&#x732B;&#x8D85;&#x7EA7;&#x7BA1;&#x7406;&#x5458;&#x540E;&#x53F0;" class="headerlink" title="&#x767B;&#x5F55;&#x5149;&#x732B;&#x8D85;&#x7EA7;&#x7BA1;&#x7406;&#x5458;&#x540E;&#x53F0;"></a>&#x767B;&#x5F55;&#x5149;&#x732B;&#x8D85;&#x7EA7;&#x7BA1;&#x7406;&#x5458;&#x540E;&#x53F0;</h3><p>&#x7F51;&#x4E0A;&#x7684;&#x5F88;&#x591A;&#x5982;&#x4F55;&#x83B7;&#x5F97;&#x8D85;&#x7EA7;&#x7BA1;&#x7406;&#x5458;&#x5BC6;&#x7801;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6709;&#x627E;&#x7535;&#x4FE1;&#x5E08;&#x5085;&#x8981;&#x7684;&#xFF0C;&#x6709;&#x6253;&#x5BA2;&#x670D;&#x7535;&#x8BDD;&#x8981;&#x7684;&#xFF0C;&#x8FD8;&#x6709;&#x81EA;&#x5DF1;&#x60F3;&#x529E;&#x6CD5;&#x7834;&#x89E3;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x4F46;&#x6211;&#x8FD9;&#x91CC;&#x7684;&#x7535;&#x4FE1;&#x5E08;&#x5085;&#x88C5;&#x673A;&#x65F6;&#x5C31;&#x8DDF;&#x6211;&#x8BF4;&#x8D85;&#x7EA7;&#x7BA1;&#x7406;&#x5458;&#x5BC6;&#x7801;&#x662F;&#x52A8;&#x6001;&#x7684;&#x4ED6;&#x4E5F;&#x6CA1;&#x6709;&#xFF0C;&#x90FD;&#x662F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x4E0B;&#x53D1;&#xFF0C;&#x4E8E;&#x662F;&#x4E5F;&#x6CA1;&#x627E;&#x4ED6;&#x8981;&#x3002;</p><p>&#x5076;&#x7136;&#x53D1;&#x73B0;&#x5176;&#x5B9E;&#x4E0D;&#x9700;&#x8981;&#x8D85;&#x7EA7;&#x7BA1;&#x7406;&#x5458;&#x5BC6;&#x7801;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5728;&#x5149;&#x732B; IP &#x5730;&#x5740;&#x540E;&#x9762;&#x52A0;&#x4E0A;&#x7AEF;&#x53E3;&#x53F7; 8080&#xFF0C;&#x7528;&#x666E;&#x901A;&#x8D26;&#x6237;&#x5C31;&#x80FD;&#x767B;&#x5F55;&#x540E;&#x53F0;&#x4E86;&#xFF0C;&#x5982;&#x56FE;&#xFF1A;</p><p><img src="/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/01login.png"></p><p>&#x767B;&#x5F55;&#x540E;&#x7684;&#x9875;&#x9762;&#x5982;&#x56FE;&#xFF1A;</p><p><img src="/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/02mainpage.jpg"></p><p>&#x70B9;&#x51FB;&#x5DE6;&#x4FA7;<strong>&#x914D;&#x7F6E;&#x5411;&#x5BFC;</strong>&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8BBE;&#x7F6E;&#x8DEF;&#x7531;&#x8FD8;&#x662F;&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x9009;&#x62E9;&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#xFF0C;&#x70B9;&#x51FB;&#x4E0B;&#x4E00;&#x6B65;</p><p><img src="/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/03%E9%85%8D%E7%BD%AE%E5%90%91%E5%AF%BC.png"></p><p>&#x4E0B;&#x4E00;&#x6B65;&#x65E0;&#x7EBF;&#x7F51;&#x7EDC;&#x914D;&#x7F6E;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x914D;&#x7F6E;&#xFF0C;&#x6211;&#x662F;&#x76F4;&#x63A5;&#x5173;&#x6389;&#x4E86;</p><p><img src="/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/04%E5%85%89%E7%8C%AB%E6%97%A0%E7%BA%BF%E7%BD%91%E7%BB%9C%E9%85%8D%E7%BD%AE.png"></p><p>&#x63A5;&#x4E0B;&#x6765; iTV &#x8BBE;&#x7F6E;&#x9875;&#x9762;&#xFF0C;&#x76F4;&#x63A5;&#x4E0B;&#x4E00;&#x6B65;&#x5373;&#x53EF;</p><p><img src="/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/05itv.png"></p><p>&#x4E0B;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x7EC8;&#x7AEF;&#x5BC6;&#x7801;&#x4FEE;&#x6539;&#xFF0C;&#x4E0D;&#x7528;&#x5904;&#x7406;&#x76F4;&#x63A5;&#x4E0B;&#x4E00;&#x6B65;</p><p><img src="/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/06%E7%BB%88%E7%AB%AF%E7%99%BB%E5%BD%95%E5%AF%86%E7%A0%81%E4%BF%AE%E6%94%B9.png"></p><p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x786E;&#x8BA4;&#xFF0C;&#x786E;&#x8BA4;&#x62E8;&#x53F7;&#x7C7B;&#x578B;&#x4E3A;<strong>&#x7535;&#x8111;&#x62E8;&#x53F7;</strong>&#xFF0C;&#x70B9;&#x51FB;&#x5B8C;&#x6210;&#x3002;</p><p><img src="/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/07%E7%94%B5%E8%84%91%E6%8B%A8%E5%8F%B7.png"></p><h3 id="&#x8DEF;&#x7531;&#x5668;&#x8BBE;&#x7F6E;&#x62E8;&#x53F7;"><a href="#&#x8DEF;&#x7531;&#x5668;&#x8BBE;&#x7F6E;&#x62E8;&#x53F7;" class="headerlink" title="&#x8DEF;&#x7531;&#x5668;&#x8BBE;&#x7F6E;&#x62E8;&#x53F7;"></a>&#x8DEF;&#x7531;&#x5668;&#x8BBE;&#x7F6E;&#x62E8;&#x53F7;</h3><p>&#x63A5;&#x4E0B;&#x6765;&#x767B;&#x5F55;&#x8DEF;&#x7531;&#x5668;&#x540E;&#x53F0;&#xFF0C;&#x4EE5;&#x6211;&#x8FD9;&#x53F0;&#x4E2D;&#x5174;&#x8DEF;&#x7531;&#x5668;&#x4E3A;&#x4F8B;&#xFF0C;&#x70B9;&#x51FB;&#x5DE6;&#x4FA7;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x70B9;&#x51FB; WAN1&#xFF08;&#x4E3B;&#x8981;&#xFF09;&#xFF0C;&#x4E0A;&#x7F51;&#x65B9;&#x5F0F;&#x9009;&#x62E9;<strong>&#x62E8;&#x53F7;&#x4E0A;&#x7F51;&#xFF08;PPPoE&#xFF09;</strong>&#xFF0C;&#x586B;&#x5199;<strong>&#x4E0A;&#x7F51;&#x8D26;&#x53F7;</strong>&#x548C;<strong>&#x4E0A;&#x7F51;&#x5BC6;&#x7801;</strong>&#xFF0C;&#x70B9;&#x51FB;&#x63D0;&#x4EA4;&#x3002;</p><p><img src="/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/08%E8%B7%AF%E7%94%B1%E5%99%A8%E8%AE%BE%E7%BD%AE%E6%8B%A8%E5%8F%B7.png"></p><p>&#x81F3;&#x6B64;&#x5C31;&#x53EF;&#x4EE5;&#x7531;&#x8DEF;&#x7531;&#x5668;&#x62E8;&#x53F7;&#x4E0A;&#x7F51;&#xFF0C;&#x5149;&#x732B;&#x53EA;&#x63D0;&#x4F9B;&#x5149;&#x7535;&#x4FE1;&#x53F7;&#x8F6C;&#x6362;&#x529F;&#x80FD;&#x4E86;&#x3002;</p><h3 id="&#x5173;&#x95ED;&#x5149;&#x732B;-DHCP-&#x670D;&#x52A1;&#xFF08;&#x53EF;&#x9009;&#xFF09;"><a href="#&#x5173;&#x95ED;&#x5149;&#x732B;-DHCP-&#x670D;&#x52A1;&#xFF08;&#x53EF;&#x9009;&#xFF09;" class="headerlink" title="&#x5173;&#x95ED;&#x5149;&#x732B; DHCP &#x670D;&#x52A1;&#xFF08;&#x53EF;&#x9009;&#xFF09;"></a>&#x5173;&#x95ED;&#x5149;&#x732B; DHCP &#x670D;&#x52A1;&#xFF08;&#x53EF;&#x9009;&#xFF09;</h3><p>&#x767B;&#x5F55;&#x5149;&#x732B;&#x540E;&#x53F0;&#xFF08;&#x6B64;&#x65F6;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7528;&#x7F51;&#x7EBF;&#x8FDE;&#x63A5;&#x5149;&#x732B;&#x7684; LAN &#x53E3;&#x624D;&#x80FD;&#x767B;&#x5F55;&#x4E86;&#xFF09;&#xFF0C;&#x70B9;&#x51FB;<strong>&#x7F51;&#x7EDC;</strong> -&gt; <strong>IPV4 &#x8BBE;&#x7F6E;</strong>,&#x53D6;&#x6D88;&#x52FE;&#x9009; DHCP Server&#x3002;IPv6 &#x914D;&#x7F6E;&#x91CC;&#x4E5F;&#x540C;&#x6837;&#x8BBE;&#x7F6E;&#x3002;&#x70B9;&#x51FB;<strong>&#x4FDD;&#x5B58;/&#x5E94;&#x7528;</strong></p><p><img src="/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/09IPV4DHCP.png"></p><p><img src="/2025/08/22/Guangzhou-Telecom-ONT-to-Bridge-Mode/10ipv6DHCP.png"></p><h3 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h3><p>&#x8BBE;&#x7F6E;&#x597D;&#x4E4B;&#x540E;&#x7528;&#x4E86;&#x51E0;&#x5929;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#x7F51;&#x7EDC;&#x7A33;&#x5B9A;&#x6027;&#x6CA1;&#x611F;&#x89C9;&#x51FA;&#x6709;&#x4EFB;&#x4F55;&#x533A;&#x522B;&#xFF0C;&#x56E0;&#x4E3A;&#x4E4B;&#x524D;&#x7528;&#x5149;&#x732B;&#x62E8;&#x53F7;&#x4E5F;&#x633A;&#x7A33;&#x5B9A;&#x7684;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x6700;&amp;#x8FD1;&amp;#x7ED9;&amp;#x5BB6;&amp;#x91CC;&amp;#x6DFB;&amp;#x7F6E;&amp;#x4E86;&amp;#x4E00;&amp;#x53F0;&amp;#x5C0F;&amp;#x8BBE;&amp;#x5907;&amp;#x505A;&amp;#x5BB6;&amp;#x5EAD;&amp;#x670D;&amp;#x52A1;&amp;#x5668;&amp;#xFF0C;&amp;#x4E3A;&amp;#x4E86;&amp;#x7528;&amp;#x4E0A;&amp;#x8BBE;&amp;#x5907;&amp;#x7684; 2.5G &amp;#x7684;&amp;#x7F51;&amp;#x53E3;&amp;#xFF0C;&amp;#x987A;&amp;#x4FBF;&amp;#x5347;&amp;#x7EA7;&amp;#x4E86;&amp;#x4E0B;&amp;#x5185;&amp;#x7F51;&amp;#x73AF;&amp;#x5883;&amp;#x3002;&amp;#x672C;&amp;#x6253;&amp;#x7B97;&amp;#x4E70;&amp;#x4E2A; 2.5G &amp;#x4EA4;&amp;#x6362;&amp;#x673A;&amp;#xFF0C;&amp;#x5076;&amp;#x7136;&amp;#x53D1;&amp;#x73B0;&amp;#x5982;&amp;#x4ECA;&amp;#x4E24;&amp;#x767E;&amp;#x591A;&amp;#x5757;&amp;#x94B1;&amp;#x5C31;&amp;#x80FD;&amp;#x4E70;&amp;#x5230;&amp;#x5E26; 2 &amp;#x4E2A; 2.5G &amp;#x7F51;&amp;#x53E3;&amp;#x7684; WiFi7 &amp;#x8DEF;&amp;#x7531;&amp;#x5668;&amp;#x4E86;&amp;#x3002;&amp;#x6682;&amp;#x65F6;&amp;#x6211;&amp;#x4E5F;&amp;#x53EA;&amp;#x6709;&amp;#x4E00;&amp;#x53F0;&amp;#x8BBE;&amp;#x5907;&amp;#x9700;&amp;#x8981; 2.5G &amp;#x7F51;&amp;#x53E3;&amp;#xFF0C;&amp;#x7D22;&amp;#x6027;&amp;#x6CA1;&amp;#x4E70;&amp;#x4EA4;&amp;#x6362;&amp;#x673A;&amp;#x6539;&amp;#x4E70;&amp;#x8DEF;&amp;#x7531;&amp;#x5668;&amp;#x4E86;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x4E4B;&amp;#x524D;&amp;#x5149;&amp;#x732B;&amp;#x4E00;&amp;#x76F4;&amp;#x662F;&amp;#x9ED8;&amp;#x8BA4;&amp;#x7684;&amp;#x8DEF;&amp;#x7531;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF0C;&amp;#x751A;&amp;#x81F3;&amp;#x4E00;&amp;#x5EA6;&amp;#x76F4;&amp;#x63A5;&amp;#x7528;&amp;#x5149;&amp;#x732B;&amp;#x7684; WiFi &amp;#x4FE1;&amp;#x53F7;&amp;#xFF0C;&amp;#x73B0;&amp;#x5728;&amp;#x65E2;&amp;#x7136;&amp;#x6709;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x8DEF;&amp;#x7531;&amp;#x5668;&amp;#x4E86;&amp;#xFF0C;&amp;#x987A;&amp;#x4FBF;&amp;#x6539;&amp;#x6210;&amp;#x6865;&amp;#x63A5;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF0C;&amp;#x8BA9;&amp;#x7F51;&amp;#x7EDC;&amp;#x73AF;&amp;#x5883;&amp;#x66F4;&amp;#x7A33;&amp;#x5B9A;&amp;#x4E00;&amp;#x4E9B;&amp;#xFF0C;&amp;#x540E;&amp;#x7EED;&amp;#x8FDC;&amp;#x7A0B;&amp;#x6298;&amp;#x817E;&amp;#x5BB6;&amp;#x5EAD;&amp;#x670D;&amp;#x52A1;&amp;#x5668;&amp;#x4E5F;&amp;#x65B9;&amp;#x4FBF;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
  </entry>
  
  <entry>
    <title>为 Outlook 设置开机启动</title>
    <link href="https://shiqingxu.gthub.io/2025/08/21/setting-startup-for-outlook/"/>
    <id>https://shiqingxu.gthub.io/2025/08/21/setting-startup-for-outlook/</id>
    <published>2025-08-21T00:26:55.000Z</published>
    <updated>2025-09-03T00:38:44.942Z</updated>
    
    <content type="html"><![CDATA[<p>&#x7531;&#x4E8E;&#x8D35;&#x53F8;&#x81EA;&#x7814;&#x7684;&#x529E;&#x516C;IM&#x5DE5;&#x5177;&#x5F53;&#x524D;bug&#x8FD8;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x90AE;&#x4EF6;&#x529F;&#x80FD;&#x7684;&#x53EF;&#x7528;&#x6027;&#x5F88;&#x5DEE;&#xFF0C;&#x6545;&#x627E;&#x4EA7;&#x54C1;&#x7533;&#x8BF7;&#x5230;&#x4E86;&#x4F7F;&#x7528;&#x7B2C;&#x4E09;&#x65B9;&#x90AE;&#x4EF6;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x4F7F;&#x7528;Outlook&#x3002;</p><span id="more"></span><p>&#x5728;Windows 10&#x7CFB;&#x7EDF;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;IM&#x5DE5;&#x5177;&#x548C;Outlook&#x90FD;&#x4E0D;&#x80FD;&#x968F;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x3002;Outlook&#x662F;&#x6CA1;&#x6709;&#x8FD9;&#x4E00;&#x8BBE;&#x7F6E;&#x7684;&#x5F00;&#x5173;&#xFF0C;&#x800C;IM&#x5DE5;&#x5177;&#x5219;&#x662F;&#x8BBE;&#x7F6E;&#x4E86;&#x4E0D;&#x4F1A;&#x751F;&#x6548;&#xFF0C;&#x5927;&#x6982;&#x53EA;&#x662F;&#x505A;&#x4E86;&#x524D;&#x7AEF;&#x7684;&#x5F00;&#x5173;&#xFF0C;&#x540E;&#x7AEF;&#x529F;&#x80FD;&#x6CA1;&#x6709;&#x505A;&#x3002;</p><p>&#x8BD5;&#x8FC7;&#x5728;&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#x91CC;&#x7684;&#x542F;&#x52A8;&#x9875;&#x9762;&#x5F00;&#x542F;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x4F3C;&#x4E4E;&#x53EA;&#x6709;&#x6700;&#x5F00;&#x59CB;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x65F6;&#x8F6F;&#x4EF6;&#x81EA;&#x5DF1;&#x8BBE;&#x7F6E;&#x4E86;&#x5F00;&#x673A;&#x542F;&#x52A8;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x4E0D;&#x8FC7;&#x8FD8;&#x662F;&#x627E;&#x5230;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x5F00;&#x673A;&#x542F;&#x52A8;&#x3002;</p><h3 id="&#x65B9;&#x6CD5;-A&#xFF1A;Windows-&#x542F;&#x52A8;&#x9879;&#x5F00;&#x5173;"><a href="#&#x65B9;&#x6CD5;-A&#xFF1A;Windows-&#x542F;&#x52A8;&#x9879;&#x5F00;&#x5173;" class="headerlink" title="&#x65B9;&#x6CD5; A&#xFF1A;Windows &#x542F;&#x52A8;&#x9879;&#x5F00;&#x5173;"></a>&#x65B9;&#x6CD5; A&#xFF1A;Windows &#x542F;&#x52A8;&#x9879;&#x5F00;&#x5173;</h3><ol><li>Windows &#x8BBE;&#x7F6E; &gt; &#x5E94;&#x7528; &gt; &#x542F;&#x52A8;&#x3002;</li><li>&#x5728;&#x5217;&#x8868;&#x4E2D;&#x627E;&#x5230;Outlook&#xFF0C;&#x5C06;&#x5176;&#x6253;&#x5F00;&#x3002;</li><li>&#x5982;&#x679C;&#x5217;&#x8868;&#x4E2D;&#x6CA1;&#x6709; Outlook&#xFF0C;&#x5219;&#x7528;&#x65B9;&#x6CD5; B&#x3002;</li></ol><h3 id="&#x65B9;&#x6CD5;-B&#xFF1A;&#x542F;&#x52A8;&#x6587;&#x4EF6;&#x5939;"><a href="#&#x65B9;&#x6CD5;-B&#xFF1A;&#x542F;&#x52A8;&#x6587;&#x4EF6;&#x5939;" class="headerlink" title="&#x65B9;&#x6CD5; B&#xFF1A;&#x542F;&#x52A8;&#x6587;&#x4EF6;&#x5939;"></a>&#x65B9;&#x6CD5; B&#xFF1A;&#x542F;&#x52A8;&#x6587;&#x4EF6;&#x5939;</h3><ol><li>&#x6309; Win+R&#xFF0C;&#x8F93;&#x5165; shell:startup &#x56DE;&#x8F66;&#xFF0C;&#x6253;&#x5F00;&#x201C;&#x542F;&#x52A8;&#x201D;&#x6587;&#x4EF6;&#x5939;&#x3002;</li><li>&#x5C06;&#x5F00;&#x59CB;&#x83DC;&#x5355;&#x91CC;&#x7684; Outlook &#x5FEB;&#x6377;&#x65B9;&#x5F0F;&#x62D6;&#x5165;&#x6B64;&#x6587;&#x4EF6;&#x5939;&#xFF08;&#x6216;&#x53F3;&#x952E;&#x65B0;&#x5EFA;&#x5FEB;&#x6377;&#x65B9;&#x5F0F;&#xFF0C;&#x76EE;&#x6807;&#x6307;&#x5411; OUTLOOK.EXE&#xFF09;&#x3002;<ul><li>&#x5E38;&#x89C1;&#x8DEF;&#x5F84;&#xFF1A;C:\Program Files\Microsoft Office\root\Office16\OUTLOOK.EXE</li></ul></li><li>&#x4E0B;&#x6B21;&#x767B;&#x5F55; Windows &#x5373;&#x4F1A;&#x81EA;&#x52A8;&#x542F;&#x52A8;&#x3002;</li></ol><h3 id="&#x65B9;&#x6CD5;-C&#xFF1A;&#x4EFB;&#x52A1;&#x8BA1;&#x5212;&#x7A0B;&#x5E8F;"><a href="#&#x65B9;&#x6CD5;-C&#xFF1A;&#x4EFB;&#x52A1;&#x8BA1;&#x5212;&#x7A0B;&#x5E8F;" class="headerlink" title="&#x65B9;&#x6CD5; C&#xFF1A;&#x4EFB;&#x52A1;&#x8BA1;&#x5212;&#x7A0B;&#x5E8F;"></a>&#x65B9;&#x6CD5; C&#xFF1A;&#x4EFB;&#x52A1;&#x8BA1;&#x5212;&#x7A0B;&#x5E8F;</h3><ol><li>&#x6253;&#x5F00;&#x201C;&#x4EFB;&#x52A1;&#x8BA1;&#x5212;&#x7A0B;&#x5E8F;&#x201D;&#xFF0C;&#x521B;&#x5EFA;&#x57FA;&#x672C;&#x4EFB;&#x52A1;&#x3002;</li><li>&#x89E6;&#x53D1;&#x5668;&#x9009;&#x201C;&#x767B;&#x5F55;&#x65F6;&#x201D;&#xFF0C;&#x64CD;&#x4F5C;&#x9009;&#x201C;&#x542F;&#x52A8;&#x7A0B;&#x5E8F;&#x201D;&#xFF0C;&#x7A0B;&#x5E8F;/&#x811A;&#x672C;&#x6307;&#x5411; OUTLOOK.EXE&#x3002;</li><li>&#x5B8C;&#x6210;&#x5411;&#x5BFC;&#x4FDD;&#x5B58;&#x3002;</li></ol><p>&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x53D1;&#x73B0;&#x65B9;&#x6CD5;A&#x884C;&#x4E0D;&#x901A;&#xFF0C;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x7684;&#x5E94;&#x7528;&#x542F;&#x52A8;&#x5217;&#x8868;&#x5C55;&#x793A;&#x7684;&#x5F00;&#x673A;&#x8F6F;&#x4EF6;&#x6BD4;&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#x7684;&#x542F;&#x52A8;&#x5217;&#x8868;&#x91CC;&#x7684;&#x66F4;&#x5C11;&#x3002;&#x4E8E;&#x662F;&#x901A;&#x8FC7;&#x65B9;&#x6CD5;B&#x6210;&#x529F;&#x5B9E;&#x73B0;&#x4E86;&#x5F00;&#x673A;&#x542F;&#x52A8;&#x3002;</p><p>&#x4F7F;&#x7528;Outlook&#x4F53;&#x9A8C;&#x672C;&#x5E94;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x4F46;&#x8D35;&#x53F8;&#x5728;&#x5207;&#x6362;&#x529E;&#x516C;&#x7CFB;&#x7EDF;&#x671F;&#x95F4;&#x7684;&#x95EE;&#x9898;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x73B0;&#x5728;Outlook&#x8FD9;&#x91CC;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x5C06;&#x7EC4;&#x7EC7;&#x901A;&#x8BAF;&#x5F55;&#x540C;&#x6B65;&#x8FC7;&#x6765;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x51FA;&#x9519;&#xFF0C;&#x5F53;&#x7ED9;&#x5927;&#x91CF;&#x4EBA;&#x5458;&#x53D1;&#x90AE;&#x4EF6;&#x65F6;&#x6211;&#x9700;&#x8981;&#x7528;&#x7F51;&#x9875;&#x7248;&#x3002;&#x4F46;&#x7F51;&#x9875;&#x7248;&#x867D;&#x7136;&#x6709;&#x901A;&#x8BAF;&#x5F55;&#xFF0C;&#x4F46;&#x53EA;&#x663E;&#x793A;&#x4E2A;&#x90AE;&#x7BB1;&#x5730;&#x5740;&#xFF0C;&#x8BE6;&#x60C5;&#x662F;&#x4E00;&#x70B9;&#x513F;&#x4E5F;&#x65E0;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x5148;&#x53BB;IM&#x4E0A;&#x786E;&#x8BA4;&#x597D;&#x90AE;&#x7BB1;&#x5730;&#x5740;&#x3002;&#x7F51;&#x9875;&#x7248;&#x662F;&#x76EE;&#x524D;bug&#x6700;&#x5C11;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x7528;&#x7684;&#x662F;coremail&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x3002;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x6587;&#x6863;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x8FD8;&#x5728;&#x5207;&#x6362;&#x671F;&#x95F4;&#xFF0C;&#x4F30;&#x8BA1;&#x540E;&#x7EED;&#x7EC4;&#x7EC7;&#x901A;&#x8BAF;&#x5F55;&#x5BF9;&#x63A5;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x6536;&#x53D1;&#x90AE;&#x4EF6;&#x53EF;&#x4EE5;&#x53EA;&#x5728;Outlook&#x5185;&#x5B8C;&#x6210;&#x4E86;&#x3002;</p><hr><p>&#x8BB0;&#x5F55;&#x5B8C;&#x8FD9;&#x4E2A;&#x4E8B;&#x513F;&#xFF0C;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x81EA;&#x7814;IM&#x5DE5;&#x5177;&#x65E5;&#x5386;&#x7684;&#x5947;&#x602A;bug&#x3002;&#x6211;&#x672C;&#x4EBA;&#x5BF9;&#x8BE5;&#x5DE5;&#x5177;&#x7684;&#x5BBD;&#x5BB9;&#x5EA6;&#x662F;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x77E5;&#x9053;&#x505A;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x975E;&#x5E38;&#x96BE;&#xFF0C;&#x6240;&#x4EE5;&#x90AE;&#x7BB1;&#x8FD9;&#x4E48;&#x91CD;&#x8981;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x9047;&#x5230;bug&#x6211;&#x90FD;&#x662F;&#x627E;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x800C;&#x4E0D;&#x62B1;&#x6028;&#x3002;&#x4F46;&#x65E5;&#x5386;&#x8FD9;&#x4E2A;bug&#x771F;&#x7684;&#x662F;&#x503C;&#x5F97;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x3002;&#x5177;&#x4F53;&#x8868;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p><ol><li>&#x8BA2;&#x9605;&#x4F01;&#x4E1A;&#x5FAE;&#x4FE1;&#x7684;&#x65E5;&#x5386;&#xFF0C;&#x53CD;&#x590D;&#x5C1D;&#x8BD5;&#x591A;&#x6B21;&#xFF0C;&#x4E0D;&#x6210;&#x529F;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x65E5;&#x7A0B;&#x88AB;&#x540C;&#x6B65;&#x4E86;&#x8FC7;&#x53BB;&#xFF1B;</li><li>&#x867D;&#x6709;&#x4E00;&#x4E2A;&#x65E5;&#x7A0B;&#x88AB;&#x540C;&#x6B65;&#x4E86;&#x8FC7;&#x53BB;&#xFF0C;&#x4F46;&#x5DE6;&#x4FA7;&#x300C;&#x6211;&#x7684;&#x65E5;&#x5386;&#x300D;&#x4E0B;&#x9762;&#x53C8;&#x4E0D;&#x663E;&#x793A;&#x8BA2;&#x9605;&#x7684;&#x65E5;&#x5386;&#xFF1B;</li><li>&#x8BE5;&#x65E5;&#x5386;&#x662F;&#x5728;&#x5468;&#x4E94;&#xFF0C;&#x4F46;&#x5728;&#x5468;&#x89C6;&#x56FE;&#x4E0A;&#x663E;&#x793A;&#x5728;&#x5468;&#x56DB;&#xFF0C;&#x70B9;&#x5F00;&#x8FD9;&#x4E2A;&#x65E5;&#x7A0B;&#x8BE6;&#x60C5;&#xFF0C;&#x663E;&#x793A;&#x7684;&#x53C8;&#x662F;&#x5468;&#x4E94;&#xFF1B;</li></ol><p><img src="/2025/08/21/setting-startup-for-outlook/calendar.jpg" alt="&#x65E5;&#x7A0B;&#x9519;&#x8BEF;"></p><p>&#x8FD9;&#x4E2A;bug&#x8FC7;&#x4E8E;&#x5F71;&#x54CD;&#x65E5;&#x5E38;&#x529E;&#x516C;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x8D76;&#x7D27;&#x89E3;&#x51B3;&#x5427;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x7531;&amp;#x4E8E;&amp;#x8D35;&amp;#x53F8;&amp;#x81EA;&amp;#x7814;&amp;#x7684;&amp;#x529E;&amp;#x516C;IM&amp;#x5DE5;&amp;#x5177;&amp;#x5F53;&amp;#x524D;bug&amp;#x8FD8;&amp;#x6BD4;&amp;#x8F83;&amp;#x591A;&amp;#xFF0C;&amp;#x90AE;&amp;#x4EF6;&amp;#x529F;&amp;#x80FD;&amp;#x7684;&amp;#x53EF;&amp;#x7528;&amp;#x6027;&amp;#x5F88;&amp;#x5DEE;&amp;#xFF0C;&amp;#x6545;&amp;#x627E;&amp;#x4EA7;&amp;#x54C1;&amp;#x7533;&amp;#x8BF7;&amp;#x5230;&amp;#x4E86;&amp;#x4F7F;&amp;#x7528;&amp;#x7B2C;&amp;#x4E09;&amp;#x65B9;&amp;#x90AE;&amp;#x4EF6;&amp;#x5BA2;&amp;#x6237;&amp;#x7AEF;&amp;#x7684;&amp;#x6743;&amp;#x9650;&amp;#xFF0C;&amp;#x91CD;&amp;#x65B0;&amp;#x5F00;&amp;#x59CB;&amp;#x4F7F;&amp;#x7528;Outlook&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
  </entry>
  
  <entry>
    <title>重新部署基于 Cloudflare workers &amp; pages 的代理</title>
    <link href="https://shiqingxu.gthub.io/2025/04/14/re-deploy-CF-proxy/"/>
    <id>https://shiqingxu.gthub.io/2025/04/14/re-deploy-CF-proxy/</id>
    <published>2025-04-14T03:24:44.000Z</published>
    <updated>2025-09-03T00:38:44.797Z</updated>
    
    <content type="html"><![CDATA[<p>&#x5F88;&#x4E45;&#x4E4B;&#x524D;&#x57FA;&#x4E8E; Cloudflare workers &#x642D;&#x5EFA;&#x7684;&#x81EA;&#x7528;&#x4EE3;&#x7406;&#x4E00;&#x76F4;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#xFF0C;&#x5373;&#x4F7F;&#x5728; Cloudflare &#x5B98;&#x65B9;&#x8868;&#x793A;&#x8981;&#x6253;&#x51FB;&#x4EE3;&#x7406;&#x7C7B;&#x5E94;&#x7528;&#x4E4B;&#x540E; &#xFF0C;&#x4E5F;&#x6CA1;&#x51FA;&#x8FC7;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x901F;&#x5EA6;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x53EF;&#x62B1;&#x6028;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#x4E00;&#x76F4;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x67D0;&#x4E9B;&#x76F8;&#x5BF9;&#x5E38;&#x7528;&#x7684;&#x7F51;&#x7AD9;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#xFF0C;&#x4F8B;&#x5982; z-library&#x3002;</p><span id="more"></span><p>&#x9047;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x7F51;&#x7AD9;&#x901A;&#x5E38;&#x4F1A;&#x4E34;&#x65F6;&#x5207;&#x6362;&#x5230;&#x5176;&#x5B83;&#x7EBF;&#x8DEF;&#xFF0C;&#x8FD1;&#x671F;&#x64CD;&#x4F5C;&#x6BD4;&#x8F83;&#x9891;&#x7E41;&#xFF0C;&#x6545;&#x5BFB;&#x601D;&#x5BF9; CF  &#x7684;&#x8FD9;&#x6761;&#x7EBF;&#x8DEF;&#x8FDB;&#x884C;&#x5347;&#x7EA7;&#x4EE5;&#x6539;&#x5584;&#x8BE5;&#x72B6;&#x51B5;&#xFF0C;&#x67E5;&#x8D44;&#x6599;&#x53D1;&#x73B0;&#x642D;&#x5EFA;&#x65B9;&#x6CD5;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x8F83;&#x5927;&#x66F4;&#x65B0;&#x3002;</p><p>&#x6309;&#x7167;&#x6559;&#x7A0B;&#x4E00;&#x8DEF;&#x505A;&#x4E0B;&#x6765;&#xFF0C;&#x6BD4;&#x8F83;&#x987A;&#x5229;&#xFF0C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x89E3;&#x9501;&#x4E86;&#x4E00;&#x4E9B;&#x4E4B;&#x524D;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x4F46;&#x5E76;&#x975E;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x6709;&#x6548;&#xFF0C;&#x4E0D;&#x8FC7;&#x95EE;&#x9898;&#x4E0D;&#x5927;&#xFF0C;&#x6CA1;&#x90A3;&#x4E48;&#x5E38;&#x7528;&#x7684;&#x7F51;&#x7AD9;&#x8FD8;&#x662F;&#x7EE7;&#x7EED;&#x901A;&#x8FC7;&#x4E34;&#x65F6;&#x5207;&#x6362;&#x7EBF;&#x8DEF;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x3002;</p><p>&#x8003;&#x8651;&#x5230;&#x4E0B;&#x4E00;&#x6B21;&#x5347;&#x7EA7;&#x65F6;&#x5927;&#x6982;&#x7387;&#x4F9D;&#x7136;&#x8981;&#x53C2;&#x8003;&#x7F51;&#x7EDC;&#x4E0A;&#x6700;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#x800C;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6B64;&#x5904;&#x5C31;&#x4E0D;&#x8BE6;&#x8FF0;&#x8FC7;&#x7A0B;&#x4E86;&#xFF0C;&#x4EC5;&#x7B80;&#x5355;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x6B65;&#x9AA4;&#x3002;</p><ul><li>&#x65B0;&#x5EFA;&#x4E00;&#x4E2A; GitHub repo&#xFF0C;&#x5C06; BPB Panel &#x9879;&#x76EE;&#x4EE3;&#x7801;&#x540C;&#x6B65;&#x5230;&#x8BE5;&#x4ED3;&#x5E93;</li><li>&#x914D;&#x7F6E;&#x5E76;&#x6267;&#x884C; GitHub Actions</li><li>CF &#x4E0A;&#x521B;&#x5EFA; Pages&#xFF0C;&#x8FDE;&#x63A5;&#x5230;&#x4E0A;&#x4E00;&#x6B65;&#x7684; GitHub repo</li><li>&#x7ED1;&#x5B9A;&#x81EA;&#x5B9A;&#x4E49;&#x57DF;&#x540D;&#xFF08;&#x53EF;&#x9009;&#xFF09;</li><li>&#x8BBE;&#x7F6E;&#x53D8;&#x91CF;&#xFF08;UUID&#x3001;PROXYIP&#x3001;TR_PASS&#x7B49;&#xFF09;</li><li>&#x521B;&#x5EFA;&#x4E00;&#x4E2A; KV &#x547D;&#x540D;&#x7A7A;&#x95F4;&#x5E76;&#x7ED1;&#x5B9A;&#xFF0C;&#x540D;&#x79F0;&#x81EA;&#x5B9A;&#x4E49;&#x4F46;&#x4E0D;&#x80FD;&#x5305;&#x542B; bpb &#x5B57;&#x773C;</li><li>&#x91CD;&#x8BD5;&#x90E8;&#x7F72; Pages</li><li>&#x8BBF;&#x95EE;&#x81EA;&#x5B9A;&#x4E49;&#x57DF;&#x540D;/panel&#xFF0C;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6210;&#x529F;&#x90E8;&#x7F72;</li><li>&#x7B2C;&#x4E00;&#x6B21;&#x8FDB;&#x5165;&#x65F6;&#x4F1A;&#x88AB;&#x8981;&#x6C42;&#x4FEE;&#x6539;&#x5BC6;&#x7801;&#xFF0C;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x5F3A;&#x5BC6;&#x7801;</li><li>&#x914D;&#x7F6E; BPB &#x9762;&#x677F;&#x53C2;&#x6570;</li><li>&#x4FDD;&#x5B58;&#x8BBE;&#x7F6E;</li><li>&#x5BFC;&#x51FA;&#x8282;&#x70B9;&#x8BA2;&#x9605;&#x94FE;&#x63A5;&#x3002;</li></ul><p>&#x4E4B;&#x540E;&#x5373;&#x53EF;&#x901A;&#x8FC7;&#x76F8;&#x5173;&#x5BA2;&#x6237;&#x7AEF;&#x8BA2;&#x9605;&#x8BE5;&#x94FE;&#x63A5;&#x4F7F;&#x7528;&#x4E86;&#x3002;</p><p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#x6BD4;&#x4E4B;&#x524D;&#x76F4;&#x63A5;&#x5728; workers &#x91CC;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x5E76;&#x586B;&#x4E2A; UUID &#x548C; PROXY_IP &#x7684;&#x65B9;&#x5F0F;&#x590D;&#x6742;&#x4E86;&#x4E00;&#x70B9;&#x70B9;&#xFF0C;&#x4F46;&#x6309;&#x6B65;&#x9AA4;&#x64CD;&#x4F5C;&#x5012;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x96BE;&#x5EA6;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x5F88;&amp;#x4E45;&amp;#x4E4B;&amp;#x524D;&amp;#x57FA;&amp;#x4E8E; Cloudflare workers &amp;#x642D;&amp;#x5EFA;&amp;#x7684;&amp;#x81EA;&amp;#x7528;&amp;#x4EE3;&amp;#x7406;&amp;#x4E00;&amp;#x76F4;&amp;#x7A33;&amp;#x5B9A;&amp;#x8FD0;&amp;#x884C;&amp;#xFF0C;&amp;#x5373;&amp;#x4F7F;&amp;#x5728; Cloudflare &amp;#x5B98;&amp;#x65B9;&amp;#x8868;&amp;#x793A;&amp;#x8981;&amp;#x6253;&amp;#x51FB;&amp;#x4EE3;&amp;#x7406;&amp;#x7C7B;&amp;#x5E94;&amp;#x7528;&amp;#x4E4B;&amp;#x540E; &amp;#xFF0C;&amp;#x4E5F;&amp;#x6CA1;&amp;#x51FA;&amp;#x8FC7;&amp;#x4EC0;&amp;#x4E48;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x901F;&amp;#x5EA6;&amp;#x4E5F;&amp;#x6CA1;&amp;#x4EC0;&amp;#x4E48;&amp;#x53EF;&amp;#x62B1;&amp;#x6028;&amp;#x7684;&amp;#x3002;&amp;#x4E0D;&amp;#x8FC7;&amp;#x4E00;&amp;#x76F4;&amp;#x6709;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x67D0;&amp;#x4E9B;&amp;#x76F8;&amp;#x5BF9;&amp;#x5E38;&amp;#x7528;&amp;#x7684;&amp;#x7F51;&amp;#x7AD9;&amp;#x65E0;&amp;#x6CD5;&amp;#x8BBF;&amp;#x95EE;&amp;#xFF0C;&amp;#x4F8B;&amp;#x5982; z-library&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
  </entry>
  
  <entry>
    <title>蜻蜓鼠标 R1 SE 开箱设置</title>
    <link href="https://shiqingxu.gthub.io/2024/11/12/setting-new-mouse/"/>
    <id>https://shiqingxu.gthub.io/2024/11/12/setting-new-mouse/</id>
    <published>2024-11-11T21:03:27.000Z</published>
    <updated>2025-09-03T00:38:44.934Z</updated>
    
    <content type="html"><![CDATA[<p>&#x4E4B;&#x524D;&#x7528;&#x4E86;&#x4E00;&#x4E24;&#x5E74;&#x7684;&#x7F57;&#x6280;M590&#x9F20;&#x6807;&#x51FA;&#x73B0;&#x4E00;&#x70B9;&#x95EE;&#x9898;&#xFF0C;&#x88AB;&#x4EBA;&#x63A8;&#x8350;&#x4E70;&#x4E86;&#x4E2A;&#x8C8C;&#x4F3C;&#x662F;&#x4E2A;&#x56FD;&#x4EA7;&#x65B0;&#x54C1;&#x724C;&#x7684;&#x873B;&#x8713;R1 SE&#x3002;&#x5230;&#x624B;&#x53D1;&#x73B0;&#x9F20;&#x6807;&#x4E2A;&#x5934;&#x633A;&#x5927;&#x91CD;&#x91CF;&#x5F88;&#x8F7B;&#xFF0C;&#x5EC9;&#x4EF7;&#x611F;&#x6BD4;&#x8F83;&#x91CD;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E0D;&#x5230;&#x4E00;&#x767E;&#x5757;&#x94B1;&#x7684;&#x9F20;&#x6807;&#x4E5F;&#x4E0D;&#x8981;&#x5565;&#x81EA;&#x884C;&#x8F66;&#x4E86;&#x3002;</p><span id="more"></span><h3 id="&#x8BBE;&#x7F6E;"><a href="#&#x8BBE;&#x7F6E;" class="headerlink" title="&#x8BBE;&#x7F6E;"></a>&#x8BBE;&#x7F6E;</h3><p>&#x65E0;&#x7EBF;&#x63A5;&#x6536;&#x5668;&#x85CF;&#x5728;&#x9F20;&#x6807;&#x5E95;&#x90E8;&#x7684;&#x4ED3;&#x91CC;&#xFF0C;&#x7531;&#x4E8E;&#x7535;&#x8111;&#x6CA1;&#x6709;USB-A&#x63A5;&#x53E3;&#xFF0C;&#x5C31;&#x63D2;&#x5728;&#x5916;&#x63A5;&#x663E;&#x793A;&#x5668;&#x4E0A;&#x4E86; &#xFF0C;&#x63D2;&#x4E0A;&#x540E;&#x76F4;&#x63A5;&#x5C31;&#x80FD;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x8FC7;&#x6709;&#x4E24;&#x4E2A;&#x5C0F;&#x95EE;&#x9898;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x3002;</p><p>&#x4E00;&#x662F;&#x9ED8;&#x8BA4;&#x7684;DPI&#x592A;&#x4F4E;&#xFF0C;&#x51E0;&#x4E4E;&#x6CA1;&#x6CD5;&#x7528;&#x3002;&#x5382;&#x5BB6;&#x4E5F;&#x6CA1;&#x63D0;&#x4F9B;Mac&#x7248;&#x7684;&#x9A71;&#x52A8;&#xFF0C;&#x4E0D;&#x77E5;&#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#xFF0C;&#x627E;&#x534A;&#x5929;&#x6700;&#x540E;&#x53D1;&#x73B0;&#x6709;&#x4E2A;&#x5904;&#x4E8E;&#x6D4B;&#x8BD5;&#x72B6;&#x6001;&#x7684;&#x7F51;&#x9875;&#x7248;&#x9A71;&#x52A8;&#xFF0C;&#x901A;&#x8FC7;&#x5176;&#x8BBE;&#x7F6E;&#x597D;&#x4E86;DPI&#x3002;&#x540E;&#x6765;&#x53D1;&#x73B0;&#x9F20;&#x6807;&#x80CC;&#x90E8;&#x5176;&#x5B9E;&#x662F;&#x6709;&#x4E2A;&#x5207;&#x6362;DPI&#x7684;&#x6309;&#x94AE;&#x548C;&#x6307;&#x793A;&#x706F;&#x7684;&#xFF0C;&#x4E0D;&#x7528;&#x627E;&#x9A71;&#x52A8;&#x90A3;&#x4E48;&#x9EBB;&#x70E6;&#x3002;</p><p><img src="/2024/11/12/setting-new-mouse/image-20241112041157637.png" alt="DPI&#x8BBE;&#x7F6E;&#x6309;&#x94AE;"></p><p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x9F20;&#x6807;&#x6EDA;&#x8F6E;&#x7684;&#x6EDA;&#x52A8;&#x65B9;&#x5411;&#x4E0E;&#x4E60;&#x60EF;&#x7684;win&#x65B9;&#x5411;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5728;&#x7CFB;&#x7EDF;&#x7684;&#x9F20;&#x6807;&#x8BBE;&#x7F6E;&#x91CC;&#x53D6;&#x6D88;&#x52FE;&#x9009;&#x81EA;&#x7136;&#x6EDA;&#x52A8;&#x53EF;&#x89E3;&#xFF0C;&#x4E0D;&#x8FC7;&#x53C8;&#x4F1A;&#x5BFC;&#x81F4;&#x89E6;&#x63A7;&#x677F;&#x7684;&#x65B9;&#x5411;&#x53CD;&#x8F6C;&#x3002;</p><p><img src="/2024/11/12/setting-new-mouse/image-20241112040245979.png" alt="&#x5E73;&#x6ED1;&#x6EDA;&#x52A8;"></p><p>&#x6700;&#x540E;&#x901A;&#x8FC7;&#x7B2C;&#x4E09;&#x65B9;&#x8F6F;&#x4EF6;<a href="https://github.com/Caldis/Mos">Mos</a>&#x89E3;&#x51B3;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x4E4B;&#x524D;&#x5C31;&#x5B89;&#x88C5;&#x4E86;&#xFF0C;&#x5F53;&#x65F6;&#x662F;&#x7528;&#x4E8E;&#x7F13;&#x89E3;&#x9F20;&#x6807;&#x6EDA;&#x52A8;&#x4E0D;&#x591F;&#x5E73;&#x6ED1;&#x7684;&#x95EE;&#x9898;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5728;&#x8F6F;&#x4EF6;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x7F6E;&#x91CC;&#x52FE;&#x9009;&#x300E;&#x7FFB;&#x8F6C;&#x65B9;&#x5411;&#x300F;&#x5373;&#x53EF;&#x3002;</p><p><img src="/2024/11/12/setting-new-mouse/image-20241112040350784.png" alt="&#x7FFB;&#x8F6C;&#x65B9;&#x5411;"></p><p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x95EE;&#x9898;&#x6BD4;&#x8F83;&#x70E6;&#x4EBA;&#xFF0C;&#x6211;&#x7535;&#x8111;&#x4E0A;&#x540C;&#x65F6;&#x63D2;&#x7740;&#x7F57;&#x6280;&#x952E;&#x76D8;&#x7684;2.4G&#x65E0;&#x7EBF;&#x63A5;&#x6536;&#x5668;&#xFF0C;&#x9996;&#x6B21;&#x901A;&#x8FC7;2.4G&#x65E0;&#x7EBF;&#x63A5;&#x6536;&#x5668;&#x53CA;&#x84DD;&#x7259;&#x8FDE;&#x63A5;&#x8FD9;&#x6B3E;&#x9F20;&#x6807;&#x65F6;&#x7535;&#x8111;&#x90FD;&#x4F1A;&#x8BA9;&#x91CD;&#x65B0;&#x8BC6;&#x522B;&#x5916;&#x63A5;&#x952E;&#x76D8;&#x3002;&#x751A;&#x81F3;&#x6BCF;&#x6B21;&#x7ED9;&#x9F20;&#x6807;&#x5145;&#x7535;&#xFF0C;&#x62D4;&#x6389;&#x5145;&#x7535;&#x7EBF;&#x4E4B;&#x540E;&#x4E5F;&#x4F1A;&#x89E6;&#x53D1;&#x3002;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x65E0;&#x89C6;&#x76F4;&#x63A5;&#x9000;&#x51FA;&#xFF0C;&#x4F46;&#x6BD4;&#x8F83;&#x5F71;&#x54CD;&#x5FC3;&#x60C5;&#x3002;</p><p><img src="/2024/11/12/setting-new-mouse/image-20241112041940629.png" alt="&#x952E;&#x76D8;&#x68C0;&#x6D4B;1"></p><p><img src="/2024/11/12/setting-new-mouse/image-20241112041817899.png" alt="&#x952E;&#x76D8;&#x68C0;&#x6D4B;2"></p><h3 id="&#x5173;&#x4E8E;&#x5145;&#x7535;"><a href="#&#x5173;&#x4E8E;&#x5145;&#x7535;" class="headerlink" title="&#x5173;&#x4E8E;&#x5145;&#x7535;"></a>&#x5173;&#x4E8E;&#x5145;&#x7535;</h3><p>&#x6211;&#x4E00;&#x76F4;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x5145;&#x7535;&#x5F0F;&#x7684;&#x9F20;&#x6807;&#xFF0C;&#x800C;&#x662F;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;&#x5E72;&#x7535;&#x6C60;&#x7684;&#xFF0C;&#x4E4B;&#x524D;&#x7528;&#x4E86;&#x51E0;&#x5E74;&#x7684;&#x7F57;&#x6280;M590&#x8FD9;&#x4E2A;&#x578B;&#x53F7;&#x5C31;&#x662F;&#x9760;&#x4E00;&#x8282;5&#x53F7;&#x7535;&#x6C60;&#x9A71;&#x52A8;&#xFF0C;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x624D;&#x9700;&#x8981;&#x6362;&#x4E00;&#x6B21;&#x7535;&#x6C60;&#xFF0C;&#x4F53;&#x9A8C;&#x65E0;&#x6BD4;&#x7F8E;&#x597D;&#x3002;</p><p>&#x8FD9;&#x6B21;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x5145;&#x7535;&#x5F0F;&#x7684;&#x9F20;&#x6807;&#xFF0C;&#x521A;&#x4E0A;&#x624B;&#x4E00;&#x5929;&#x5C1A;&#x4E0D;&#x77E5;&#x7EED;&#x822A;&#x60C5;&#x51B5;&#x5982;&#x4F55;&#x3002;&#x53EF;&#x4EE5;&#x60F3;&#x89C1;&#x5145;&#x7535;&#x9891;&#x7387;&#x4F1A;&#x6BD4;&#x6362;&#x7535;&#x6C60;&#x9AD8;&#x51FA;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ECE;&#x4F7F;&#x7528;&#x5176;&#x5B83;&#x7535;&#x5B50;&#x4EA7;&#x54C1;&#x7684;&#x7ECF;&#x9A8C;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x70B9;&#x4F53;&#x9A8C;&#x7684;&#x4E0B;&#x6ED1;&#x5E94;&#x5F53;&#x4E5F;&#x5F88;&#x5FEB;&#x53EF;&#x4EE5;&#x9002;&#x5E94;&#x3002;</p><p>&#x5305;&#x88C5;&#x5185;&#x9644;&#x8D60;&#x4E86;&#x4E00;&#x6839;&#x975E;&#x5E38;&#x67D4;&#x8F6F;&#x7684;A-C&#x5145;&#x7535;&#x7EBF;&#x3002;&#x4E0D;&#x8FC7;&#x7531;&#x4E8E;&#x9700;&#x8981;&#x5360;&#x7528;&#x663E;&#x793A;&#x5668;&#x4E0A;&#x4EC5;&#x6709;&#x7684;&#x4E24;&#x4E2A;USB-A&#x63A5;&#x53E3;&#x4E4B;&#x4E00;&#xFF0C;&#x8FD9;&#x6839;&#x7EBF;&#x5E94;&#x5F53;&#x662F;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x4E86;&#x3002;&#x6D4B;&#x8BD5;&#x4E86;&#x4E00;&#x4E0B;&#x7528;C-C&#x7EBF;&#x4E5F;&#x80FD;&#x5145;&#x3002;</p><h3 id="&#x4E0E;M590&#x7684;&#x5BF9;&#x6BD4;"><a href="#&#x4E0E;M590&#x7684;&#x5BF9;&#x6BD4;" class="headerlink" title="&#x4E0E;M590&#x7684;&#x5BF9;&#x6BD4;"></a>&#x4E0E;M590&#x7684;&#x5BF9;&#x6BD4;</h3><p><strong>&#x63E1;&#x611F;</strong>&#xFF1A;&#x4F53;&#x79EF;&#x6BD4;M590&#x5927;&#x4E00;&#x5708;&#xFF0C;&#x63E1;&#x6301;&#x8212;&#x9002;&#x5EA6;&#x6B20;&#x4F73;&#xFF0C;&#x611F;&#x89C9;&#x624B;&#x5BB9;&#x6613;&#x5F80;&#x540E;&#x6ED1;&#x3002;&#x4F46;&#x80DC;&#x5728;&#x8F7B;&#x4FBF;&#xFF0C;&#x5E94;&#x5F53;&#x53EF;&#x4EE5;&#x5728;&#x8F83;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x9002;&#x5E94;&#x3002;</p><p><strong>&#x6309;&#x952E;</strong>&#xFF1A;&#x90FD;&#x6BD4;&#x8F83;&#x6E05;&#x8106;&#xFF0C;&#x4F46;&#x5E26;&#x7740;&#x4E00;&#x79CD;&#x5EC9;&#x4EF7;&#x611F;&#xFF0C;&#x8FD8;&#x662F;&#x66F4;&#x559C;&#x6B22;M590&#x7684;&#x90A3;&#x79CD;&#x6E05;&#x6670;&#x4F46;&#x514B;&#x5236;&#x7684;&#x53CD;&#x9988;&#x3002;&#x53E6;&#x5916;&#x5C31;&#x662F;M590&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x6309;&#x952E;&#x9759;&#x97F3;&#xFF0C;&#x8FD9;&#x6B3E;&#x9F20;&#x6807;&#x6309;&#x952E;&#x58F0;&#x97F3;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x8FC7;&#x5927;&#x4E86;&#x3002;</p><p><strong>&#x5916;&#x89C2;</strong>&#xFF1A;&#x89C1;&#x4EC1;&#x89C1;&#x667A;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x5916;&#x5F62;&#x770B;&#x8D77;&#x6765;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x4F46;&#x505A;&#x5DE5;&#x7ECF;&#x4E0D;&#x8D77;&#x7EC6;&#x770B;&#x3002;</p><h3 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h3><p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#x4F7F;&#x7528;&#x4F53;&#x9A8C;&#x548C;&#x505A;&#x5DE5;&#x8D28;&#x611F;&#x4EC0;&#x4E48;&#x7684;&#x57FA;&#x672C;&#x5BF9;&#x5F97;&#x8D77;&#x4EF7;&#x4F4D;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x662F;&#x770B;&#x65E5;&#x5E38;&#x7EED;&#x822A;&#x60C5;&#x51B5;&#x4EE5;&#x53CA;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x4F1A;&#x7528;&#x574F;&#x6389;&#x4E86;&#x3002;&#x4E0D;&#x51FA;&#x610F;&#x5916;&#x7684;&#x8BDD;&#x4E0B;&#x6B21;&#x6362;&#x9F20;&#x6807;&#x5E94;&#x8BE5;&#x4F1A;&#x56DE;&#x5230;&#x7F57;&#x6280;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;&amp;#x4E4B;&amp;#x524D;&amp;#x7528;&amp;#x4E86;&amp;#x4E00;&amp;#x4E24;&amp;#x5E74;&amp;#x7684;&amp;#x7F57;&amp;#x6280;M590&amp;#x9F20;&amp;#x6807;&amp;#x51FA;&amp;#x73B0;&amp;#x4E00;&amp;#x70B9;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x88AB;&amp;#x4EBA;&amp;#x63A8;&amp;#x8350;&amp;#x4E70;&amp;#x4E86;&amp;#x4E2A;&amp;#x8C8C;&amp;#x4F3C;&amp;#x662F;&amp;#x4E2A;&amp;#x56FD;&amp;#x4EA7;&amp;#x65B0;&amp;#x54C1;&amp;#x724C;&amp;#x7684;&amp;#x873B;&amp;#x8713;R1 SE&amp;#x3002;&amp;#x5230;&amp;#x624B;&amp;#x53D1;&amp;#x73B0;&amp;#x9F20;&amp;#x6807;&amp;#x4E2A;&amp;#x5934;&amp;#x633A;&amp;#x5927;&amp;#x91CD;&amp;#x91CF;&amp;#x5F88;&amp;#x8F7B;&amp;#xFF0C;&amp;#x5EC9;&amp;#x4EF7;&amp;#x611F;&amp;#x6BD4;&amp;#x8F83;&amp;#x91CD;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8FC7;&amp;#x4E0D;&amp;#x5230;&amp;#x4E00;&amp;#x767E;&amp;#x5757;&amp;#x94B1;&amp;#x7684;&amp;#x9F20;&amp;#x6807;&amp;#x4E5F;&amp;#x4E0D;&amp;#x8981;&amp;#x5565;&amp;#x81EA;&amp;#x884C;&amp;#x8F66;&amp;#x4E86;&amp;#x3002;&lt;/p&gt;</summary>
    
    
    
    
    <category term="折腾" scheme="https://shiqingxu.gthub.io/tags/%E6%8A%98%E8%85%BE/"/>
    
  </entry>
  
  <entry>
    <title>这一切没有想象的那么糟</title>
    <link href="https://shiqingxu.gthub.io/2024/01/14/not-so-bad/"/>
    <id>https://shiqingxu.gthub.io/2024/01/14/not-so-bad/</id>
    <published>2024-01-14T07:38:51.000Z</published>
    <updated>2025-09-03T00:38:44.782Z</updated>
    
    <content type="html"><![CDATA[<p>2023 &#x6700;&#x540E;&#x4E00;&#x5929;&#xFF0C;&#x8DDF;K&#x4E00;&#x8D77;&#x53BB;&#x770B;&#x4E86;&#x53F6;&#x84D3;&#x548C;&#x4E07;&#x603B;&#x7684;&#x8DE8;&#x5E74;&#x97F3;&#x4E50;&#x4F1A;&#xFF0C;&#x7528;&#x4E07;&#x603B;&#x7684;&#x4E00;&#x9996;&#x6B4C;&#x6765;&#x603B;&#x7ED3;&#x8FD9;&#x4E00;&#x5E74;&#x9887;&#x4E3A;&#x8D34;&#x5207;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x6CA1;&#x6709;&#x60F3;&#x8C61;&#x7684;&#x90A3;&#x4E48;&#x7CDF;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x6309;K&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x4E0D;&#x9519;&#xFF1F;</p><span id="more"></span><h5 id="&#x65E0;&#x6240;&#x4E8B;&#x4E8B;"><a href="#&#x65E0;&#x6240;&#x4E8B;&#x4E8B;" class="headerlink" title="&#x65E0;&#x6240;&#x4E8B;&#x4E8B;"></a>&#x65E0;&#x6240;&#x4E8B;&#x4E8B;</h5><p>&#x8FD9;&#x4E00;&#x5E74;&#x591A;&#x662F;&#x6709;&#x8BB0;&#x5FC6;&#x4EE5;&#x6765;&#x4F11;&#x606F;&#x65F6;&#x95F4;&#x6700;&#x957F;&#x7684;&#x4E00;&#x6B21;&#xFF0C;&#x65F6;&#x95F4;&#x662F;&#x5982;&#x6B64;&#x4E4B;&#x957F;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x56E0;&#x4E3A;&#x65E0;&#x804A;&#x5F00;&#x59CB;&#x4E3B;&#x52A8;&#x627E;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x53BB;&#x505A;&#x3002;&#x65E0;&#x804A;&#x662F;&#x4E00;&#x79CD;&#x4EE4;&#x4EBA;&#x714E;&#x71AC;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x51AC;&#x5B63;&#x52A0;&#x75AB;&#x60C5;&#x5C01;&#x9501;&#xFF0C;&#x53EA;&#x80FD;&#x6574;&#x65E5;&#x5F85;&#x5728;&#x9634;&#x6697;&#x7684;&#x623F;&#x95F4;&#x91CC;&#xFF0C;&#x76F4;&#x5230;&#x60F3;&#x770B;&#x7684;&#x7535;&#x89C6;&#x5267;&#x90FD;&#x770B;&#x5B8C;&#xFF0C;&#x76F4;&#x5230;YouTube&#x9996;&#x9875;&#x4E0A;&#x518D;&#x4E5F;&#x63A8;&#x8350;&#x4E0D;&#x51FA;&#x6211;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x5F00;&#x59CB;&#x53BB;&#x5B66;&#x4E60;&#xFF0C;&#x53BB;&#x770B;&#x4E66;&#xFF0C;&#x53BB;&#x8FD0;&#x52A8;&#x6539;&#x5584;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4F53;&#x72B6;&#x6001;&#x3002;&#x6CA1;&#x6709;&#x5C01;&#x9501;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x4F1A;&#x51FA;&#x95E8;&#x53BB;&#x6253;ingress&#xFF0C;&#x4E5F;&#x7EC8;&#x4E8E;&#x5728;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;10&#x5468;&#x5E74;&#x4E4B;&#x9645;&#x4ECE;&#x505C;&#x6EDE;&#x4E86;&#x597D;&#x51E0;&#x5E74;&#x7684;15&#x7EA7;&#x5347;&#x5230;&#x4E86;&#x6EE1;&#x7EA7;16&#x7EA7;&#xFF0C;&#x653E;&#x4E0B;&#x4E86;&#x4E00;&#x4E2A;&#x5FC3;&#x7ED3;&#x3002;</p><p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x4EBA;&#x5728;&#x65E0;&#x6240;&#x4E8B;&#x4E8B;&#x7684;&#x65F6;&#x5019;&#x5FC3;&#x7406;&#x72B6;&#x6001;&#x5F88;&#x4E0D;&#x597D;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x53BB;&#x627E;&#x70B9;&#x4E8B;&#x60C5;&#x505A;&#xFF0C;&#x6211;&#x627E;&#x5230;&#x4E86;&#x3002;</p><h5 id="&#x80FD;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x4E0E;&#x53D6;&#x7528;"><a href="#&#x80FD;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x4E0E;&#x53D6;&#x7528;" class="headerlink" title="&#x80FD;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x4E0E;&#x53D6;&#x7528;"></a>&#x80FD;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x4E0E;&#x53D6;&#x7528;</h5><p>&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x6BDB;&#x6BDB;&#x8001;&#x5E08;&#x95EE;&#x6211;&#x8FC7;&#x53BB;&#x4E00;&#x5E74;&#x6700;&#x5927;&#x7684;&#x6536;&#x83B7;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x4E0D;&#x5047;&#x601D;&#x7D22;&#x5730;&#x8BF4;&#x662F;&#x300E;&#x8BA4;&#x8BC6;&#x4E86;&#x4F60;&#x4EEC;&#x8FD9;&#x4E9B;&#x65B0;&#x670B;&#x53CB;&#x300F;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B9E;&#x9645;&#x4E0A;&#x5DF2;&#x7ECF;&#x524D;&#x4E00;&#x5E74;&#x8BA4;&#x8BC6;&#x7684;&#x4E86;&#xFF0C;&#x4F46;&#x6211;&#x4F9D;&#x7136;&#x89C9;&#x5F97;&#x8FD9;&#x5BF9;&#x8FC7;&#x53BB;&#x4E00;&#x5E74;&#x91CC;&#x7684;&#x6211;&#x7684;&#x7CBE;&#x795E;&#x72B6;&#x6001;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x54EA;&#x6015;&#x5E73;&#x65F6;&#x5E76;&#x4E0D;&#x5728;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x9891;&#x7E41;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x4EC5;&#x662F;&#x6781;&#x4E3A;&#x5076;&#x5C14;&#x5730;&#x4E92;&#x52A8;&#x4E00;&#x4E0B;&#x3002;&#x8BA4;&#x8BC6;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x6BD4;&#x8F83;&#x79BB;&#x8C31;&#xFF0C;&#x5C0F;&#x949F;&#x5728;&#x5BA4;&#x5916;&#x7ED9;&#x6211;&#x526A;&#x5934;&#x53D1;&#xFF0C;&#x6BDB;&#x6BDB;&#x592B;&#x5987;&#x5750;&#x5728;&#x65C1;&#x8FB9;&#x770B;&#xFF0C;&#x5C0F;&#x949F;&#x5C31;&#x95EE;&#x4ED6;&#x4EEC;&#x8981;&#x4E0D;&#x8981;&#x526A;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x8BA4;&#x8BC6;&#x4E86;&#x3002;</p><p>12&#x6708;&#x7684;&#x4E00;&#x5929;&#xFF0C;&#x5C0F;&#x949F;&#x5728;&#x6BDB;&#x6BDB;&#x8001;&#x5E08;&#x5BB6;&#x505A;&#x5BA2;&#xFF0C;&#x5FEB;&#x7ED3;&#x675F;&#x65F6;&#x7ED9;&#x6211;&#x6253;&#x4E86;&#x4E2A;&#x89C6;&#x9891;&#x7535;&#x8BDD;&#xFF0C;&#x800C;&#x540E;&#x5728;&#x56DE;&#x5BB6;&#x7684;&#x51FA;&#x79DF;&#x8F66;&#x4E0A;&#x7EE7;&#x7EED;&#x804A;&#x4E86;&#x4E8C;&#x4E09;&#x5341;&#x5206;&#x949F;&#x3002;&#x8BDD;&#x9898;&#x9887;&#x4E3A;&#x6C89;&#x91CD;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x5F88;&#x96BE;&#x60F3;&#x8C61;&#x5979;&#x6302;&#x5B8C;&#x7535;&#x8BDD;&#x4E4B;&#x540E;&#x5982;&#x4F55;&#x9F13;&#x8D77;&#x52C7;&#x6C14;&#x56DE;&#x5230;&#x4F4F;&#x5904;&#xFF0C;&#x6216;&#x8BB8;&#x5979;&#x4F1A;&#x5728;&#x4E25;&#x5BD2;&#x4E2D;&#x745F;&#x745F;&#x53D1;&#x6296;&#x5730;&#x72EC;&#x81EA;&#x8D70;&#x5728;&#x51B0;&#x5C01;&#x7684;&#x6E29;&#x6986;&#x6CB3;&#x8FB9;&#xFF0C;&#x7EA0;&#x7ED3;&#x534A;&#x664C;&#x4E4B;&#x540E;&#x7EC8;&#x4E8E;&#x4E0D;&#x5F97;&#x4E0D;&#x56DE;&#x5230;&#x5C4B;&#x5B50;&#x91CC;&#x53BB;&#x3002;</p><p>&#x540E;&#x6765;&#x5C0F;&#x949F;&#x53BB;&#x5185;&#x8499;&#x53C2;&#x52A0;&#x5B8C;&#x4E86;&#x53BB;&#x5E74;&#x5EA6;&#x7684;&#x96EA;&#x5730;&#x6469;&#x6258;&#x8F66;&#x6BD4;&#x8D5B;&#xFF0C;&#x56DE;&#x5230;&#x5E7F;&#x897F;&#x5BB6;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x7EA6;&#x65F6;&#x95F4;&#x7535;&#x8BDD;&#x804A;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x8FD9;&#x6B21;&#x5979;&#x624D;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x65F6;&#x95F4;&#x628A;&#x5979;&#x8FC7;&#x53BB;&#x4E00;&#x5E74;&#x7684;&#x75DB;&#x82E6;&#x7ECF;&#x5386;&#x548C;&#x9003;&#x4EA1;&#x8FC7;&#x7A0B;&#x8BB2;&#x8FF0;&#x7ED9;&#x6211;&#x3002;&#x4E00;&#x6BB5;&#x5931;&#x53BB;&#x81EA;&#x6211;&#xFF0C;&#x53C8;&#x9F13;&#x8D77;&#x52C7;&#x6C14;&#x9010;&#x6E10;&#x627E;&#x56DE;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p><p>&#x5F53;&#x521D;&#x521A;&#x521A;&#x8BA4;&#x8BC6;&#x7684;&#x5C0F;&#x949F;&#x770B;&#x51FA;&#x6211;&#x5185;&#x5FC3;&#x7684;&#x75DB;&#x82E6;&#x65F6;&#xFF0C;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x6709;&#x8BF4;&#xFF0C;&#x53EA;&#x662F;&#x9ED8;&#x9ED8;&#x966A;&#x6211;&#x804A;&#x5929;&#xFF0C;&#x6570;&#x6B21;&#x5F7B;&#x591C;&#x957F;&#x8C08;&#xFF0C;&#x73B0;&#x5728;&#x5B8C;&#x5168;&#x4E0D;&#x8BB0;&#x5F97;&#x90A3;&#x65F6;&#x5019;&#x8C08;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&#x73B0;&#x5728;&#x5979;&#x4ECE;&#x6211;&#x8FD9;&#x91CC;&#x83B7;&#x5F97;&#x80FD;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x8BF4;&#xFF0C;&#x5979;&#x5C31;&#x50CF;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x91CF;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E9B;&#x670B;&#x53CB;&#x90A3;&#x91CC;&#xFF0C;&#x5E2E;&#x52A9;&#x670B;&#x53CB;&#x91CD;&#x65B0;&#x632F;&#x4F5C;&#xFF0C;&#x5F53;&#x5979;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x670B;&#x53CB;&#x4E5F;&#x53EF;&#x4EE5;&#x62FF;&#x51FA;&#x8FD9;&#x4E9B;&#x80FD;&#x91CF;&#xFF0C;&#x4EE4;&#x5979;&#x91CD;&#x65B0;&#x632F;&#x4F5C;&#x3002;</p><p>&#x5C0F;&#x949F;&#x4E5F;&#x8BF4;&#xFF0C;&#x542C;&#x5F97;&#x51FA;&#x6765;&#x6211;&#x73B0;&#x5728;&#x72B6;&#x6001;&#x6BD4;&#x4E4B;&#x524D;&#x597D;&#x5F97;&#x591A;&#x3002;</p><h5 id="&#x8FD9;&#x6837;&#x7684;&#x4E0E;&#x90A3;&#x6837;&#x7684;&#x81EA;&#x7531;"><a href="#&#x8FD9;&#x6837;&#x7684;&#x4E0E;&#x90A3;&#x6837;&#x7684;&#x81EA;&#x7531;" class="headerlink" title="&#x8FD9;&#x6837;&#x7684;&#x4E0E;&#x90A3;&#x6837;&#x7684;&#x81EA;&#x7531;"></a>&#x8FD9;&#x6837;&#x7684;&#x4E0E;&#x90A3;&#x6837;&#x7684;&#x81EA;&#x7531;</h5><p>&#x5F53;&#x4EBA;&#x4EEC;&#x8C08;&#x8BBA;&#x6469;&#x6258;&#x8F66;&#x80FD;&#x5E26;&#x6765;&#x4EC0;&#x4E48;&#x65F6;&#xFF0C;&#x5F88;&#x96BE;&#x907F;&#x5F00;&#x4E00;&#x4E2A;&#x8BCD;&#x6C47;&#xFF0C;&#x81EA;&#x7531;&#x3002;&#x8FD9;&#x4E2A;&#x8BCD;&#x53EF;&#x4EE5;&#x4ECE;&#x591A;&#x4E2A;&#x5C42;&#x9762;&#x6765;&#x9610;&#x91CA;&#xFF0C;&#x5728;&#x6211;&#x770B;&#x6765;&#x66F4;&#x591A;&#x5730;&#x662F;&#x8C61;&#x5F81;&#x4E00;&#x79CD;&#x81EA;&#x7531;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5427;&#xFF0C;&#x5982;&#x679C;&#x8EAB;&#x5FC3;&#x4E0D;&#x81EA;&#x7531;&#xFF0C;&#x4E00;&#x79CD;&#x4EA4;&#x901A;&#x5DE5;&#x5177;&#x80FD;&#x5E26;&#x6765;&#x591A;&#x5927;&#x6539;&#x53D8;&#x5462;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x53EF;&#x80FD;&#x6027;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x8F66;&#x578B;&#x4E00;&#x5B9A;&#x662F;ADV&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8C61;&#x5F81;&#x7684;&#x81EA;&#x7531;&#x6700;&#x591A;&#x6700;&#x5438;&#x5F15;&#x4EBA;&#x3002;</p><p>&#x5341;&#x51E0;&#x5C81;&#x5C31;&#x5F00;&#x59CB;&#x9A91;&#x6469;&#x6258;&#x8F66;&#xFF0C;&#x5341;&#x6765;&#x5E74;&#x6765;&#x8FD9;&#x79CD;&#x4EA4;&#x901A;&#x5DE5;&#x5177;&#x7ED9;&#x6211;&#x5E26;&#x6765;&#x4E86;&#x65E0;&#x5C3D;&#x7684;&#x4E50;&#x8DA3;&#xFF0C;&#x4F46;&#x5F88;&#x96BE;&#x8BF4;&#x81EA;&#x7531;&#x662F;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x3002;ADV&#x5E26;&#x6211;&#x53BB;&#x8FDC;&#x65B9;&#x4E86;&#x5417;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#xFF0C;&#x6700;&#x8FDC;&#x4E5F;&#x5C31;&#x53BB;&#x8FC7;&#x4E4C;&#x5170;&#x5BDF;&#x5E03;&#x5427;&#x3002;</p><p>&#x6211;&#x603B;&#x60F3;&#x8D77;&#x300A;&#x7261;&#x7F8A;&#x5C11;&#x5E74;&#x5947;&#x5E7B;&#x4E4B;&#x65C5;&#x300B;&#x91CC;&#x7684;&#x4E00;&#x6BB5;&#x8BDD;&#xFF1A;</p><blockquote><p>&#x56E0;&#x4E3A;&#x9EA6;&#x52A0;&#x662F;&#x652F;&#x6491;&#x6211;&#x6D3B;&#x4E0B;&#x53BB;&#x7684;&#x5E0C;&#x671B;&#xFF0C;&#x4F7F;&#x6211;&#x80FD;&#x591F;&#x5FCD;&#x53D7;&#x5E73;&#x5EB8;&#x7684;&#x5C81;&#x6708;&#xFF0C;&#x5FCD;&#x53D7;&#x6A71;&#x67DC;&#x91CC;&#x90A3;&#x4E9B;&#x4E0D;&#x4F1A;&#x8BF4;&#x8BDD;&#x7684;&#x6C34;&#x6676;&#xFF0C;&#x5FCD;&#x53D7;&#x90A3;&#x95F4;&#x7CDF;&#x7CD5;&#x900F;&#x9876;&#x7684;&#x9910;&#x5385;&#x91CC;&#x7684;&#x5348;&#x996D;&#x548C;&#x665A;&#x996D;&#x3002;&#x6211;&#x5BB3;&#x6015;&#x5B9E;&#x73B0;&#x6211;&#x7684;&#x68A6;&#x60F3;&#xFF0C;&#x5B9E;&#x73B0;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x6CA1;&#x6709;&#x6D3B;&#x4E0B;&#x53BB;&#x7684;&#x52A8;&#x529B;&#x4E86;&#x3002;</p></blockquote><p>&#x5728;&#x6765;&#x5230;&#x5E7F;&#x5DDE;&#x4E4B;&#x524D;&#xFF0C;&#x8FD8;&#x5728;&#x5317;&#x4EAC;&#x65F6;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x4E0D;&#x600E;&#x4E48;&#x9A91;&#x6469;&#x6258;&#x8F66;&#x4E86;&#x3002;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x8868;&#x9762;&#x4E0A;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x662F;&#x8FD1;&#x51E0;&#x5E74;&#x77ED;&#x89C6;&#x9891;&#x5E73;&#x53F0;&#x4E0A;&#x98CE;&#x9761;&#x9A91;&#x8F66;&#x76F8;&#x5173;&#x7684;&#x5185;&#x5BB9;&#x4E4B;&#x540E;&#xFF0C;&#x5F88;&#x591A;&#x6CA1;&#x6709;&#x5B89;&#x5168;&#x610F;&#x8BC6;&#x7684;&#x65B0;&#x4EBA;&#x9A91;&#x624B;&#x6D8C;&#x5165;&#xFF0C;&#x5BFC;&#x81F4;&#x6211;&#x4E0A;&#x8DEF;&#x7684;&#x5371;&#x9669;&#x7CFB;&#x6570;&#x53D8;&#x9AD8;&#x3002;&#x4F46;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x53EF;&#x80FD;&#x90A3;&#x4EFD;&#x5173;&#x4E8E;&#x81EA;&#x7531;&#x7684;&#x8C61;&#x5F81;&#x548C;&#x627F;&#x8BFA;&#x4E0D;&#x518D;&#x80FD;&#x6253;&#x52A8;&#x6211;&#x4E86;&#x5427;&#x3002;</p><p>&#x76F8;&#x53CD;&#x7684;&#x662F;&#xFF0C;&#x4EE5;&#x5F80;&#x6211;&#x6BEB;&#x65E0;&#x611F;&#x89C9;&#x7684;&#x6C7D;&#x8F66;&#xFF0C;&#x5374;&#x7ED9;&#x6211;&#x5E26;&#x6765;&#x4E86;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x81EA;&#x7531;&#x7684;&#x4F53;&#x4F1A;&#x548C;&#x60F3;&#x8C61;&#x3002;&#x6700;&#x8FD1;&#x5C0F;&#x949F;&#x4E5F;&#x4E70;&#x4E86;&#x5979;&#x7684;&#x7B2C;&#x4E00;&#x8F86;&#x6C7D;&#x8F66;&#xFF0C;&#x5174;&#x594B;&#x5730;&#x8DDF;&#x6211;&#x8BF4;&#x6C7D;&#x8F66;&#x5E26;&#x6765;&#x7684;&#x81EA;&#x7531;&#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x6BD4;&#x6469;&#x6258;&#x8F66;&#x5C11;&#xFF0C;&#x5979;&#x73B0;&#x5728;&#x95F2;&#x7740;&#x6CA1;&#x4E8B;&#x5C31;&#x60F3;&#x53BB;&#x5F00;&#x8F66;&#xFF0C;&#x60F3;&#x5728;&#x8F66;&#x91CC;&#x7761;&#x89C9;&#x3002;&#x5BF9;&#x6B64;&#x6211;&#x5F88;&#x80FD;&#x5171;&#x9E23;&#xFF0C;&#x6BD5;&#x7ADF;&#x6211;&#x5DF2;&#x7ECF;&#x6570;&#x6B21;&#x56FA;&#x6267;&#x5730;&#x5728;&#x6709;&#x623F;&#x5B50;&#x53EF;&#x7761;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6545;&#x610F;&#x7761;&#x5728;&#x8F66;&#x91CC;&#x8BB8;&#x591A;&#x6B21;&#x4E86;&#x3002;</p><p>&#x5F53;&#x7136;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6C7D;&#x8F66;&#x5E26;&#x6765;&#x7684;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5BF9;&#x81EA;&#x7531;&#x7684;&#x8BB8;&#x8BFA;&#x800C;&#x5DF2;&#xFF0C;&#x80FD;&#x5426;&#x83B7;&#x5F97;&#x81EA;&#x7531;&#xFF0C;&#x7EC8;&#x7A76;&#x4E0D;&#x662F;&#x4E00;&#x6B3E;&#x4EA4;&#x901A;&#x5DE5;&#x5177;&#x80FD;&#x51B3;&#x5B9A;&#x7684;&#x3002;</p><p>&#x5173;&#x4E8E;&#x672A;&#x6765;&#x7684;&#x60F3;&#x8C61;&#xFF0C;&#x662F;&#x83B7;&#x5F97;&#x591A;&#x5DF4;&#x80FA;&#x7684;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x9014;&#x5F84;&#x3002;&#x6211;&#x51B3;&#x5B9A;&#x6625;&#x8282;&#x56DE;&#x5BB6;&#x628A;&#x8F66;&#x5F00;&#x6765;&#x5E7F;&#x5DDE;&#xFF0C;&#x4EE5;&#x4FBF;&#x53BB;&#x5B9E;&#x73B0;&#x8FD1;&#x671F;&#x8DDF;K&#x7684;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x81EA;&#x7531;&#x7684;&#x7545;&#x60F3;&#x3002;</p><h5 id="&#x51E0;&#x573A;&#x6F14;&#x51FA;"><a href="#&#x51E0;&#x573A;&#x6F14;&#x51FA;" class="headerlink" title="&#x51E0;&#x573A;&#x6F14;&#x51FA;"></a>&#x51E0;&#x573A;&#x6F14;&#x51FA;</h5><p>&#x6700;&#x8FD1;&#x51E0;&#x5E74;&#x770B;&#x6F14;&#x51FA;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x5F52;&#x56E0;&#x4E8E;&#x75AB;&#x60C5;&#x5C01;&#x9501;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#x75AB;&#x60C5;&#x4E4B;&#x524D;&#x7684;&#x51E0;&#x5E74;&#x770B;&#x7684;&#x4E5F;&#x5F88;&#x5C11;&#x4E86;&#x3002;&#x5728;&#x4E0A;&#x6D77;&#x7684;&#x51E0;&#x5E74;&#x95F4;&#x53EA;&#x770B;&#x8FC7;&#x5C48;&#x6307;&#x53EF;&#x6570;&#x7684;&#x51E0;&#x573A;&#xFF0C;&#x9664;&#x4E86;&#x4E24;&#x573A;&#x6728;&#x739B;&#x4E4B;&#x5916;&#xFF0C;&#x522B;&#x7684;&#x51E0;&#x573A;&#x7559;&#x4E0B;&#x7684;&#x5370;&#x8C61;&#x90FD;&#x4E0D;&#x6DF1;&#x4E86;&#x3002;&#x540E;&#x6765;&#x56DE;&#x5230;&#x5317;&#x4EAC;&#x65F6;&#x5DF2;&#x7ECF;&#x7ECF;&#x5386;&#x4E86;&#x4E00;&#x5E74;&#x75AB;&#x60C5;&#xFF0C;&#x6574;&#x4E2A;&#x6F14;&#x51FA;&#x5E02;&#x573A;&#x51E0;&#x4E4E;&#x6D88;&#x5931;&#x4E86;&#x3002;</p><p>&#x6765;&#x5230;&#x5E7F;&#x5DDE;&#x4E4B;&#x540E;&#x4E0D;&#x957F;&#x65F6;&#x95F4;&#x5DF2;&#x7ECF;&#x770B;&#x4E86;&#x56DB;&#x573A;&#xFF0C;&#x7B2C;&#x4E00;&#x573A;&#x662F;&#x626D;&#x66F2;&#x673A;&#x5668;&#xFF0C;&#x7B2C;&#x4E8C;&#x573A;&#x662F;&#x53BB;&#x6DF1;&#x5733;&#x770B;&#x4E86;&#x5DE6;&#x5C0F;&#x7956;&#x5492;&#xFF0C;&#x7B2C;&#x4E09;&#x573A;&#x662F;&#x4F4E;&#x82E6;&#x827E;&#x4E50;&#x961F;&#xFF0C;&#x7B2C;&#x56DB;&#x573A;&#x53F6;&#x84D3;&#x548C;&#x4E07;&#x603B;&#x7684;&#x8DE8;&#x5E74;&#x97F3;&#x4E50;&#x4F1A;&#x3002;&#x9664;&#x4E86;&#x626D;&#x66F2;&#x673A;&#x5668;&#xFF0C;&#x522B;&#x7684;&#x5E94;&#x8BE5;&#x90FD;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#x3002;&#x8FC7;&#x51E0;&#x5929;&#x8FD8;&#x4F1A;&#x53BB;&#x770B;&#x676D;&#x76D6;&#x4E50;&#x961F;&#x3002;</p><p>&#x8FD9;&#x5BC6;&#x96C6;&#x5730;&#x770B;&#x6F14;&#x51FA;&#xFF0C;&#x4EFF;&#x4F5B;&#x7F8E;&#x597D;&#x7684;&#x65E7;&#x65F6;&#x5149;&#x3002;</p><h5 id="Instant-Crush"><a href="#Instant-Crush" class="headerlink" title="Instant Crush"></a>Instant Crush</h5><p>&#x6700;&#x8FD1;&#x5728;&#x53CD;&#x590D;&#x542C; Daft Punk &#x7684; <em>Instant Crush</em> &#x8FD9;&#x9996;&#x6B4C;&#xFF0C;&#x5728;&#x4E0A;&#x4E0B;&#x73ED;&#x8D70;&#x8DEF;&#x65F6;&#xFF0C;&#x5728;&#x5730;&#x94C1;&#x4E0A;&#xFF0C;&#x5728;&#x51FA;&#x79DF;&#x8F66;&#x4E0A;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x5199;&#x8FD9;&#x7BC7;post&#x7684;&#x5F53;&#x4E0B;&#x3002;</p><p>&#x6BDB;&#x6BDB;&#x8001;&#x5E08;&#x8DDF;&#x6211;&#x8BF4;&#xFF0C;&#x90A3;&#x5929;&#x5C0F;&#x949F;&#x5728;&#x5979;&#x5BB6;&#x770B;&#x5B8C;&#x300A;&#x82B1;&#x675F;&#x822C;&#x7684;&#x604B;&#x7231;&#x300B;&#x8BF4;&#x4E86;&#x4E00;&#x53E5;&#xFF0C;&#x201C;&#x8FD9;&#x4E2A;&#x5E74;&#x7EAA;&#x4E5F;&#x8BB8;&#x4E0D;&#x4F1A;&#x518D;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x4EFD;&#x611F;&#x60C5;&#x4E86;&#x201D;&#x3002;&#x6211;&#x6CA1;&#x770B;&#x8FC7;&#x8FD9;&#x4E2A;&#x7535;&#x5F71;&#xFF0C;&#x4F46;&#x662F;&#x8FDE;&#x5C0F;&#x949F;&#x8FD9;&#x79CD;&#x4E0D;&#x592A;&#x53D7;&#x73B0;&#x4EE3;&#x793E;&#x4F1A;&#x89C4;&#x5219;&#x7EA6;&#x675F;&#x7684;&#x4EBA;&#x90FD;&#x80FD;&#x53D1;&#x51FA;&#x8FD9;&#x822C;&#x611F;&#x53F9;&#xFF0C;&#x4E5F;&#x4E0D;&#x96BE;&#x731C;&#x5230;&#x662F;&#x54EA;&#x6837;&#x7684;&#x611F;&#x60C5;&#x3002;</p><p>&#x968F;&#x540E;&#x8BA4;&#x8BC6;&#x4E86;K&#x3002;&#x51E0;&#x5929;&#x4EE5;&#x540E;&#x4E00;&#x8D77;&#x770B;&#x8DE8;&#x5E74;&#x6F14;&#x51FA;&#xFF0C;&#x5F53;&#x4E07;&#x603B;&#x5728;&#x53F0;&#x4E0A;&#x5531;&#x300A;&#x4E1D;&#x7ED2;&#x8774;&#x8776;&#x300B;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x81EA;&#x7136;&#x5730;&#x7275;&#x4E86;&#x624B;&#x3002;</p><p>&#x6211;&#x5F88;&#x60F6;&#x6050;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x6709;&#x8D44;&#x683C;&#x83B7;&#x5F97;&#x8FD9;&#x6837;&#x4E00;&#x4EFD;&#x611F;&#x60C5;&#x3002;</p><p>&#x4F46;&#x60F3;&#x8D77; Naval &#x7684;&#x4E00;&#x6BB5;&#x8BDD;&#xFF0C;&#x4F7F;&#x6211;&#x5B89;&#x5FC3;&#x4E86;&#x4E00;&#x4E9B;&#xFF1A;</p><blockquote><p>Find a relationship where you, naturally being you, makes the other person happy. And the other person, naturally being the other person, makes you happy.  </p></blockquote><p>&#x8FD9;&#x4E00;&#x5207;&#x6CA1;&#x6709;&#x60F3;&#x8C61;&#x7684;&#x90A3;&#x4E48;&#x7CDF;&#x3002;&#x751A;&#x81F3;&#xFF0C;&#x8FD8;&#x4E0D;&#x9519;&#x3002;</p>]]></content>
    
    
    <summary type="html">&lt;p&gt;2023 &amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;#x5929;&amp;#xFF0C;&amp;#x8DDF;K&amp;#x4E00;&amp;#x8D77;&amp;#x53BB;&amp;#x770B;&amp;#x4E86;&amp;#x53F6;&amp;#x84D3;&amp;#x548C;&amp;#x4E07;&amp;#x603B;&amp;#x7684;&amp;#x8DE8;&amp;#x5E74;&amp;#x97F3;&amp;#x4E50;&amp;#x4F1A;&amp;#xFF0C;&amp;#x7528;&amp;#x4E07;&amp;#x603B;&amp;#x7684;&amp;#x4E00;&amp;#x9996;&amp;#x6B4C;&amp;#x6765;&amp;#x603B;&amp;#x7ED3;&amp;#x8FD9;&amp;#x4E00;&amp;#x5E74;&amp;#x9887;&amp;#x4E3A;&amp;#x8D34;&amp;#x5207;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E00;&amp;#x5207;&amp;#x6CA1;&amp;#x6709;&amp;#x60F3;&amp;#x8C61;&amp;#x7684;&amp;#x90A3;&amp;#x4E48;&amp;#x7CDF;&amp;#x3002;&amp;#x6216;&amp;#x8005;&amp;#xFF0C;&amp;#x6309;K&amp;#x7684;&amp;#x8BF4;&amp;#x6CD5;&amp;#xFF0C;&amp;#x751A;&amp;#x81F3;&amp;#x8FD8;&amp;#x4E0D;&amp;#x9519;&amp;#xFF1F;&lt;/p&gt;</summary>
    
    
    
    
    <category term="life" scheme="https://shiqingxu.gthub.io/tags/life/"/>
    
  </entry>
  
</feed>
