<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
<meta name="viewport" content="width=device-width">
<meta name="theme-color" content="#222"><meta name="generator" content="Hexo 6.3.0">

  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png">
  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png">
  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png">
  <link rel="mask-icon" href="/images/logo.svg" color="#222">

<link rel="stylesheet" href="/css/main.css">



<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/7.0.0/css/all.min.css" integrity="sha256-VHqXKFhhMxcpubYf9xiWdCiojEbY9NexQ4jh8AxbvcM=" crossorigin="anonymous">
  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/animate.css/3.1.1/animate.min.css" integrity="sha256-PR7ttpcvz8qrF57fur/yAx1qXMFJeJFiA6pSzWi0OIE=" crossorigin="anonymous">

<script class="next-config" data-name="main" type="application/json">{"hostname":"shiqingxu.gthub.io","root":"/","images":"/images","scheme":"Muse","darkmode":false,"version":"8.24.1","exturl":false,"sidebar":{"position":"left","width_expanded":320,"width_dual_column":240,"display":"post","padding":18,"offset":12},"hljswrap":true,"codeblock":{"theme":{"light":"default","dark":"stackoverflow-dark"},"prism":{"light":"prism","dark":"prism-dark"},"copy_button":{"enable":false,"style":null},"fold":{"enable":false,"height":500},"language":false},"bookmark":{"enable":false,"color":"#222","save":"auto"},"mediumzoom":false,"lazyload":false,"pangu":false,"comments":{"style":"tabs","active":null,"storage":true,"lazyload":false,"nav":null},"stickytabs":false,"motion":{"enable":true,"async":false,"duration":200,"transition":{"menu_item":"fadeInDown","post_block":"fadeIn","post_header":"fadeInDown","post_body":"fadeInDown","coll_header":"fadeInLeft","sidebar":"fadeInUp"}},"prism":false,"i18n":{"placeholder":"Searching...","empty":"We didn't find any results for the search: ${query}","hits_time":"${hits} results found in ${time} ms","hits":"${hits} results found"}}</script><script src="/js/config.js" defer></script>

    <meta name="description" content="&amp;#x5728;&amp;#x672C;&amp;#x5468; The Economist &amp;#x7684; Culture &amp;#x677F;&amp;#x5757;&amp;#x770B;&amp;#x5230;&amp;#x4E86; Convenience Store Woman &amp;#x8FD9;&amp;#x672C;&amp;#x7BC7;&amp;#x5E45;&amp;#x4E0D;&amp;#x957F;&amp;#x7684;&amp;#x5C0F;&amp;#x8BF4;&amp;#xFF0C">
<meta property="og:type" content="article">
<meta property="og:title" content="演员的自我修养——读《人间便利店》">
<meta property="og:url" content="https://shiqingxu.gthub.io/2023/04/29/convenience-store-woman/index.html">
<meta property="og:site_name" content="十四">
<meta property="og:description" content="&amp;#x5728;&amp;#x672C;&amp;#x5468; The Economist &amp;#x7684; Culture &amp;#x677F;&amp;#x5757;&amp;#x770B;&amp;#x5230;&amp;#x4E86; Convenience Store Woman &amp;#x8FD9;&amp;#x672C;&amp;#x7BC7;&amp;#x5E45;&amp;#x4E0D;&amp;#x957F;&amp;#x7684;&amp;#x5C0F;&amp;#x8BF4;&amp;#xFF0C">
<meta property="og:locale" content="en_US">
<meta property="article:published_time" content="2023-04-29T13:51:49.000Z">
<meta property="article:modified_time" content="2025-09-03T00:38:44.782Z">
<meta property="article:author" content="14says">
<meta property="article:tag" content="reading">
<meta name="twitter:card" content="summary">


<link rel="canonical" href="https://shiqingxu.gthub.io/2023/04/29/convenience-store-woman/">


<script class="next-config" data-name="page" type="application/json">{"sidebar":"","isHome":false,"isPost":true,"lang":"en","comments":true,"permalink":"https://shiqingxu.gthub.io/2023/04/29/convenience-store-woman/","path":"2023/04/29/convenience-store-woman/","title":"演员的自我修养——读《人间便利店》"}</script>

<script class="next-config" data-name="calendar" type="application/json">""</script>
<title>演员的自我修养——读《人间便利店》 | 十四</title>
  








  
  <script src="https://cdnjs.cloudflare.com/ajax/libs/animejs/3.2.1/anime.min.js" integrity="sha256-XL2inqUJaslATFnHdJOi9GfQ60on8Wx1C2H8DYiN1xY=" crossorigin="anonymous" defer></script>
<script src="/js/utils.js" defer></script><script src="/js/motion.js" defer></script><script src="/js/sidebar.js" defer></script><script src="/js/next-boot.js" defer></script>

  






  





  <noscript>
    <link rel="stylesheet" href="/css/noscript.css">
  </noscript>
<link rel="alternate" href="/atom.xml" title="十四" type="application/atom+xml">
</head>

<body itemscope itemtype="http://schema.org/WebPage" class="use-motion">
  <div class="headband"></div>

  <main class="main">
    <div class="column">
      <header class="header" itemscope itemtype="http://schema.org/WPHeader"><div class="site-brand-container">
  <div class="site-nav-toggle">
    <div class="toggle" aria-label="Toggle navigation bar" role="button">
    </div>
  </div>

  <div class="site-meta">

    <a href="/" class="brand" rel="start">
      <i class="logo-line"></i>
      <p class="site-title">十四</p>
      <i class="logo-line"></i>
    </a>
  </div>

  <div class="site-nav-right">
    <div class="toggle popup-trigger" aria-label="Search" role="button">
    </div>
  </div>
</div>







</header>
        
  
  <aside class="sidebar">

    <div class="sidebar-inner sidebar-overview-active">
      <ul class="sidebar-nav">
        <li class="sidebar-nav-toc">
          Table of Contents
        </li>
        <li class="sidebar-nav-overview">
          Overview
        </li>
      </ul>

      <div class="sidebar-panel-container">
        <!--noindex-->
        <div class="post-toc-wrap sidebar-panel">
        </div>
        <!--/noindex-->

        <div class="site-overview-wrap sidebar-panel">
          <div class="site-author animated" itemprop="author" itemscope itemtype="http://schema.org/Person">
  <p class="site-author-name" itemprop="name">14says</p>
  <div class="site-description" itemprop="description"></div>
</div>
<div class="site-state-wrap animated">
  <nav class="site-state">
      <div class="site-state-item site-state-posts">
        <a href="/archives/">
          <span class="site-state-item-count">36</span>
          <span class="site-state-item-name">posts</span>
        </a>
      </div>
      <div class="site-state-item site-state-tags">
        <span class="site-state-item-count">15</span>
        <span class="site-state-item-name">tags</span>
      </div>
  </nav>
</div>

        </div>
      </div>
    </div>

    
  </aside>


    </div>

    <div class="main-inner post posts-expand">


  


<div class="post-block">
  
  

  <article itemscope itemtype="http://schema.org/Article" class="post-content" lang="en">
    <link itemprop="mainEntityOfPage" href="https://shiqingxu.gthub.io/2023/04/29/convenience-store-woman/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="image" content="/images/avatar.gif">
      <meta itemprop="name" content="14says">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="十四">
      <meta itemprop="description" content="">
    </span>

    <span hidden itemprop="post" itemscope itemtype="http://schema.org/CreativeWork">
      <meta itemprop="name" content="演员的自我修养——读《人间便利店》 | 十四">
      <meta itemprop="description" content="">
    </span>
      <header class="post-header">
        <h1 class="post-title" itemprop="name headline">
          演员的自我修养——读《人间便利店》
        </h1>

        <div class="post-meta-container">
          <div class="post-meta">
    <span class="post-meta-item">
      <span class="post-meta-item-icon">
        <i class="far fa-calendar"></i>
      </span>
      <span class="post-meta-item-text">Posted on</span>

      <time title="Created: 2023-04-29 21:51:49" itemprop="dateCreated datePublished" datetime="2023-04-29T21:51:49+08:00">2023-04-29</time>
    </span>
    <span class="post-meta-item">
      <span class="post-meta-item-icon">
        <i class="far fa-calendar-check"></i>
      </span>
      <span class="post-meta-item-text">Edited on</span>
      <time title="Modified: 2025-09-03 08:38:44" itemprop="dateModified" datetime="2025-09-03T08:38:44+08:00">2025-09-03</time>
    </span>

  
</div>

        </div>
      </header>

    
    
    
    <div class="post-body" itemprop="articleBody"><p>&#x5728;&#x672C;&#x5468; The Economist &#x7684; Culture &#x677F;&#x5757;&#x770B;&#x5230;&#x4E86; Convenience Store Woman &#x8FD9;&#x672C;&#x7BC7;&#x5E45;&#x4E0D;&#x957F;&#x7684;&#x5C0F;&#x8BF4;&#xFF0C;&#x4EE5;&#x4E3A;&#x662F;&#x65B0;&#x4E66;&#xFF0C;&#x7ED3;&#x679C;&#x4E00;&#x770B;&#x662F;2016&#x5E74;&#x51FA;&#x7248;&#x7684;&#xFF0C;&#x4E14;2018&#x5E74;&#x5C31;&#x6709;&#x4E2D;&#x6587;&#x7248;&#x4E86;&#xFF0C;&#x4E66;&#x540D;&#x300A;&#x4EBA;&#x95F4;&#x4FBF;&#x5229;&#x5E97;&#x300B;&#xFF0C;&#x8D76;&#x7D27;&#x8BFB;&#x5B8C;&#xFF0C;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4FBF;&#x5229;&#x5E97;&#x7231;&#x597D;&#x8005;&#xFF0C;&#x6211;&#x5C45;&#x7136;&#x4ECE;&#x6CA1;&#x542C;&#x8BF4;&#x8FC7;&#x8FD9;&#x672C;&#x62FF;&#x8FC7;&#x82A5;&#x5DDD;&#x5956;&#x7684;&#xFF0C;&#x6807;&#x9898;&#x91CC;&#x5C31;&#x5E26;&#x7740;&#x4FBF;&#x5229;&#x5E97;&#x4E09;&#x4E2A;&#x5B57;&#x7684;&#x4E66;&#x3002;<br>&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x5F02;&#x7C7B;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x300E;&#x6B63;&#x5E38;&#x4EBA;&#x300F;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x4E3B;&#x4EBA;&#x516C;&#x4ECE;&#x5C0F;&#x60A3;&#x6709;&#x67D0;&#x79CD;&#x7CBE;&#x795E;&#x75BE;&#x75C5;&#xFF0C;&#x88AB;&#x5BB6;&#x4EBA;&#x548C;&#x5B66;&#x6821;&#x8BA4;&#x4E3A;&#x9700;&#x8981;&#x53BB;&#x300E;&#x6CBB;&#x7597;&#x300F;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x5E76;&#x4E0D;&#x50CF;&#x4E2A;&#x6240;&#x8C13;&#x7684;&#x6B63;&#x5E38;&#x4EBA;&#x3002;&#x4F46;&#x4E3B;&#x4EBA;&#x516C;&#x4E00;&#x76F4;&#x5728;&#x6A21;&#x4EFF;&#x7740;&#x5927;&#x4F17;&#xFF0C;&#x52AA;&#x529B;&#x626E;&#x6F14;&#x5927;&#x4F17;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x4EBA;&#xFF0C;&#x5E76;&#x4E14;&#x5B9E;&#x9645;&#x4E0A;&#x626E;&#x6F14;&#x5F97;&#x4E0D;&#x9519;&#xFF0C;&#x5C31;&#x50CF;&#x4F17;&#x4EBA;&#x90A3;&#x6837;&#x3002;</p>
<span id="more"></span>

<blockquote>
<p>&#x201C;&#x6211;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5728;&#x626E;&#x6F14;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x2018;&#x666E;&#x901A;&#x4EBA;&#x2019;&#x8FD9;&#x79CD;&#x865A;&#x6784;&#x7684;&#x751F;&#x7269;&#x3002;&#x8DDF;&#x4FBF;&#x5229;&#x5E97;&#x91CC;&#x7684;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5728;&#x626E;&#x6F14;&#x2018;&#x5E97;&#x5458;&#x2019;&#x8FD9;&#x79CD;&#x865A;&#x6784;&#x751F;&#x7269;&#x662F;&#x76F8;&#x540C;&#x7684;&#x9053;&#x7406;&#x3002;&#x201D;</p>
</blockquote>
<blockquote>
<p>&#x201C;&#x6211;&#x4F1A;&#x628A;&#x4F17;&#x4EBA;&#x89C9;&#x5F97;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4ECE;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x751F;&#x4E2D;&#x5220;&#x9664;&#x6389;&#x3002;&#x8FD9;&#x6216;&#x8BB8;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x6CBB;&#x7597;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x4EBA;&#x4EEC;&#x559C;&#x6B22;&#x5728;&#x6587;&#x827A;&#x4F5C;&#x54C1;&#x91CC;&#x770B;&#x5230;&#x5F02;&#x7C7B;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x666E;&#x901A;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x4E0D;&#x5177;&#x6709;&#x6545;&#x4E8B;&#x6027;&#xFF0C;&#x4F46;&#x8FD8;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x4EBA;&#x4EBA;&#x5185;&#x5FC3;&#x90FD;&#x6DF1;&#x85CF;&#x7740;&#x4E00;&#x4E2A;&#x5F02;&#x7C7B;&#xFF0C;&#x5C31;&#x50CF;&#x300A;&#x4EBA;&#x95F4;&#x4FBF;&#x5229;&#x5E97;&#x300B;&#x7684;&#x4E3B;&#x4EBA;&#x516C;&#x4E00;&#x6837;&#x3002;&#x96BE;&#x602A;&#x4EBA;&#x4EEC;&#x5E38;&#x5E38;&#x7528;&#x201C;&#x56E0;&#x4E3A;ta&#x505A;&#x4E86;&#x6211;&#x4EEC;&#x60F3;&#x53BB;&#x800C;&#x4E0D;&#x6562;&#x53BB;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x201D;&#x6765;&#x89E3;&#x91CA;&#x81EA;&#x5DF1;&#x5BF9;&#x67D0;&#x4E2A;&#x4EBA;&#x7269;&#x6216;&#x89D2;&#x8272;&#x7684;&#x559C;&#x6B22;&#x3002;</p>
<p>&#x4FBF;&#x5229;&#x5E97;&#x5C31;&#x662F;&#x4E16;&#x754C;&#xFF0C;&#x53E4;&#x4ED3;&#x5C0F;&#x59D0;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x6211;&#x3002;</p>
<p>&#x591A;&#x5E74;&#x4EE5;&#x524D;&#xFF0C;&#x5F53;&#x6211;&#x79BB;&#x5F00;&#x5317;&#x4EAC;&#x524D;&#x5F80;&#x4E0A;&#x6D77;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x95EE;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x3002;&#x5E38;&#x7528;&#x7684;&#x4E24;&#x4E2A;&#x7406;&#x7531;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x56E0;&#x4E3A;&#x5C0F;&#x65F6;&#x5019;&#x542C;&#x4E86;&#x6728;&#x739B;&#x7684;&#x90A3;&#x9996;&#x300A;&#x7F8E;&#x4E3D;&#x7684;&#x5357;&#x65B9;&#x300B;&#xFF08;&#x5C3D;&#x7BA1;&#x8FD9;&#x9996;&#x6B4C;&#x53EF;&#x80FD;&#x8DDF;&#x4E0A;&#x6D77;&#x6CA1;&#x6709;&#x4E00;&#x70B9;&#x5173;&#x7CFB;&#xFF09;&#xFF0C;&#x60F3;&#x53BB;&#x5357;&#x65B9;&#x770B;&#x770B;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7406;&#x7531;&#xFF0C;&#x5C31;&#x662F;&#x4E0A;&#x6D77;&#x7684;&#x4FBF;&#x5229;&#x5E97;&#x591A;&#x3002;&#x8FD9;&#x4FE9;&#x7406;&#x7531;&#x5C3D;&#x7BA1;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x79BB;&#x8C31;&#xFF0C;&#x4F46;&#x786E;&#x5B9E;&#x8D77;&#x7801;&#x662F;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x77E5;&#x9053;&#x559C;&#x6B22;&#x4FBF;&#x5229;&#x5E97;&#x7684;&#x539F;&#x56E0;&#x662F;&#x4FBF;&#x5229;&#x5E97;&#x7ED9;&#x4EBA;&#x5B89;&#x5168;&#x611F;&#xFF0C;&#x300A;&#x4EBA;&#x95F4;&#x4FBF;&#x5229;&#x5E97;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#x5219;&#x7ED9;&#x4E86;&#x6211;&#x53E6;&#x4E00;&#x4E2A;&#x770B;&#x5F85;&#x8FD9;&#x4EFD;&#x5B89;&#x5168;&#x611F;&#x7684;&#x6765;&#x6E90;&#x7684;&#x89C6;&#x89D2;&#x3002;<br>&#x5F53;&#x6211;&#x8FD8;&#x5728;&#x5317;&#x4EAC;&#x5FF5;&#x4E66;&#x65F6;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x5F85;&#x5230;&#x540E;&#x534A;&#x591C;&#x3002;&#x71AC;&#x591C;&#x4F7F;&#x4EBA;&#x9965;&#x997F;&#xFF0C;&#x4E8E;&#x662F;&#x4E5F;&#x7ECF;&#x5E38;&#x9A91;&#x81EA;&#x884C;&#x8F66;&#x53BB;&#x822A;&#x5929;&#x6865;&#x7684;&#x4E00;&#x5BB6;7-11&#x4E70;&#x5403;&#x7684;&#x3002;&#x6211;&#x77E5;&#x9053;7-11&#x603B;&#x662F;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x603B;&#x662F;&#x4F1A;&#x5F00;&#x95E8;&#xFF0C;&#x4E0D;&#x7BA1;&#x6211;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x53BB;&#x3002;&#x5317;&#x4EAC;&#x662F;&#x4E2A;24&#x5C0F;&#x65F6;&#x4FBF;&#x5229;&#x5E97;&#x975E;&#x5E38;&#x5C11;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x4F46;&#x5728;&#x9A91;&#x81EA;&#x884C;&#x8F66;&#x53EF;&#x8FBE;&#x8303;&#x56F4;&#x5185;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x5BB6;&#xFF0C;&#x4E5F;&#x4F1A;&#x4F7F;&#x6211;&#x5F88;&#x5B89;&#x5FC3;&#x3002;&#x751A;&#x81F3;&#xFF0C;&#x6709;&#x65F6;&#x6211;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4E70;&#x4E1C;&#x897F;&#xFF0C;&#x53EA;&#x662F;&#x9700;&#x8981;&#x9A91;&#x81EA;&#x884C;&#x8F66;&#x51FA;&#x53BB;&#x653E;&#x677E;&#x4E00;&#x4E0B;&#x5927;&#x8111;&#xFF0C;&#x4E5F;&#x7ECF;&#x5E38;&#x4F1A;&#x4E0D;&#x7531;&#x81EA;&#x4E3B;&#x9A91;&#x7684;&#x90A3;&#x91CC;&#x3002;<br>&#x540E;&#x6765;&#x53BB;&#x5230;&#x4E0A;&#x6D77;&#xFF0C;&#x6700;&#x591A;&#x7684;&#x65F6;&#x5019;&#x6211;&#x7684;&#x4F4F;&#x6240;&#x6B65;&#x884C;5&#x5206;&#x949F;&#x8303;&#x56F4;&#x5185;&#x6709;3&#x5BB6;24&#x5C0F;&#x65F6;&#x4FBF;&#x5229;&#x5E97;&#x3002;&#x5C3D;&#x7BA1;&#x4E0A;&#x73ED;&#x4E4B;&#x540E;&#x7684;&#x6211;&#x4F5C;&#x606F;&#x6BD4;&#x4E0A;&#x5B66;&#x65F6;&#x66F4;&#x300E;&#x6B63;&#x5E38;&#x300F;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4E0D;&#x592A;&#x9700;&#x8981;&#x540E;&#x534A;&#x591C;&#x53BB;&#x4FBF;&#x5229;&#x5E97;&#x4E70;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x4F46;&#x201C;&#x6211;&#x7684;&#x697C;&#x4E0B;&#x6709;3&#x5BB6;&#x4FBF;&#x5229;&#x5E97;&#xFF0C;&#x53EA;&#x8981;&#x6211;&#x9700;&#x8981;&#x968F;&#x65F6;&#x90FD;&#x80FD;&#x5728;&#x90A3;&#x91CC;&#x4E70;&#x5230;&#x4E1C;&#x897F;&#x201D;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x4F9D;&#x7136;&#x8DB3;&#x4EE5;&#x7ED9;&#x6211;&#x67D0;&#x79CD;&#x7CBE;&#x795E;&#x4E0A;&#x7684;&#x652F;&#x6301;&#x3002;<br>&#x800C;&#x770B;&#x5B8C;&#x8FD9;&#x672C;&#x4E66;&#x4E4B;&#x540E;&#x6211;&#x5728;&#x60F3;&#xFF0C;&#x4FBF;&#x5229;&#x5E97;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x7ED9;&#x4EBA;&#x8FD9;&#x79CD;&#x5B89;&#x5168;&#x611F;&#xFF0C;&#x4E0D;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x5176;&#x5C31;&#x50CF;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E00;&#x6837;&#xFF0C;&#x975E;&#x5E38;&#x89C4;&#x8303;&#xFF0C;&#x975E;&#x5E38;&#x300E;&#x6B63;&#x5E38;&#x300F;&#xFF0C;&#x6C38;&#x8FDC;&#x80FD;&#x591F;&#x4EE5;&#x4EBA;&#x4EEC;&#x6240;&#x671F;&#x5F85;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x4F5C;&#xFF1F;&#x800C;&#x8FD9;&#x4E0D;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x5185;&#x5FC3;&#x4F4F;&#x7740;&#x4E00;&#x4E2A;&#x53E4;&#x4ED3;&#x5C0F;&#x59D0;&#x7684;&#x4EBA;&#x6240;&#x6297;&#x62D2;&#x7684;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x8FD0;&#x4F5C;&#x65B9;&#x5F0F;&#x5417;&#xFF1F;</p>
<blockquote>
<p>&#x201C;&#x4FBF;&#x5229;&#x5E97;&#x662F;&#x4E00;&#x4E2A;&#x5F3A;&#x5236;&#x6027;&#x786E;&#x4FDD;&#x6B63;&#x5E38;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x8FD9;&#x79CD;&#x4EBA;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x88AB;&#x4FEE;&#x590D;&#x6389;&#x7684;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x5F88;&#x53EF;&#x80FD;&#xFF0C;&#x5927;&#x5BB6;&#x53EA;&#x662F;&#x88AB;&#x4FEE;&#x590D;&#x6389;&#x4E86;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x524D;&#x9635;&#x5B50;&#x8BFB;&#x6BDB;&#x59C6;&#x7684;&#x5C0F;&#x8BF4;&#x300A;&#x5200;&#x950B;&#x300B;&#xFF0C;&#x4E3B;&#x4EBA;&#x516C;&#x62C9;&#x91CC;&#x662F;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x5F02;&#x7C7B;&#x3002;&#x5F53;&#x65F6;&#x7684;&#x611F;&#x60F3;&#x662F;&#xFF0C;&#x968F;&#x6CE2;&#x9010;&#x6D41;&#x5C3D;&#x7BA1;&#x65E0;&#x8DA3;&#xFF0C;&#x5374;&#x4E5F;&#x5B89;&#x5168;&#xFF0C;&#x6216;&#x8BB8;&#x552F;&#x6709;&#x5982;&#x6B64;&#x4E16;&#x754C;&#x624D;&#x80FD;&#x6B63;&#x5E38;&#x8FD0;&#x8F6C;&#x3002;&#x4E07;&#x5E78;&#x7684;&#x662F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7ED9;&#x4E86;&#x90A3;&#x4E9B;&#x4E0D;&#x613F;&#x610F;&#x968F;&#x6CE2;&#x9010;&#x6D41;&#x7684;&#x4EBA;&#x4EE5;&#x751F;&#x5B58;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x53EA;&#x662F;&#x8EAB;&#x8FB9;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x4E0D;&#x5F00;&#x5FC3;&#x7F62;&#x4E86;&#x3002;&#x6B63;&#x5982;&#x62C9;&#x91CC;&#x6240;&#x8BF4;&#xFF0C;</p>
<blockquote>
<p>&#x201C;&#x6211;&#x771F;&#x7684;&#x7231;&#x4F60;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4E00;&#x4E2A;&#x4EBA;&#x65E0;&#x6CD5;&#x5728;&#x505A;&#x81EA;&#x8BA4;&#x4E3A;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x65F6;&#xFF0C;&#x4E0D;&#x8BA9;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x96BE;&#x8FC7;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x62C9;&#x91CC;&#x662F;&#x5E78;&#x8FD0;&#x7684;&#xFF0C;&#x53E4;&#x4ED3;&#x5C0F;&#x59D0;&#x5219;&#x672A;&#x5FC5;&#x3002;&#x4FBF;&#x5229;&#x5E97;&#x53EF;&#x80FD;&#x662F;&#x6211;&#x559C;&#x6B22;&#x4E0A;&#x6D77;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4F46;&#x770B;&#x5B8C;&#x300A;&#x4EBA;&#x95F4;&#x4FBF;&#x5229;&#x5E97;&#x300B;&#x4E4B;&#x540E;&#x6211;&#x660E;&#x767D;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4E5F;&#x662F;&#x6211;&#x4E0D;&#x559C;&#x6B22;&#x65E5;&#x672C;&#x7684;&#x539F;&#x56E0;&#x3002;</p>

    </div>

    
    
    

    <footer class="post-footer">
          <div class="post-tags">
              <a href="/tags/reading/" rel="tag"># reading</a>
          </div>

        

          <div class="post-nav">
            <div class="post-nav-item">
                <a href="/2023/04/22/Enforce-HTTPS-for-github-pages-custom-domin/" rel="prev" title="为GitHub Pages 自定义域名开启 Enforce HTTPS">
                  <i class="fa fa-angle-left"></i> 为GitHub Pages 自定义域名开启 Enforce HTTPS
                </a>
            </div>
            <div class="post-nav-item">
                <a href="/2023/05/09/four-days-in-a-van/" rel="next" title="在车里睡了几天">
                  在车里睡了几天 <i class="fa fa-angle-right"></i>
                </a>
            </div>
          </div>
    </footer>
  </article>
</div>






</div>
  </main>

  <footer class="footer">
    <div class="footer-inner">

  <div class="copyright">
    &copy; 
    <span itemprop="copyrightYear">2025</span>
    <span class="with-love">
      <i class="fa fa-heart"></i>
    </span>
    <span class="author" itemprop="copyrightHolder">14says</span>
  </div>
  <div class="powered-by">Powered by <a href="https://hexo.io/" rel="noopener" target="_blank">Hexo</a> & <a href="https://theme-next.js.org/muse/" rel="noopener" target="_blank">NexT.Muse</a>
  </div>

    </div>
  </footer>

  
  <div class="toggle sidebar-toggle" role="button">
    <span class="toggle-line"></span>
    <span class="toggle-line"></span>
    <span class="toggle-line"></span>
  </div>
  <div class="sidebar-dimmer"></div>
  <div class="back-to-top" role="button" aria-label="Back to top">
    <i class="fa fa-arrow-up fa-lg"></i>
    <span>0%</span>
  </div>

<noscript>
  <div class="noscript-warning">Theme NexT works best with JavaScript enabled</div>
</noscript>

</body>
</html>
